Repository: DidierSpaier/slint-website
Catalog: old/po/slint/slint.*.po
Languages: de, es, ia, nl, pl, pt_br, pt_pt, tr, uk

source: If you need help, you can post in Linux Questions' http://www.linuxquestions.org/questions/slackware-14/[Slackware forum] (in English).
de: Wenn Sie Hilfe benötigen, können Sie im Forum Linux Questions posten http://www.linuxquestions.org/questions/slackware-14/[Slackware-Forum] (auf Englisch).
es: Si necesita ayuda, puede escribir en el http://www.linuxquestions.org/questions/slackware-14/[foro de Slackware] en Linux Questions (en inglés).
ia: Si tu necessita adjuta tu pote postar in Linux Questions' http://www.linuxquestions.org/questions/slackware-14/[Slackware forum] (in Anglese).
nl: Als je hulp nodig hebt kun je terecht op Linux Questions' http://www.linuxquestions.org/questions/slackware-14/[Slackware forum] (in het Engels).
pl: Jeśli potrzebujesz pomocy, możesz zadać pytanie w http://www.linuxquestions.org/questions/slackware-14/[dziale dystrybucji Slackware] forum Linux Questions (j. angielski)
pt_br: Se você precisa de ajuda, pode perguntar no Linux Questions' http://www.linuxquestions.org/questions/slackware-14/[Slackware forum] (em inglês).
pt_pt: Se você precisar de ajuda, pode consultar o http://www.linuxquestions.org/questions/slackware-14/[fórum Slackware] do Linux Questions (em inglês).
tr: Eğer yardıma ihtiyacınız varsa Linux Questions'a http://www.linuxquestions.org/questions/slackware-14/[Slackware forum] (İngilizce) yazabilirsiniz.
uk: Якщо потрібна допомога, можете написати (англійською) на http://www.linuxquestions.org/questions/slackware-14/[форум Slackware] у Linux Questions.

source: For general questions or suggestions, like adding new translated tools to 'Slint package', register to our https://lists.sourceforge.net/lists/listinfo/slint-translators[mailing-list].
de: Für grundsätzliche Fragen oder Vorschläge, wie das Hinzufügen neuer übersetzter Werkzeuge zum 'Slint-Paket', registrieren Sie sich in unserer https://lists.sourceforge.net/lists/listinfo/slint-translators[Mailingliste].
es: Para preguntas generales o sugerencias, tales como agregar nuevas herramientas traducidas al 'paquete Slint', regístrese en nuestra https://lists.sourceforge.net/lists/listinfo/slint-translators[lista de correo].
ia: Pro demandas general o suggestiones, como adder nove instrumentos traducite in 'Pacchettos de Slint', registrate a nostre https://lists.sourceforge.net/lists/listinfo/slint-translators[mailing-list].
nl: Voor algemene vragen of suggesties zoals het toevoegen van nieuwe vertaalde tools aan 'Slint pakket' moet je je registreren op onze https://lists.sourceforge.net/lists/listinfo/slint-translators[mailing-lijst].
pl: W celu dyskutowania ogólnych spraw oraz sugesti takich jak wprowadzenie nowych narzędzi do 'pakietu Slint', proszę zarejestrować się na naszej https://lists.sourceforge.net/lists/listinfo/slint-translators[liście mailingowej].
pt_br: Para perguntas em geral ou sugestões, como adicionar novas ferramentas traduzidas ao 'Pacote Slint', registre-se a nossa https://lists.sourceforge.net/lists/listinfo/slint-translators[mailing-list].
pt_pt: Para perguntas em geral ou sugestões, como adicionar novas ferramentas traduzidas para o 'Pacote Slint', registe-se na nossa https://lists.sourceforge.net/lists/listinfo/slint-translators[mailing-list].
tr: Genel soru ya da öneriler için, 'Slint paketi'ne yeni çevirilmiş araçlar eklemek gibi, https://lists.sourceforge.net/lists/listinfo/slint-translators[mailing-list] e kayıt olun.
uk: За загальними запитаннями та пропозиціями, як-от додавання нового перекладеного інструменту до 'пакунку Slint', зареєструйтеся у нашому https://lists.sourceforge.net/lists/listinfo/slint-translators[mailing-list].

source: To stay tuned and benefit of new translated tools and translations in new languages, consult the link:changelog[ChangeLog].
de: Um auf dem Laufenden zu bleiben und von neuen übersetzten Programmen und Übersetzungen in neuen Sprachen zu profitieren, schauen Sie in den link:changelog[ChangeLog].
es: Para estar en contacto y beneficiarse de nuevas herramientas traducidas y traducciones en otros lenguajes, consulte el link:changelog[ChangeLog].
ia: Pro remaner syntonisate e beneficiar de nove instrumentos traducite e traductiones in nove linguages, consulta le link:changelog[ChangeLog]
nl: Om op de hoogte te blijven van veranderingen en nieuwe vertalingen lees je de link:changelog[ChangeLog].
pl: Aby być na bieżąco z projektem oraz korzystać z nowych narzędzi i tłumaczeń, sprawdź link:changelog[ChangeLog].
pt_br: Para acompanhar e se beneficiar de novas ferramentas traduzidas e traduções em novos idiomas, visite o link:changelog[ChangeLog].
pt_pt: Para manter-se sintonizado e beneficiar de novas ferramentas traduzidas e traduções em novos idiomas, consulte o link:changelog[ChangeLog].
tr: Bağlı kalmak için ve yeni çevirilmiş araçlardan ve çevirilerden faydalanmak için link:changelog[ChangeLog] sayfasına başvurun.
uk: Аби відстежувати оновлення та користуватися новими перекладеними інструментами й перекладами новими мовами, дивіться link:changelog[журнал змін].

source: [[note-1]]^1. Slackware (R) is a http://slackware.com/trademark/trademark.php[registered trademark] of Slackware Linux inc.^
de: [[note-1]]^1. Slackware (R) ist ein http://slackware.com/trademark/trademark.php[registriertes Markenzeichen] der Slackware Linux inc.^
es: [[note-1]]^1. Slackware (R) es una http://slackware.com/trademark/trademark.php[marca registrada] de Slackware Linux inc.^
ia: [[note-1]]^1. Slackware (R) es un http://slackware.com/trademark/trademark.php[marca de fabrica registrate] de Slackware Linux inc.^
nl: [[note-1]]^1. Slackware (R) is een http://slackware.com/trademark/trademark.php[registered trademark] van Patrick Volkerding en Slackware Linux, Inc.^
pl: [[note-1]]^1. Slackware (R) jest http://slackware.com/trademark/trademark.php[zarejestrowanym znakiem towarowym] projektu Slackware Linux inc.^
pt_br: [[note-1]]^1. Slackware (R) é uma http://slackware.com/trademark/trademark.php[marca registrada] do Slackware Linux inc.^
pt_pt: [[note-1]]^1. Slackware (R) é uma http://slackware.com/trademark/trademark.php[marca registrada] do Slackware Linux inc.^
uk: [[note-1]]^1. Slackware ® — http://slackware.com/trademark/trademark.php[зареєстрована торгова марка] Slackware Linux, Inc.^

source: [[note-2]]^2. Due to a bug but only in Slackware 13.37, after 'su' you'll need to set LANG before each command. For instance: 'LANG=fr_FR.utf8 pkgtool'^
de: [[note-2]]^2. Wegen eines Fehlers, aber nur in Slackware 13.37, müssen Sie nach Aufruf von 'su' vor jeden Befehl die Variable LANG setzen, z.B.: 'LANG=de_DE.utf8 pkgtool'^
es: [[note-2]]^2. Debido a un error presente solamente en Slackware 13.37, después de 'su' necesitará establecer LANG antes de cada comando. Por ejemplo: 'LANG=fr_FR.utf8 pkgtool'^
ia: [[note-2]]^2. Debite a un falta ma solmente in Slackware 13.37, post 'su' tu necessitara fixar LANG ante cata commando. Per exemplo: 'LANG=fr_FR.utf8 pkgtool'^
nl: [[note-2]]^2. Door een bug in alleen Slackware 13.37, moet je na 'su' elke keer opnieuw LANG instellen voor elk commando. Bijvoorbeeld: 'LANG=fr_FR.utf8 pkgtool'^
pl: [[note-2]]^2. Z powodu błędu występującego wyłącznie w systemie Slackware 13.37, po komendzie 'su' przed każdym poleceniem należy przypisać wartość zmiennej LANG. Na przykład: 'LANG=fr_FR.utf8 pkgtool'^
pt_br: [[note-2]]^2. Devido a um bug mas somente no Slackware 13.37, depois do 'su' você precisa definir LANG antes de cada comando. Por exemplo: 'LANG=fr_FR.utf8 pkgtool'^
pt_pt: [[note-2]]^2. Devido a um bug mas apenas no Slackware 13.37, depois do 'su' você precisa de definir a LANG antes de cada comando. Por exemplo: 'LANG=fr_FR.utf8 pkgtool'^
tr: [[note-2]]^2. Sadece Slackware 13.37'de bulunan bir hatadan dolayı, 'su' dan sonra her komuttan önce LANG i ayarlamalısınız. Örneğin: 'LANG=fr_FR.utf8 pkgtool'^
uk: [[note-2]]^2. У зв’язку з помилкою у Slackware 13.37, після 'su' вам потрібно встановити змінну оточення LANG перед подачею якихось команд. Наприклад: 'LANG=ru_RU.utf8 pkgtool'^
