Repository: DidierSpaier/slint-website
Catalog: old/po/slint/slint.*.po
Languages: de, es, ia, nl, pl, pt_br, pt_pt, tr, uk

source: Slint home page
de: Slint
es: Página de Inicio de Slint
ia: Pagina principal o domo de Slint
pl: Strona główna projektu Slint
pt_br: Página inicial do Slint
pt_pt: Página de início do Slint
tr: Slint ana sayfa
uk: Домашня сторінка Slint

source: Now you can install and use http://slackware.com[Slackware] in your language!
de: Jetzt können Sie http://slackware.com[Slackware] in Ihrer Sprache installieren und nutzen!
es: ¡Ahora puede instalar y usar http://slackware.com[Slackware] en su lenguaje!
ia: Nunc tu pote installar e usar http://slackware.com[Slackware] in tu linguage!
nl: Nu kun je http://slackware.com[Slackware] installeren en gebruiken in je eigen taal!
pl: Teraz możesz instalować i używać system http://slackware.com[Slackware] w twoim języku!
pt_br: Agora você pode instalar e usar http://slackware.com[Slackware] no seu idioma!
pt_pt: Agora você pode instalar e utilizar o http://slackware.com[Slackware] no seu idioma!
tr: Şimdi http://slackware.com[Slackware] i kendi dilinizde kurabilir ve kullanabilirsiniz!
uk: Тепер можна встановлювати й використовувати http://slackware.com[Slackware] рідною мовою!

source: At the time of writing, the following languages are available:
de: Aktuell stehen folgende Sprachen zur Verfügung:
es: Al momento de escribir esto, los siguientes lenguajes están disponibles:
ia: In le momento que on scribe, le sequente linguages es disponibile:
nl: Op het moment van schrijven zijn de volgende talen beschikbaar:
pl: W momencie pisania tego dostępne są następujące języki:
pt_br: No momento da escrita, os seguintes idiomas estão disponíveis:
pt_pt: No momento da escrita, os seguintes idiomas estão disponíveis:
tr: Bu metnin yazıldığı sırada şu dilleri kullanılabilir:
uk: На момент написання, були доступні наступні мови:

source: |'Dutch' |'Polish' |'Swedish' |'English (USA)' |'Portuguese (Brazil)' |'Turkish' |'French' |'Portuguese (Portugal)' |'Ukrainian' |'German' |'Russian' | |'Greek' |'Spanish (Latin America)' |
de: |'Niederländisch' |'Polnisch' |'Schwedisch' |'Englisch (USA)' |'Portugiesisch (Brasilien)' |'Türkisch' |'Französisch' |'Portugiesisch (Portugal)' |'Ukrainisch' |'Deutsch' |'Russisch' | |'Griechisch' |'Spanisch (Latein Amerika)' |
es: |'Holandés' |'Polaco' |'Sueco' |'Inglés (USA)' |'Portugués (Brazil)' |'Turco' |'Francés' |'Portugués (Portugal)' |'Ucraniano' |'Alemán' |'Ruso' | |'Griego' |'Español (América Latina)' |
ia: |'Nederlandese' |'Polonese' |'Svedese' |'Anglese (SUA)' |'Portugese (Brasil)' |'Turco' |'Francese' |'Portugese (Portugal)' |'Ukrainiano' |'Germano' |'Russo' | |'Greco' |'Espaniol (America Latin)' |
nl: |'Nederlands' |'Pools' |'Zweeds' |'Engels (USA)' |'Portugees (Braziliaans)' |'Turks' |'Frans' |'Portugees (Portugal)' |'Oekraiens' |'Duits' |'Russisch' | |'Grieks' |'Spaans (Latiijns Amerika)' |
pt_br: |'Alemão' |'Inglês (EUA)' |'Suiço' |'Espanhol (América Latina)' |'Polaco' |'Turco' |'Francês' |'Português (Brasil)' |'Ucraniano' |'Grego' |'Português (Portugal)' | |'Holandês' |'Russo' |
pt_pt: |'Holandês' |'Polaco' |'Sueco' |'Inglês (EUA)' |'Português (Brasil)' |'Turco' |'Francês' |'Português (Portugal)' |'Ucraniano' |'Alemão' |'Russo' | |'Grego' |'Espanhol (América Latina)' |
tr: |'Flemenkçe' |'Lehçe' |'İsveçli' |'İngilizce (ABD)' |'Portekizce (Brezilya)' |'Türkçe' |'Fransızca' |'Portekizce (Portekiz)' |'Ukraynaca' |'Almanca' |'Rusça'| | |'Yunanca' |'İspanyolca (Latin Amerika)' |
uk: |'Dutch' |'Polish' |'Swedish' |'English (USA)' |'Portuguese (Brazil)' |'Turkish' |'French' |'Portuguese (Portugal)' |'Українська' |'German' |'Русский' | |'Greek' |'Spanish (Latin America)' |

source: Thanks to our dozens of link:translators[benevolent translators] Slint makes that dream a reality.
de: Dank der vielzähligen link:translators[Übersetzer] lässt Slint einen Traum wahr werden.
es: Gracias a las docenas de link:translators[bondadosos traductores] Slint hace ese sueño una realidad.
ia: Gratias a nostre dozenas de link:translatores[translatores benevolente] Slint face celle sonio un realitate.
nl: Dankzij talloze link:translators[welwillende vertalers] maakt Slint deze droom werkelijkheid.
pl: Dzięki całej rzeszy naszych link:translators[życzliwych tłumaczy] projekt Slint urzeczywistnia to marzenie.
pt_br: Agradecimentos as dezenas de link:translators[dedicados tradutores] que fizeram o sonho do Slint realidade.
pt_pt: Agradecimento às dezenas de link:translators[tradutores benevolentes] que tornaram o sonho do Slint uma realidade.
tr: Onlarca Slint link:translators[yardımsever çevirmenler]imize bu rüyayı gerçeğe dönüştürdükleri için teşekkürler.
uk: Дякуємо десяткам наших link:translators[доброзичливих перекладачів] Slint, що втілили мрію.

source: The Slint project is neither affiliated to nor endorsed by Slackware[blue]^<<note-1,[1]>>^ but need it, so we encourage all Slint users to https://store.slackware.com/cgi-bin/store[financially support] Slackware.
de: Das Slint-Projekt ist weder Teil von Slackware[blue]^<<note-1,[1]>>^, noch wird es von Slackware unterstützt, braucht es aber. Deswegen möchten wir allen Slint-Nutzern die https://store.slackware.com/cgi-bin/store[finanzielle Unterstützung] von Slackware empfehlen.
es: El proyecto Slint no está afiliado ni es respaldado por Slackware[blue]^<<note-1,[1]>>^, pero lo necesita, así que alentamos a todos los usuarios de Slint a https://store.slackware.com/cgi-bin/store[ayudar financieramente] a Slackware.
ia: Le projecto de Slint project es ni affiliate ni appoiate per Slackware[blue]^<<note-1,[1]>>^ ma necessita de illo, assi nos incoragia omne usatores de Slint a https://store.slackware.com/cgi-bin/store[supportar financiariemente] Slackware.
nl: Het Slint-project maakt geen deel uit van en wordt niet erkend door Slackware[blue]^<<note-1,[1]>>^ maar heeft het wel nodig dus moedigen we alle Slint-gebruikers aan om Slackware https://store.slackware.com/cgi-bin/store[financieel te steunen]
pl: Pomimo tego, że projekt Slint nie jest w żaden sposób powiązany, bądź też wspierany przez system Slackware[blue]^<<note-1,[1]>>^, jest jednak potrzebny. Z tego powodu zachęcamy wszystkich użytkowników projektu Slint do https://store.slackware.com/cgi-bin/store[finansowego wsparcia] systemu Slackware.
pt_br: O projeto Slint não é nem filiado nem aprovado pelo Slackware [blue]^<<note-1,[1]>>^ mas precisa dele, por isso recomendamos a todos os utilizadores Slint para https://store.slackware.com/cgi-bin/store[apoiar financeiramente] o Slackware.
pt_pt: O projeto Slint não é nem filiado nem aprovado pelo Slackware [blue]^<<note-1,[1]>>^ mas precisa dele, por isso recomendamos a todos os utilizadores Slint para https://store.slackware.com/cgi-bin/store[apoiar financeiramente] o Slackware.
tr: Slint projesi Slackware[blue]^<<note-1,[1]>>^ tarafından desteklenmez ve ona bağlı değildir fakat ona ihtiyaç duyar, bu nedenle Slint kullanıcılarının Slackware'i https://store.slackware.com/cgi-bin/store[finansal olarak desteklemesini] öneririz.
uk: Проєкт Slint не афільований та не схвалений Slackware[blue]^<<note-1,[1]>>^, але її потребує, тому ми запрошуємо усіх користувачів Slint підтримати Slackware https://store.slackware.com/cgi-bin/store[фінансово].

source: The Slint Project provides:
de: Das Slint-Projekt stellt Folgendes bereit:
es: El proyecto Slint provee:
ia: Le projecto de Slint forni:
nl: Het Slint-project biedt:
pl: Projekt Slint oferuje:
pt_br: O Projeto Slint disponibiliza:
pt_pt: O Projeto Slint disponibiliza:
tr: Slint Projesi şunları sağlar:
uk: Проєкт Slint надає:

source: Polyglot 'Slint installers', available for Slackware 13.37, 14.0 and 14.1
de: Mehrsprachige 'Slint-Installer' für Slackware 13.37, 14.0 und 14.1
es: 'Instaladores Slint' políglotas, disponibles para Slackware 13.37, 14.0 y 14.1
ia: 'Installatores de Slint' Polyglotte ('Slint Installers'), disponibile per Slackware 13.37, 14.0 e 14.1
nl: Anderstalige 'Slint installers', beschikbaar voor Slackware 13.37, 14.0 en 14.1
pl: Umiędzynarodowiony 'Instalatory Slint' dostępne dla systemów Slackware 13.37, 14.0 oraz 14.1
pt_br: 'Instalador slint' poliglota, disponível para Slackware 13.37, 14.0 e 14.1
pt_pt: 'Instaladores Slint' poliglotas, disponíveis para o Slackware 13.37, 14.0 e 14.1
tr: Slackware 13.37, 14.0 ve 14.1 için çokdilli 'Slint kurucu'
uk: Багатомовні 'Установники Slint' для Slackware 13.37, 14.0 та 14.1

source: 'Slint packages', that replace Slackware administration tools with polyglot ones and install translation files and some documents.
de: 'Slint-Pakete', die Administrationsprogramme von Slackware um Mehrsprachigkeit erweitern und Übersetzungen für Dateien und Dokumente installieren.
es: 'Paquetes Slint', los cuales reemplazan las herramientas administrativas de Slackware con herramientas políglotas e instalan archivos de traducción y algunos documentos.
ia: 'Pacchettos de Slint' ('Slint Packages'), que reimplacia instrumentos de administration de Slackware con los polyglotte e installa files de traduction e altere documentos.
nl: 'Slint-pakketten' die de Slackware beheer-tools vervangen voor hun anderstalige-versies en vertaalbestanden en wat documentatie installeren.
pl: 'Pakiety Slint', które zastępują narzędzia administracyjne systemu Slackware narzędziami umiędzynarodowionymi oraz dodatkowymi dokumentami
pt_br: 'pacotes slint', que substituem as ferramentas de administração do Slackware com poliglotas e instala arquivos de tradução.
pt_pt: 'Pacotes slint', que substituem as ferramentas de administração do Slackware com as poliglotas e instalam ficheiros de tradução e alguns documentos.
tr: Slackware yönetim araçlarını çok dilli olanlarla değiştiren ve çevirileri kuran 'Slint paketleri'.
uk: 'Пакунки Slint', що заміняють адмінітрстивні інструменти Slackware на перекладені версії, встановлюють перекладені файли, та деяку документацію.

source: All 'Slint installers' installs a 'Slint package' for the same Slackware version, that can also be installed in a genuine Slackware, and upgraded as need be.
de: Alle 'Slint-Installer' installieren ein 'Slint-Paket' für die gleiche Slackware-Version, in der es auch in einem original Slackware-System installiert und aktualisiert werden kann.
es: Todos los 'instaladores Slint' instalan un 'paquete Slint' para la misma versión de Slackware, el cual puede también ser instalado en un Slackware genuino, y actualizado si es necesario.
ia: Omne 'Installatores de Slint' installa un 'Pacchetto de Slint' pro le mesme version de Slackware, que anque pote esser installate in un authentic Slackware, e actualisate como illo necessita esser.
nl: Alle 'Slint-installers' installeren een 'Slint-pakket' voor dezelfde Slackware-versie welke ook in een orginele Slackware kan worden geïnstalleerd en geüpgrade wanneer nodig.
pl: Wszystkie 'Instalatory Slint' instaluje 'pakiet Slint' dla tej samej wersji systemu Slackware, który może również być zainstalowany (a także aktualizowany) w oryginalnym systemie Slackware.
pt_br: O 'instalador slint' instala um 'pacote slint' para a mesma versão do Slakcware, que também pode ser instalado em um genuíno Slackware e atualizado conforme necessário.
pt_pt: Todos os 'instaladores Slint' instalam um 'pacote Slint' para a mesma versão do Slakcware, que também pode ser instalado num Slackware genuíno e atualizado conforme necessário.
tr: Tüm 'Slint kurucuları' aynı Slackware sürümü için 'slint paketi' kurar, ki asli Slackware içinden de kurulabilir ve gerekliyse güncellenebilir.
uk: Усі 'установники Slint' встановлюють 'пакунок Slint' для однієї і тієї ж версії Slackware, який можна встановити в оригінальну Slackware, та оновлену, якщо це буде потрібно.

source: Install Slackware in your language or internationalize it afterwards
de: Slackware in Ihrer Sprache installieren oder es nachträglich internationalisieren
es: Instale Slackware en su lenguaje o internacionalícelo después
ia: Installa Slackware in tu linguage o pone lo international postea
nl: Installeer Slackware in je eigen taal of internationaliseer het achteraf
pl: Zainstaluj system Slackware w twoim języku lub zinternacjonalizuj go później
pt_br: Instala o Slackware em seu idioma ou internacionaliza-o depois
pt_pt: Instala o Slackware no seu idioma ou internacionaliza-o depois
tr: Slackware'i kendi dilinizde kurun veya sonrasında yerelleştirin
uk: Встановлення Slackware рідною мовою або наступна інтернаціоналізація.

source: Install Slackware in your language using a 'Slint installer'
de: Installation von Slackware in Ihrer Sprache mit einem 'Slint-Installer'
es: Instale Slackware en su lenguaje usando un 'instalador Slint'
ia: Installa Slackware in tu linguage per usar 'Installator de Slackware'
nl: Installeer Slackware in jouw taal met een 'Slint-installer'
pl: Zainstaluj system Slackware przy użyciu 'Instalatora Slint'
pt_br: Instala Slackware em seu idioma usando o 'instalador slint'
pt_pt: Instala o Slackware no seu idioma usando o 'instalador Slint'
tr: 'Slint kurucu' kullanarak Slackware'i kendi dilinizde kurun
uk: Встановіть Slackware Вашою рідною мовою, використовуючи 'установник Slint'

source: Two sizes of ISO images are available, both allowing to make bootable installers:
de: ISO-Abbilder sind in zwei Größen verfügbar. Beide ermöglichen die Erstellung eines bootfähigen Installers:
es: Las imágenes ISO están disponibles en dos tamaños, ambas permiten crear instaladores de arranque:
ia: Duo grandores de imagines ISO es disponibile, ambes a facer installatores bootabile:
nl: Er zijn twee formaten ISO-images beschikbaar voor het maken van opstart-installers:
pl: Obrazy ISO dostępne są w dwóch wielkościach - obydwa pozwalają na tworzenie bootowalnych instalatorów:
pt_br: Dois tamanhos de imagens ISO estão disponíveis, ambos permitindo fazer instaladores de arranque:
pt_pt: Dois tamanhos de imagens ISO estão disponíveis, ambos permitindo fazer instaladores de arranque:
tr: İki farklı boyutta kullanılabilir ISO kalıbı var: ikisiyle de önyüklenebilir kurucular oluşturulabilir
uk: Досупні два розміри образів ISO, обидва дозволяють створити завантажувальні установники:

source: The http://sourceforge.net/projects/slint/files/[DVD + USB full ISO images] contain all you need to install Slackware.
de: Die großen http://sourceforge.net/projects/slint/files/[DVD- + USB-ISO-Abbilder] beinhalten alles Notwendige für die Installation von Slackware.
es: Las http://sourceforge.net/projects/slint/files/[imágenes ISO completas DVD + USB] contienen todo lo que necesita para instalar Slackware.
ia: Le http://sourceforge.net/projects/slint/files/[DVD + USB plen imagines ISO] contine omne cosas tu necessita pro installar.
nl: De http://sourceforge.net/projects/slint/files/[DVD + USB volledige ISO images] met alles nodig voor een volledige Slackware-installatie.
pl: http://sourceforge.net/projects/slint/files/[Pełne obrazy ISO DVD + USB] zawierają wszystko, co jest niezbędne do instalacji systemu Slackware.
pt_br: O http://sourceforge.net/projects/slint/files/[DVD + USB imagens ISO completas] contêm tudo o que você precisa para instalar o Slackware.
pt_pt: O http://sourceforge.net/projects/slint/files/[DVD + USB imagens ISO completas] contêm tudo o que você precisa para instalar o Slackware.
tr: http://sourceforge.net/projects/slint/files/[DVD + USB tam ISO kalıpları] Slackware'i yüklemek için ihtiyacınız olan her şeyi içerir.
uk: http://sourceforge.net/projects/slint/files/[DVD + USB повні ISO образи] включають в себе, усе що треба, для встановлення Slackware.

source: The https://slint.fr/installers[CD + USB small ISO images] need to be completed by a media containing the Slackware packages, for instance a Slackware DVD.
de: Die kleinen https://slint.fr/installers[CD- + USB-ISO-Abbilder] müssen durch ein Medium mit den Slackwarepaketen ergänzt werden, wie z.B. die Slackware-DVD.
es: Las https://slint.fr/installers[imágenes ISO pequeñas CD + USB] necesitan complementarse con un medio que contenga los paquetes de Slackware, por ejemplo un DVD de Slackware.
ia: Le https://slint.fr/installers[CD + parve imagines ISO de USB] necessita esser completate per un medio continente le pacchettos de Slackware, pro exemplo un DVD de Slackware.
nl: De https://slint.fr/installers[CD + USB mini ISO images] welke moeten worden aangevuld met media met de Slackware-pakketten, bijvoorbeeld een Slackware DVD.
pl: https://slint.fr/installers[Małe obrazy ISO CD + USB] potrzebują nośniki zawierające pakiety systemu Slackware, na przykład płyta DVD Slackware.
pt_br: O https://slint.fr/installers[CD + USB imagens ISO pequenas] precisam de ser completadas por uma media que contém os pacotes do Slackware, por exemplo, um DVD do Slackware.
pt_pt: O https://slint.fr/installers[CD + USB imagens ISO pequenas] precisam de ser completadas por uma media que contém os pacotes do Slackware, por exemplo, um DVD do Slackware.
tr: https://slint.fr/installers[CD + USB küçük ISO kalıpları] Slackware paketlerini içeren bir medyayla tamamlanmalıdır, örneğin bir Slackware DVD'si.
uk: https://slint.fr/installers[CD + USB невеликі ISO образи] потрібні, для доповнення носія з пакунками Slackware, наприклад для Slackware DVD.

source: See page link:installer.html[Slint installer] to know how to download the image, put it on a DVD or USB stick and use it.
de: Ausführliche Anweisungen zum Herunterladen und Schreiben des Abbilds auf eine DVD oder einen USB Stick, finden Sie auf der Seite link:installer.html[Slint installer].
es: Vea la página link:installer.html[instalador Slint] para obtener información para descargar la imagen, grabarla en un DVD or dispositivo USB y utilizarla.
ia: Vide pagina link:installer.html[Installatores de Slint] pro saber como discargar le imagine, pone lo sur un DVD o un clave USB e usa lo.
nl: Op pagina link:installer.html[Slint installer] staan instructies omtrent het downloaden van het image, hoe het op een DVD of USB stick gezet kan worden en hoe het te gebruiken.
pt_br: Veja a página link:installer.html[Slint installer] para saber como fazer o download da imagem, colocá-la em um DVD ou dispositivo USB e usá-la.
pt_pt: Veja a ligação da página link:installer.html[Instalador Slint] para saber como fazer a transferência da imagem, colocá-la num DVD ou dispositivo USB e usá-la.
uk: Дивіться сторінку link:installer.html[Slint installer], щоб взнати як стягнути образ, помістити його на DVD або USB накопичувач і використовувати.

source: A Braille terminal can also be used to install then pilot the system. Instructions for use are available in https://slint.fr/docs/README_BRLTTY.
de: Zum installieren und steuern des Systems kann auch ein 'Braille terminal' verwendet werden. Eine Bedienungsanleitung ist unter https://slint.fr/docs/README_BRLTTY verfügbar.
ia: Un terminal Braille anque pote esser usate pro installar e postea pilotar le systema. Instructiones pro usar es disponibile in https://slint.fr/docs/README_BRLTTY.
nl: Een Braille terminal kan eveneens worden gebruikt voor het installeren en daarna besturen van het systeem. GebruiksInstructies staan in https://slint.fr/docs/README_BRLTTY.
pt_br: Um terminal Braille também pode ser utilizado para instalar, em seguida, pilotar o sistema. Instruções de uso estão disponíveis em https://slint.fr/docs/README_BRLTTY.
pt_pt: Um terminal de Braille também pode ser utilizado para instalar e depois pilotar o sistema. As instruções de utilização estão disponíveis em https://slint.fr/docs/README_BRLTTY.
uk: Термінал Брайля можливо використовувати для встановлення і керування системою. Інструкції з використання доступні в https://slint.fr/docs/README_BRLTTY.

source: Internationalize your genuine Slackware or upgrade translations tools (re)installing a 'Slint package'
de: Nachträgliche Internationalisierung von Slackware oder Upgrade der Administrationwerkzeuge mit der (Neu-)Installation des 'Slint-Pakets'
es: Internacionalice su Slackware genuino o actualice las herramientas de traducción instalando o reinstalando un 'paquete Slint'
ia: Internationalisa tu genuin Slackware o actualisa instrumentos de traductiones per (re)installar un 'Pacchetto de Slint'
nl: Internationaliseer je orginele Slackware of upgrade vertaal-tools door het (her)installeren van een 'Slint-pakket'
pl: Zinternacjonalizuj oryginalny system Slackware lub zaktualizuje narzędzia translatorskie (prze)instalując 'Pakiet Slint'.
pt_br: Internacionalize seu Slackware genuíno ou atualize as ferramentas de tradução (re)instalando um 'pacote slint'
pt_pt: Internacionalize o seu Slackware genuíno ou atualize as ferramentas de tradução (re)instalando um 'pacote Slint'
tr: Asli Slackware'i yerelleştirin veya bir 'Slint paketi' (yeniden)kurarak çevirileri güncelleyin
uk: Інтернаціоналізувати вашу оригінальну Slacwkare чи оновити інструменти перекладу 'пакунок Slint'

source: Slint packages are located in directory https://slint.fr/packages[packages/]. See page link:package.html[Slint package] to know how to install a Slint package for your Slackware edition and what you get for your money :-)
de: Slint-Pakete liegen im Verzeichnis https://slint.fr/packages[packages/]. Besuchen Sie link:package.html[Slint-Paket] um zu erfahren wie Sie ein Slint-Paket in Ihrer Slackware-Edition installieren und was sie für Ihr Geld bekommen :-)
es: Los paquetes de Slint se localizan en el directorio https://slint.fr/packages[packages/]. Vea la página link:package.html[Paquete Slint] para saber cómo instalar un paquete Slint para su versión de Slackware y lo que obtiene por su dinero :-)
ia: Pacchettos de Slint es locate in directorio https://slint.fr/packages[packages/]. Vide pagina link:package.html[Pacchetto de Slint] pro saper como installar un pacchetto de Slint pro tu edition de Slackware e lo que tu obtene per tu moneta :-)
nl: Slint-pakketten staan in directory https://slint.fr/packages[packages/]. Zie pagina link:package.html[Slint-pakket] hoe je een Slint-pakket voor jouw Slackware-versie installeert en wat je krijgt voor je geld :-)
pl: Pakiety Slint znajdują sie w katalogu https://slint.fr/packages[packages/]. Odwiedź stronę link:package.html[Slint package] by dowiedzieć się jak zainstalować pakiet Slint dla twojej wersji systemu Slackware i co wchodzi w skład pakietu.
pt_br: Pacotes Slint estão localizados no diretório https://slint.fr/packages[pacotes/]. Veja a página link:package.html[pacote Slint] para saber como instalar um pacote slint para a sua versão do Slackware e o que você ganha pelo seu dinheiro :-)
pt_pt: Os pacotes Slint estão localizados no diretório https://slint.fr/packages[pacotes/]. Veja a página link:package.html[pacote slint] para saber como instalar um pacote Slint para a sua versão do Slackware e o que você ganha pelo seu dinheiro :-)
tr: Slint paketleri https://slint.fr/packages[packages/] dizini içine yerleştirilmiştir. Slackware yayımınız için bir Slint paketinin nasıl kurulduğunu ve paranız karşılığında ne aldığınızı :) öğrenmek için link:package.html[Slint package] sayfasına bakınız.
uk: Пакунки Slint розташовані у директорії https://slint.fr/packages[пакунки/]. Дивіться сторінку link:package.html[Пакунок Slint] щоб дізнатись як встановити Slint для вашої версії Slackware, та розуміти що ви отримуєте за свої грощі :-)

source: Install or reinstall a 'Slint package' if you want to:
de: Installieren Sie ein 'Slint-Paket' neu oder erneut, wenn Sie wollen:
es: Instale o reinstale un 'paquete Slint' si desea:
ia: Installa o reinstalla un 'Pacchetto de Slint' si tu vole:
nl: (Her)installeer een 'Slint-pakket' wanneer je:
pl: Zainstaluj lub przeinstaluj 'Pakiet Slint' jeśli chcesz:
pt_br: Instala ou reinstala um 'pacote slint' se você quiser:
pt_pt: Instala ou reinstala um 'Pacote Slint' se você quiser:
tr: Bir 'Slint paketi'ni kurun ya da yeniden kurun, eğer şunları istiyorsanız:
uk: Встноавіть чи перевстановіть 'пакунок Slint' якщо ви цього прагните:
