Repository: DidierSpaier/slint-website
Catalog: old/po/slint/slint.*.po
Languages: de, es, ia, nl, pl, pt_br, pt_pt, tr, uk

source: internationalize an already installed Slackware 13.37, 14.0 or 14.1 (if you didn't use a Slint installer)
de: Internationalisieren Sie ein bereits installiertes Slackware 13.37, 14.0 oder 14.1 (falls Sie keinen Slint-Installer verwendet haben).
es: internacionalizar un sistema ya instalado de Slackware 13.37, 14.0 o 14.1 (si no utilizó un instalador Slint)
ia: internationalisa un Slackware 13.37, 14.0 o 4.1 jam installate ( si tu non usava un installator de Slint)
nl: een reeds geïnstalleerde Slackware 13.37, 14.0 of 14.1 wilt internationaliseren (en je hebt geen Slint Installer gebruikt)
pl: zinternacjonalizować zainstalowany system Slackware 13.37, 14.0 lub 14.1 (jeśli nie używałeś instalatora Slint)
pt_br: internacionaliza um Slackware 13.37, 14.0 ou 14.1 já instalado (se você não usou o instalador Slint)
pt_pt: internacionalizar um Slackware 13.37, 14.0 ou 14.1 já instalado (se você não utilizou um instalador Slint)
tr: Halihazırda kurulmuş Slackware 13.37, 14.0 ya da 14.1 i yerelleştirmek için (Slint kurucu kullanmadıysanız)
uk: інтернаціоналізувати встановлену Slackware 13.37, 14.0 або 14.1 (якщо не використовували інсталятор Slint)

source: get new translated tools, fixes and translations in new languages.
de: Erhalten Sie neu übersetzte Programme, Korrekturen und Übersetzungen in neuen Sprachen.
es: obtener nuevas herramientas traducidas, correcciones y traducciones en nuevos lenguajes.
ia: obtene nove instrumentos traducite, correctiones e traductiones in nove linguages.
nl: nieuw vertaalde tools, fixes en nieuwe talen wilt installeren.
pl: otrzymać nowe narzędzia translatorskie, poprawki i tłumaczenia w nowych językach.
pt_br: tenha novas ferramentas traduzidas, correções e traduções em novos idiomas.
pt_pt: ter novas ferramentas traduzidas, correções e traduções em novos idiomas.
tr: yeni çevirilmiş araçlar, düzeltmeler ve yei dillerde çeviriler edin.
uk: отримати нові переклади інструментів, виправлення, переклади новими мовами.

source: Use your polyglot Slackware
de: Verwendung Ihres mehrsprachigen Installers
es: Use su Slackware políglota
ia: Usa tu Slackware polyglotte
nl: Gebruik je anderstalige Slackware
pl: Użyj swój polyglotowski system Slackware
pt_br: Use seu Slackware poliglota
pt_pt: Utilize o seu Slackware poliglota
tr: Çokdilli Slackware'inizi kullanın
uk: Використання багатомовної Slackware

source: A locale is the definition of the subset of a user's environment that depends on language and cultural conventions.
de: Ein Gebietsschema ist die Definition eines Teils einer Benutzerumgebung, das von Sprache und Kulturgut abhängt.
es: Una localización es la definición de un subconjunto del ambiente de un usuario que depende del lenguaje y convenciones culturales.
ia: Un locale es le definition del subinsimul de un ambiente de usator que depende sur linguage e conventiones cultural.
nl: Een locale is de definitie van de subset van de gebruikersomgeving die afhangt van taal en culturele conventies.
pl: locale definiuje podzbiór środowiska użytkownika zależący od językowych and kulturowych konwencji.
pt_br: O locale é a definição do subconjunto de ambiente do usuário que depende do idioma e de convenções culturais.
pt_pt: A localização é a definição do subconjunto de ambiente do utilizador que depende do idioma e de convenções culturais.
tr: Bir locale kullanıcı ortamının diline ve kültürel geleneklere bağlı olarak bir alt küme tanımlamasıdır.
uk: Локаль вказується підмножиною змінних оточення користувача, що залежать від мови та культурних особливостей.

source: Set up your preferred locale
de: Setzen Ihres bevorzugten Gebietsschemas
es: Configurar su localización preferida
ia: Stabili tu localisation preferite
nl: Stel je gewenste locale in
pl: Ustawić preferowane locale
pt_br: Defina a escolha do seu locale
pt_pt: Defina a escolha da sua localização
tr: Tercih edilen locale nizi seçin
uk: Встновіть вашу улюблену мову

source: The Slint installer makes default locale settings in installed system according to language used during installation, but if you installed a Slint package to internationalize a genuine Slackware you'll need to make these settings yourself.
de: Der Slint-Installer macht Standardeinstellungen für das Gebietsschema im System das installiert wird, bezüglich der Sprache, die während der Installation benutzt wird. Wenn Sie aber ein Slint-Paket installiert haben, um Ihre bestehende Slackware-Installation zu internationalisieren, müssen Sie diese Einstellungen selbst vornehmen.
es: El instalador Slint crea una configuración de localización predeterminada en un sistema instalado de acuerdo al lenguaje utilizado durante la instalación, pero si instaló un paquete Slint para internacionalizar un Slackware genuino, necesitará hacer esta configuración usted mismo.
ia: Le installator de Slint face preferentias de locale predefinite in le systema installate secundo le linguage usate durante le installation, ma si tu installava un pacchetto pro internationalisar un genuin Slackware tu necessitara facer iste preferentias pro tu mesme.
nl: De Slint installer configureert in een systeem de standaard locale instellingen op basis van de taal die tijdens de installatie werd gekozen. Als je Slint installeert om een orgineel Slackware systeem te internationaliseren zul je deze instellingen zelf moeten aanpassen.
pl: Instalator Slint ustawia domyślne ustawienia locale zainstalowanego systemu zgodnie z językiem użytym podczas instalacji. Jeśli jednak zainstalowałeś pakiet Slint by umiędzynarodowić oryginalny system Slackware, będziesz musiał sam zadbać o te ustawienia.
pt_br: O instalador Slint define as configurações de locale padrão no sistema instalado de acordo com o idioma usado durante a instalação, mas se você instalou o pacote Slint para internacinalizar o Slackware genuíno você terá que fazer essas configurações por si mesmo.
pt_pt: O instalador Slint define as configurações de localização padrão no sistema instalado de acordo com o idioma usado durante a instalação, mas se você instalou o pacote Slint para internacionalizar o Slackware genuíno você terá que fazer essas configurações por si mesmo.
tr: Slint kurucu kurulum sırasında kullanılan dile bağlı olarak kurulu sistemde varsayılan locale ayarını yapar, fakat eğer asıl Slackware i yerelleştirmek için bir Slint paketi kurduysanız bu ayarı kendiniz yapmalısınız.
uk: Інсталятор Slint налаштовує у встановленій системі типову локаль у відповідності з мовою, використаною при встановленні; при інтернаціоналізації оригінальної Slackware пакунком Slint таке налаштування потрібно виконати вручну.

source: To view messages in your preferred language, just set the LANG parameter accordingly in file /etc/profile.d/lang.sh[blue]^<<note-2,[2]>>^ For instance, to display messages in Brazilian Portuguese, you would replace the `en_US` default setting like this:
de: Um Meldungen in Ihrer bevorzugten Sprache zu sehen, setzen Sie entsprechend die Variable LANG in der Datei /etc/profile.d/lang.sh[blue]^<<note-2,[2]>>^. Um z.B. Meldungen in brasilianischem Protugiesisch zu erhalten, ändern Sie das voreingestellte 'en_US' so:
es: Para ver mensajes en su lenguaje preferido, solo ajust el parámetro LANG como corresponde en el archivo /etc/profile.d/lang.sh[blue]^<<note-2,[2]>>^ Por ejemplo, para desplegar mensajes en Portugués Brasileño, debe reemplazar el valor predeterminado `en_US` de esta forma:
ia: Pro vider messages in tu linguage preferite, solmente fixa le parametro LANG in consequentia in file /etc/profile.d/lang.sh[blue]^<<note-2,[2]>>^ Pro exemplo, pro monstrar messages in Portugese Brasilian, tu reimplaciara le fixation predefinite `en_US` como isto:
nl: Om berichten in de taal van je keuze te zien configureer je de LANG parameter overeenkomstig in het bestand /etc/profile.d/lang.sh[blue]^<<note-2,[2]>>^ Om bijvoorbeeld meldingen in Braziliaans Portugees te zien moet je de standaardwaarde `en_US` vervangen:
pl: Aby wyświetlić komunikaty w twoim języku, ustaw odpowiednio parametr LANG w pliku /etc/profile.d/lang.sh[blue]^<<note-2,[2]>>^ Na przykład, by wyświetlić komunikaty w języku brazylijskim portugalskim, zamień domyślne ustawienia 'en_US' na:
pt_br: Para ver mensagens no seu idioma escolhido, defina o parâmetro LANG adequadamente no arquivo /etc/profile.d/lang.sh[blue]^<<note-2,[2]>>^ Por exemplo, para exibir mensagens em Português Brasileiro, você terá que trocar a configuração padrão`en_US` assim:
pt_pt: Para ver mensagens no seu idioma escolhido, defina o parâmetro LANG adequadamente no ficheiro /etc/profile.d/lang.sh[blue]^<<note-2,[2]>>^ Por exemplo, para exibir mensagens em Português de Portugal, você terá que trocar a configuração padrão `en_US` assim:
tr: Tercih ettiğiniz dilde mesajı görmek için /etc/profile.d/lang.sh[blue]^<<note-2,[2]>>^ bağlı olarak LANG parametresini ayarlayın Örneğin, mesajı Brezilya Portekizcesinde görmek için varsayılan `en_US` değerini şöyle değiştirirdiniz:
uk: Щоб бачити повідомлення на Вашій мові, просто налаштуйте параметр оточення LANG в файлі /etc/profile.d/lang.sh[blue]^<<нотатка-2,[2]>>^ Наприклад, аби показувалися повідомлення українською, змініть типове `en_US` на:

source: export LANG=pt_BR.utf8 # locale name should end in .utf8 to match UTF-8 encoding of translated messages
de: export LANG=pt_BR.utf8 # Der Name der Lokalen sollte mit .utf8 enden, um UTF-8-Kodierung in den übersetzten Meldungen zu unterstützen
es: export LANG=pt_BR.utf8 # el nombre de la localización debe terminar en .utf8 para que corresponda la codificación UTF-8 de los mensajes traducidos
ia: exporta LANG=pt_BR.utf8 # nomine de locale deberea terminar in .utf8 pro corresponder a codification UTF-8 de messages traducite
nl: export LANG=pt_BR.utf8 # locale naam eindigt op .utf8 overeenkomend met de UTF-8 codering van de vertaalde teksten.
pl: export LANG=pt_BR.utf8 # nazwa locale powinna kończyć się końcówką .utf8 by pasować do systemu kodowania UTF-8 przetłumaczonych komunikatów
pt_br: export LANG=pt_BR.utf8 # o nome do locale deve terminar em .utf8 para combinar com a codificação das mensagens traduzidas
pt_pt: export LANG=pt_PT.utf8 # o nome da localização deve terminar em .utf8 para combinar com a codificação das mensagens traduzidas UTF-8
tr: export LANG=pt_BR.utf8 # locale ismi çevirilen mesajlardaki UTF-8 kodlamasıyla eşleşmesi için .utf8 ile bitmeli
uk: export LANG=uk_Uk.utf8 # ім’я локалі має закінчуватися на .utf8 при використанні консолі в UTF-8

source: Also , to properly display translated manual pages that are encoded in UTF-8, insert 'one' of following commands in your ~/.bashrc:
de: Damit auch übersetzte Handbuchseiten korrekt angezeigt werden, die mit UTF-8 kodiert sind, tragen Sie einen der folgenden Befehle in Ihre ~/.bashrc ein:
es: Asimismo, para desplegar apropiadamente páginas de manual traducidas que están codificadas en UTF-8, inserte 'uno' de los siguientes comandos en su ~/.bashrc:
ia: De plus , pro monstrar correctemente paginas de manual traducite que es codificate in UTF-8, inserta 'un' de sequente commandos in tu ~/.bashrc:
nl: Om ook vertaalde man pages die UTF-8 gecodeerd zijn correct weer te geven moet je een van de volgende commando's in je ~/.bashrc opnemen:
pl: Ponadto, w celu poprawnego wyświetlenia przetłumaczonych stron man (zakodowanych w UTF-8), umieść 'jedną' z poniższych poleceń w twoim ~/.bashrc:
pt_br: E também, para exibir corretamente as páginas do manual traduzidas que são codificadas em UTF-8, insira 'um' dos seguintes comandos no seu ~/.bashrc:
pt_pt: E também, para exibir corretamente as páginas do manual traduzidas que são codificadas em UTF-8, insira 'um' dos seguintes comandos no seu ~/.bashrc:
tr: Ayrıca, UTF-8 ile kodlanmış çevirilen kılavuz sayfalarını doğru bir şekilde görüntülemek için, ~/.bashrc dosyanızın içine şu komutlardan 'birini' ekleyin:
uk: Аби перекладені сторінки керівництв у UTF-8, показувалися правильно, вставте 'одну' з команд нижче до свого ~/.bashrc:

source: export GROFF_ENCODING=utf8 # If all man pages you read are either in English or encoded in UTF-8 alias uman="GROFF_ENCODING=utf8 man" # If you also read man pages in other encodings
de: export GROFF_ENCODING=utf8 # Um alle Handbuchseiten in UTF-8-Kodierung zu lesen alias uman="GROFF_ENCODING=utf8 man" # Um auch Handbuchseiten in anderen Kodierungen lesen zu können
es: export GROFF_ENCODING=utf8 # si todas las páginas de manual que lee están en Inglés o codificadas en UTF-8 alias uman="GROFF_ENCODING=utf8 man" # si también lee páginas de manual con otras codificaciones
ia: export GROFF_ENCODING=utf8 # si omne paginas de man que tu lege es o in anglese o codificate in UTF-8 alias uman="GROFF_ENCODING=utf8 man" # si tu anque lege paginas de man in altere codificationes
nl: export GROFF_ENCODING=utf8 # Als alle man pages in het Engels of UTF-8 gecodeerd zijn. alias uman="GROFF_ENCODING=utf8 man" # Als je ook anders gecodeerde man pages leest.
pl: export GROFF_ENCODING=utf8 # Jeśli wszystkie strony man są albo w języku angielskim lub zakodowane w systemie UTF-8 alias uman="GROFF_ENCODING=utf8 man" # Jeśli także czytasz strony man w innych systemach kodowania
pt_br: export GROFF_ENCODING=utf8 # Se todas as páginas de manuais que você lê são em Inglês ou codificadas em UTF-8 alias uman="GROFF_ENCODING=utf8 man" # Se você também lê páginas em outras codificações
pt_pt: export GROFF_ENCODING=utf8 # Se todas as páginas de manual que você lê são em Inglês ou codificados em UTF-8 alias uman="GROFF_ENCODING=utf8 man" # Se você também lê páginas man noutras codificações
tr: export GROFF_ENCODING=utf8 # eğer okuduğunuz tüm kılavuz dosyaları İngilizce ya da UTF-8 kodlanmış ise alias uman="GROFF_ENCODING=utf8 man" # eğer kılavuz sayfalarını diğer kodlamalarda da okuyorsanız
uk: export GROFF_ENCODING=utf8 # Якщо всі сторінки керівництв англійською або у UTF-8 alias uman="GROFF_ENCODING=utf8 man" # Якщо читаєте сторінки керівництв і в інших кодуваннях

source: If you use the latter, you will type "uman" instead of "man" in a terminal to display manual pages encoded in UTF-8.
de: Wenn Sie die zweite Variante nutzen, geben Sie im Terminal "uman" anstellen von "man" ein, um Handbuchseiten in UTF-8-Kodierung angezeigt zu bekommen.
es: Si utiliza el último comando, escriba "uman" en lugar de "man" en una terminal para desplegar páginas de manual codificadas en UTF-8.
ia: Si tu usa iste, tu typara"uman" in vice de "man" in un terminal pro monstrar paginas de manual codificate in UTF-8.
nl: Bij gebruik van de laatste zul je "uman" in plaats van "man" in een terminal moeten gebruiken om UTF-8 gecodeerde man pages weer te geven.
pl: Jeśli wybierzesz drugą opcję, zamiast "man" wpiszesz w terminalu "uman" w celu wyświetlenia stron man zakowowanych w systemie UTF-8.
pt_br: Se você usa o latter, você digita "uman" no lugar de "man" em um terminal para exibir páginas do manual codificadas em UTF-8.
pt_pt: Se você usar o último, você irá escrever "uman" em vez de "man" num terminal para exibir páginas de manual codificadas em UTF-8.
tr: Eğer ikincisini kullanırsanız, UTF-8 kodlanmış kılavuz sayfalarını uç birimde görüntülemek için "man" yerine "uman" yazacaksınız.
uk: Якщо ж Ви скористалися останнім варіянтом, для показу сторінок керівництв в UTF-8 в емуляторі терміналу, наберіть «uman» замість «man».

source: Administrate Slackware in your language
de: Slackware in Ihrer Sprache verwalten
es: Administre Slackware en su lenguaje
ia: Administra Slackware in tu linguage
nl: Beheer Slackware in je eigen taal
pl: Zarządzaj systemem Slackware w twoim języku
pt_br: Gerencie o Slackware em seu idioma
pt_pt: Administrar o Slackware no seu idioma
tr: Slacware i kendi dilinizde yönetin
uk: Адміністрування Slackware своєю мовою

source: 'Slint installers' as well as 'Slint packages' replace main Slackware tools by polyglot ones, and add translated man pages.
de: Sowohl 'Slint-Installer', als auch 'Slint-Pakete' ersetzen die Hauptprogramme von Slackware durch mehrsprachige und fügen übersetzte Handbuchseiten hinzu.
es: Los 'instaladores Slint' así como los 'paquetes Slint' reemplazan herramientas principales de Slackware con herramientas políglotas, y añaden páginas de manual.
ia: 'Installatores de Slint' assi como 'Pacchettos de Slint' reimplacia le instrumentos principal de Slackware per illos polyglotte, e adde paginas de man traducite.
nl: Zowel 'Slint installers' als 'Slint pakketten' vervangen de Slackware tools door anderstalige versies en voegen vertaalde man pages toe.
pl: 'Instalatory Slint', jak również 'pakiety Slint' zastępują oryginalne narzędzia systemu Slackware narzędziami wielojęzykowymi oraz dodają przetłumaczone strony man.
pt_br: Os 'Instaladores Slint' assim como os 'Pacotes Slint' substituem as principais ferramentas do Slackware por poliglotas, e adicionam páginas dos manuais traduzidas.
pt_pt: Os 'Instaladores Slint' bem como os 'Pacotes Slint' substituem as principais ferramentas do Slackware pelos poliglotas e adicionam páginas dos manuais traduzidas.
tr: 'Slint kurucuları' 'Slint paketleri' gibi ana Slackware araçlarını çok dilli olanlarla değiştirir ve çevirilmiş kılavuz sayfalarını ekler.
uk: 'Встановник Slint' як і 'пакунок Slint' замінює базові інструменти Slackware їх багатомовними варіянтами та додає перекладені сторінки керівництв.

source: All polyglot tools currently available are listed in page link:package#what_is_translated[Slint package]. They allow you to:
de: Alle z.Zt. verfügbaren mehrsprachigen Programme sind unter link:package#what_is_translated[Slint-Paket] gelistet. Sie erlauben Ihnen:
es: Todas las herramientas políglotas disponibles están listadas en la página link:package#what_is_translated[Slint package]. Estas le permiten:
ia: Omne instrumentos polyglotte currentemente disponibile es listate in le pagina link:package#what_is_translated[Slint package]. Illos permitte te de:
nl: Alle momenteel beschikbare anderstalige tools staan op pagina link:package#what_is_translated[Slint pakket]. Ze stellen je in staat om:
pl: Wszystkie obecnie dostępne wielojęzyczne narzędzia wymienione są na stronie link:package#what_is_translated[Pakiet Slint]. Pozwalają one:
pt_br: Todas as ferramentas poliglotas atualmente disponíveis estão listadas na página link:package#what_is_translated[Pacote Slint]. Elas permitem você a:
pt_pt: Todas as ferramentas poliglotas atualmente disponíveis estão exibidas na página link:package#what_is_translated[pacote slint]. Elas permitem-lhe:
tr: Şu an müsait tüm çok dilli araçlar link:package#what_is_translated[Slint package] sayfasında listelenmiştir. Bunlar şunları sağlar:
uk: Усі доступні на сьогодні багатомовні інструменти приведено на сторінці link:package#what_is_translated[пакет Slint]. Вони дозволяють:

source: Manage software packages
de: Softwarepakete zu verwalten
es: Administrar paquetes de software
ia: Gere pacchettos software
nl: Software pakketten te beheren
pl: Zarządzać paczkami programów
pt_br: Gerenciar pacotes de programas
pt_pt: Gerir pacotes de software
tr: Yazılım paketlerini yönetin
uk: Керувати пакунками проґрам

source: Add users
de: Benutzer hinzuzufügen
es: Agregar usuarios
ia: Adde usatores
nl: Gebruikers toe te voegen
pl: Dodać użytkowników
pt_br: Adicionar usuários
pt_pt: Adicionar utilizadores
tr: Kullanıcı ekle
uk: Додати користувачів

source: (re)configure your system: decide which system daemons (services) to start at boot time, create new users, reconfigure your boot loader, choose default windows manager or desktop, configure your network, make an USB Linux boot stick
de: Ihr System (neu) zu konfigurieren: Entscheiden welche Daemons (Dienste) beim Booten gestartet werden, Erstellen neuer Benutzer, Konfigurieren des Bootloaders, Wahl des Standard-Fenstermanagers oder -Desktops, Netzwerkkonfiguration, Erstellen eines Linux-Boot-Sticks
es: (re)configurar su sistema: decidir cuáles demonios del sistema (servicios) iniciar a la hora del arranque, crear nuevos usuarios, reconfigurar su gestor de arranque, elegir manejadores de ventanas o escritorios predeterminados, configurar su red, crear un dispositivo USB para iniciar Linux
ia: (re)configurar tu systema: decide qual daemons(servicios) de systema initiar in le momento de boot, crear nove usatores, reconfigurar tu cargator de boot, seliger le gerente predefinite de fenestras, configurar tu rete, facer un clave USB de boot de Linux
nl: Je systeem te (her)configureren: bepalen welke system daemons starten tijdens het booten, nieuwe gebruikers toevoegen, je boot loader opnieuw instellen, je standaard window manager of desktop kiezen, je netwerk instellen of een Linux USB-stick maken om op te starten.
pl: (prze)konfigurować system: wybierz demony (usługi) do uruchomienia przy starcie, utwórz konta użytkowników, przekonfiguruj program rozruchowy, wybierz domyślne środowisko graficzne, skonfiguruj sieć, utwórz dysk rozruchowy USB.
pt_br: (re)configura seu sistema: define quais daemons (serviços) inciam na hora do boot, cria novos usuários, reconfigura seu boot loader, escolhe gerenciador de janelas ou área de trabalho padrão, configura sua rede, cria um USB Linux boot stick
pt_pt: (re)configurar o seu sistema: defina quais os daemons (serviços) que iniciam no momento do arranque, crie novos utilizadores, reconfigure o seu gestor de arranque, escolha o gestor de janelas ou área de trabalho padrão, configure a sua rede, crie uma unidade USB Linux de arranque
tr: sisteminizi (yeniden)yapılandırın: önyükleme sırasında hangi sitem düreçlerinin (hizmetler) başlayacağına karar verin, yeni kullanıcılar oluşturun, önyükleyicinizi yeniden yapılandırın, varsayılan masaüstü yöneticisini ya da masaüstünü seçin, ağınızı yapılandırın, USB önyükleme belleği oluşturun
uk: (пере)налаштовувати систему: вирішувати, які системні демони (сервіси) запускати при завантаженні, створювати нових користувачів, переналаштовувати завантажувач, вибирати типові віконний менеджер або стільницю, налаштовувати мережу, створювати завантажувальний носій USB з Linux

source: Contribute, get help, stay tuned
de: Unterstützen, Hilfe bekommen, auf dem Laufenden bleiben
es: Contribuya, obtenga ayuda, manténgase atento
ia: Contribue, obtene adjuta, remane syntonisate
nl: Draag bij, zoek hulp, blijf op de hoogte
pl: Wsparcie, pomoc, aktualności
pt_br: Contribuir, ter ajuda, acompanhar
pt_pt: Contribua, obtenha ajuda, acompanhe
tr: Katkı ver, yardım al, bağlı kal
uk: Сприяння, отримання допомоги, оновлення

source: If want to contribute to the Slint Project, either as a translator or otherwise, see page link:contribute[Contribute]
de: Wenn Sie das Slint-Projekt unterstützen wollen, entweder als Übersetzer oder auf eine andere Weise, dann klicken Sie link:contribute[Unterstützen].
es: Si desea contribuir al Proyecto Slint, ya sea como traductor u otro, vea la página link:contribute[Contribute]
ia: Si tu vole contribuer al Projecto Slint, e como traductor e alteremente, vide le pagina link:contribute[Contribue]
nl: Als je iets bij wilt dragen aan het Slint Project als vertaler of anderszins, kijk dan op link:contribute[Draag Bij]
pl: Jeśli chciałbyś wspomóc Projekt Slint jako tłumacz, bądź w jakikolwiek inny sposób, odwiedź stronę link:contribute[Wsparcie]
pt_br: Se você quer contribuir para o Projeto Slint, seja como tradutor ou outro jeito, acesse a página link:contribute[Contribute]
pt_pt: Se quiser contribuir para o Projeto Slint, seja como tradutor ou de outra forma, veja a página link:contribute[Contribuir]
tr: Slint projesine katkı vermek istiyorsanız, çevirmen olarak ya da başka şekilde, link:contribute[Contribute] sayfasına bakınız
uk: Якщо бажаєте допомогти проєкту Slint, як перекладач або ще якось, дивіться сторінку link:contribute[Сприяння]
