Repository: DidierSpaier/slint-website
Catalog: old/po/contribute/contribute.*.po
Languages: es, fr, nl, pt_pt, ru, tr

source: Contribute to the Slint project
es: Contribuir al Proyecto Slint
fr: Contribuer au projet Slint
nl: Draag bij aan het Slint project
pt_pt: Contribua para o projeto Slint
ru: Содействие проекту Slint
tr: Slint projesine katkıda bulun

source: So, you want to help and contribute to the Slint project? Welcome on board!
es: ¿Así que quiere ayudar y contribuir al proyecto Slint? !Bienvenido a bordo!
fr: Ainsi, vous voulez nous aider et contribuer au projet Slint ? Bienvenue à bord !
nl: Dus je wilt meehelpen en bijdragen aan het Slint project? Welkom aan boord!
pt_pt: Então, você quer ajudar e contribuir para o projeto Slint? Bem-vindo a bordo!
ru: Итак, вы хотите помочь и содействовать проекту Slint? Добро пожаловать на борт!
tr: Slint projesine yardım etmek ve katkıda bulunmak mı istiyorsunuz? Gemiye hoşgeldiniz!

source: Needed work to provide Slint's products is mostly translating and reviewing shell scripts, that make up Slackware's installers and administration tools, and documentation intended for Slackware users taking the form of text files or manual pages.
es: El trabajo necesario para proveer los productos de Slint es en su mayoría traducción y revisión de scripts de shell, los cuales forman los instaladores y herramientas de administración de Slackware, así como documentación orientada a los usuarios de Slackware en forma de archivos de texto o páginas de manual.
fr: La travail nécessaire pour procurer les produits Slint consiste principalement à traduire (puis réviser la traduction) des scripts shell qui constituent les installateurs de Slackware et ses outils d'administration, ainsi que la documentation destinée aux utilisateurs de Slackware, qui prend la forme de fichiers textes ou de pages de manuel.
nl: Wat we vooral nodig hebben om de Slint producten te kunnen aanbieden is het vertalen en controleren van de shell scripts die samen de Slackware installer en administratie-programma's vormen, en van de documentatie voor Slackware gebruikers in de vorm van tekstbestanden of manual pagina's..
pt_pt: O trabalho necessário para fornecer os produtos Slint são maioritariamente a tradução e a revisão de scripts shell, que compõem os instaladores do Slackware, ferramentas de administração e documentação destinada a utilizadores do Slackware que tomam a forma de ficheiros de texto ou páginas de manual.
ru: Необходимая работа над продуктом Slint - в большинстве перевод и вычитка сценариев оболочки, которые создают установщики Slackware и административных инструментов, документации для конечных пользователей Slackware, принимающей форму текстовых файлов или страниц руководств.
tr: Slint ürünleri sağlamak için gerekli iş çoğunlukla çeviri ve, Slackware kurucularını, yönetim araçlarını oluşturan kabuk betikletinin gözden geçirilmesi, ve Slackware kullanıcıları için metin dosyaları veya kılavuz sayfaları biçiminde olan belgelendirmedir.

source: Ideally, we would like that translators:
es: Idealmente, nos gustaría que los traductores:
fr: Idéalement, nous souhaiterions que les traducteurs :
nl: Het liefst willen we van vertalers zien dat ze:
pt_pt: Idealmente, gostaríamos que os tradutores:
ru: В идеале, мы хотели бы, чтобы переводчики:
tr: İdeal olarak çevirmenlerin şunları yapmasını isteriz:

source: be able to communicate in English and very fluent in the target language, preferably their native language
es: sean capaces de comunicarse en Inglés y que tengan bastante fluidez en el lenguaje destino, preferiblemente su lenguaje nativo
fr: soient capables de communiquer en Anglais et parlent très couramment la langue cible (de préférence leur langue maternelle )
nl: in staat zijn om in het Engels te communiceren en erg bedreven zijn in de doel-taal, bij voorkeur hun moedertaal
pt_pt: fossem capazes de comunicar em Inglês e muito fluente no idioma alvo, de preferência sua língua nativa
ru: были способны общаться на английском языке и очень хорошо знали целевой язык, предпочтительно свой родной.
tr: İngilizce iletişim kurabilin ve hedef dilde, tercihen doğal dilde, çok akıcı olun,

source: understand technical vocabulary associated to installation and administration of a Linux system
es: entiendan vocabulario técnico relacionado con la instalación y administración de un sistema Linux
fr: comprennent le vocabulaire technique associé à l'installation et l'administration d'un système Linux
nl: het technische vocabulaire begrijpen dat hoort bij het installeren en beheren van een Linux systeem
pt_pt: compreendessem o vocabulário técnico associado à instalação e administração de um sistema Linux
ru: понимали техническую терминологию, связанную с установкой и администрированием систем Linux
tr: Bir Linux sisteminin kurulumu ve yönetini ile ilgili teknik terimleri anlayın

source: be Slackware users
es: sean usuarios de Slackware
fr: soient des utilisateurs de Slackware
nl: daadwerkelijk Slackware gebruikers zijn
pt_pt: fossem utilizadores Slackware
ru: являлись пользователями Slackware
tr: Slackware kullanıcısı olun

source: be able to read and understand simple shell scripts
es: sean capaces de leer y entender scripts de shell simples
fr: soient capables de lire et comprendre des scripts shell simples
nl: in staat zijn om simpele shell scripts te lezen en te begrijpen
pt_pt: fossem capazes de ler e entender shell scripts simples
ru: способны читать и понимть простые сценарии оболочки
tr: basit kabuk betiklerini okuyabilir ve anlayabilir olun

source: But even if you don't meet all of these expectations, don't hesitate to volunteer: there still are many tasks that can benefit of your skills.
es: Pero aunque no cumpla estas expectativas, no dude en ofrecerse como voluntario: hay muchas tareas en las que su talento puede ser útil.
fr: Mais même si vous ne satisfaites pas toutes ces attentes, n'hésitez pas à vous porter volontaires : beaucoup de tâches peuvent bénéficier de vos aptitudes.
nl: Maar zelfs als je niet voldoet aan al deze verwachtingen, aarzel niet en meld je toch aan: er zijn nog altijd veel taken waarbij jouw vaardigheden van pas komen.
pt_pt: Mas mesmo se você não atender a todas essas expectativas, não hesite em voluntariar-se: ainda há muitas tarefas que podem ser beneficiadas das suas habilidades.
ru: Но даже если вы не удовлетворяете всем этим ожиданиям, не бойтесь присоединиться: еще много других задач, в которых ваши навыки пригодятся.
tr: Fakat tüm bu beklentileri karşılamıyorsanız da, gönüllü olmaya çekinmeyin: hala yeteneklerinizin faydalı olabileceği görevler olabilir.

source: Volunteer and define your contributions
es: Hágase voluntario y defina sus contribuciones
fr: Portez vous volontaire et définissez vos contributions
nl: Zet je in als vrijwilliger en bepaal je bijdrage
pt_pt: Voluntaria-te e defina as suas contribuições
ru: Добровольцы и ваше содействие
tr: Gönüllü olun ve katkınızı tanımlayın

source: To volunteer as a translator, preferably use the Transifex platform: first https://www.transifex.com/signup/contributor/[register on Transifex] (it's free), then go to Transifex' https://www.transifex.com/projects/p/slint/[Slint project page]:
es: Para ofrecerse como traductor voluntario, preferiblemente utilice la plataforma Transifex: primero https://www.transifex.com/signup/contributor/[regístrese en Transifex] (es gratis), luego vaya a https://www.transifex.com/projects/p/slint/[la página del proyecto Slint] en Transifex:
fr: Pour faire acte de volontariat comme traducteur, utilisez de préférence la plate-forme Transifex : tout d'abord, https://www.transifex.com/signup/contributor/[enregistrez-vous] (c'est gratuit), puis rendez-vous sur https://www.transifex.com/projects/p/slint/[la page du projet Slint] sur Transifex
nl: Om als een vertaler bij te dragen is het aan te raden om het Transifex platform te gebruiken: registreer eerst https://www.transifex.com/signup/contributor/[op Transifex] (dat is gratis), en ga daarna naar de Transifex pagina voor https://www.transifex.com/projects/p/slint/[het Slint project]:
pt_pt: Para ser voluntário como tradutor, utilize preferencialmente a plataforma Transifex: primeiro https://www.transifex.com/signup/contributor/[registe-se no Transifex] (é gratuito), de seguida vá a Transifex' https://www.transifex.com/projects/p/slint/[página do projeto Slint]:
ru: Добровольные переводчики, предпочтительно использование платформы Transifex: сначала https://www.transifex.com/signup/contributor/[зарегистрируйтесь на Transifex] (это бесплатно), затем перейдите на https://www.transifex.com/projects/p/slint/[страницу проекта Slint] на Transifex:
tr: Tercihen Tansifex kullanan çeviri gönüllüleri: İlk olarak https://www.transifex.com/signup/contributor/[register on Transifex] kayıt olunuz (ücretsizdir), sonra https://www.transifex.com/projects/p/slint/[Slint projesi ev sayfası]na gidin:

source: If your language is listed, click on it, then in that language's page click "Join the team".
es: Si su lenguaje está listado, haga click en él, luego en la página del lenguaje haga click en "Unirse al equipo".
fr: Si votre langue est dans la liste, cliquez sur son nom, puis, sur la page qui s'affiche ensuite cliquez sur "Rejoindre l'équipe"
nl: Klik op je taal als die al in de lijst voorkomt en klik op de pagina van die taal op "Join the Team".
pt_pt: Se o seu idioma estiver listado, clique nele e de seguida nessa página do idioma, clique em "integrar equipa".
ru: Если ваш язык присутствует в списке, кликните на нем, затем на странице этого языка кликните "Присоединиться к команде".
tr: Eğer diliniz listelenmişse, üzerine tıklayın, sonra o dilin sayfasında "Takıma katılın"a tıklayın.

source: Else, click "Request a language" (in the light blue stripe just above languages' list)
es: De otra forma, haga click en "Solicitar un lenguaje" (en la barra celeste justo arriba de la lista de lenguajes)
fr: Sinon, cliquez sur "Demander une langue" (dans la bande bleu ciel juste au dessus de la liste des langues).
nl: Of klik op "Request a language" (in de lichtblauwe strook net boven de lijst)
pt_pt: Caso contrário, clique em "Solicitar idioma" (na faixa azul clara mesmo acima da lista de idiomas)
ru: Или кликните «Запросить язык» (на ярко-синей полосе над списком языков)
tr: Değilse, "Dil iste"ye tıklayın (diller listesinin hemen üzerindeki açık mavi şerit)

source: But if you'd like to ask questions before, or propose your help for other tasks than translation, send an email to Slint's maintainer: didier at slint dot fr.
es: Pero si desea hacer preguntas primero, o proponer su ayuda para otras tareas diferentes de la traducción, envíe un correo electrónico al encargado de Slint: didier arroba slint punto fr.
fr: Mais si vous voulez d'abord poser des questions, ou proposer votre aide pour d'autres tâches que la traduction, envoyez un courriel au mainteneur de Slint : didier at slint point fr.
nl: Maar als je vooraf vragen hebt of wilt helpen met andere zaken dan vertalen stuur dan een email naar de maintainer van Slint: didier at slint dot fr.
pt_pt: Mas se você gostaria de perguntar antes, ou propor a sua ajuda para outras tarefas além da tradução, envie um e-mail para o coordenador do Slint: didier arroba slint ponto fr.
ru: Но если вы сначала хотели бы задать вопрос, или предложить свою помощь в других задачах, а не в переводе, отправьте электронное письмо обслуживающему Slint: didier собака slint точка fr.
tr: Fakat önce soru sormak isterseniz, ya da çeviri dışındaki yardımları önermek isterseniz, Slint bakımcısına e-posta gönderin: didier at slint dot fr.

source: Then you will consult with your team's coordinator or Slint maintainer to define the "why", "what", "how" and "when" of your contributions to Slint.
es: Entonces podrá consultar con el coordinador de su equipo o el administrador de Slint para definir el "por qué", "qué", "cómo" y el "cuándo" de sus contribuciones a Slint.
fr: Ensuite vous vous concerterez avec le coordinateur de votre équipe ou le mainteneur de Slint pour définir les "quoi", "comment", "quand" et "pourquoi" de vos contributions à Slint.
nl: Overleg met je teamcoördinator of de maintainer van Slint over het "waarom", "wat", "hoe"' en "wanneer" van je bijdrage aan Slint.
pt_pt: Depois disso você terá que se consultar com o coordenador da sua equipa ou com o coordenador do Slint para definir o "porquê", "o quê", "como" e "quando" das suas contribuições para o Slint.
ru: Затем вы проконсультируетесь с координатором вашей команды или обслуживающим Slint, чтобы определить «почему», «что», «как» и «когда» в вашем содействии Slint.
tr: Sonra takım koordinatorü ya da Slint bakımcısına ile danışıp Slint'e katkınızın "neden", "ne", "nasıl" ve "ne zaman" olacağını tanımlayacaksınız.

source: Know our methods & tools and be ready to communicate inside Slint team
es: Conozca nuestros métodos y herramientas y esté listo a comunicarse dentro del equipo Slint
fr: Connaissez nos méthodes & outils et soyez prêt à communiquer au sein de l'équipe Slint
nl: Ken onze methoden en tools en wees bereid om te communiceren binnen het Slint-team
pt_pt: Conheça os nossos métodos e ferramentas e esteja pronto para se comunicar dentro da equipa Slint
ru: Узнайте наши методы и инструменты и будьте готовы к сообщению внутри команды Slint
tr: Metodlarımızı ve araçlarımızı öğrenin ve Slint takımı içinde iletişime hazır olun

source: Please read <<recommendations,Practical recommendations for translators>> below.
es: Por favor lea <<recommendations,Recomendaciones prácticas para traductores>> abajo.
fr: Merci de lire <<recommendations,Recommandations pratiques destinées aux traducteurs>> plus loin.
nl: Lees <<recommendations,Praktische aanbevelingen voor vertalers>> hieronder.
pt_pt: Por favor leia <<recommendations,Recomendações práticas para tradutores>> abaixo.
ru: Пожалуйста, прочтите <<recommendations,Практические рекомендации переводчикам>> ниже.
tr: Lütfen aşağıdaki <<tavsiyeler,Çevirmenler için Pratik tavsiyeler>> i okuyun.

source: Then, get acquainted with the link:tools.html[Tools] we use. To better use them you'll need to have installed a Linux distribution, preferably a full Slackware system, including following packages:
es: Entonces, familiarícese con con las link:tools.html[Herramientas] que usamos. Para utilizarlas mejor necesitará tener instalada una distribución de Linux, preferiblemente un sistema Slackware completo, incluyendo los siguientes paquetes:
fr: Ensuite, familiarisez-vous avec les link:tools.html[Outils] que nous employons. Pour les utiliser plus facilement vous devrez avoir installé une distribution Linux, de préférence un système Linux complet, y compris les paquets logiciels suivants :
nl: Neem vervolgens kennis van de link:tools.html[Tools] die we gebruiken. Die werken het best op een Linux distributie, bij voorkeur een volledige Slackware-installatie inclusief de volgende pakketten:
pt_pt: Depois, familiarize-se com as link:tools.html[Ferramentas] que usamos. Para usá-las melhor precisa de ter instalado uma distribuição Linux, de preferência um sistema Slackware completo, incluindo seguintes pacotes:
ru: Затем, ознакомьтесь с используемыми нами link:tools.html[инструментами]. Чтобы использовать их наилучшим образом, вам нужнен установленный дистрибутив Linux, предпочтительно полная система Slackware, включая следующие пакеты:
tr: Sonra, kullandığımız link:tools.html[Tools] a alışınız. Onları daha iyi kullanmak için aşağıdaki paketleri içerecek şekilde bir Linux sistemine, tercihen tam Slackware sistemine sahip olmalısınız:

source: ../extra/aspell-words-lists/<packages for your language> for spelling checks
es: ../extra/aspell-words-lists/<paquetes para su lenguaje> para revisión ortográfica
fr: ../extra/aspell-words-lists/<paquet pour votre langue> pour les vérifications orthographiques
nl: ../extra/aspell-words-lists/<pakketten voor je taal> voor spellingscontrole
pt_pt: ../extra/aspell-words-lists/<pacotes para o seu idioma> para verificação de ortografia
ru: ../extra/aspell-words-lists/aspell-ru для проверки орфографии
tr: ../extra/aspell-words-lists/<diliniz için paketler> yazım denetimleri için

source: ../kdei/<package kde-l10n for your language> to localize UI of Lokalize if you use it
es: ../kdei/<paquete kde-l10n para su lenguaje> para localizar la interfaz de usuario de Lokalize si lo utiliza
fr: ../kdei/<paquet kde-l10n pour votre langue> pour traduire l'interface utilisateur de 'Lokalize' si vous l'utilisez
nl: ../kdei/<pakket kde-l10n voor je taal> om de UI van Lokalize te localiseren als je dat gebruikt
pt_pt: ../kdei/<pacote kde-l10n para o seu idioma> para localizar a interface do utilizador de Lokalize se usado
ru: ../kdei/kde-l10n-ru для локализации пользовательского интерфейса Lokalize, если вы используете эту программу
tr: ../kdei/<package kde-l10n sizin diliniz için> yerelleştirme için Lokalize'nin kullanıcı arayüzü, eğer bunu kullanırsanız

source: Last but not least, we need to work together as a team, so:
es: Por último, si bien no menos importante, necesitamos trabajar juntos como un equipo, así que:
fr: Enfin mais ce n'est pas le moins important, nous avons besoin de travailler en équipe, aussi :
nl: Als laatste maar zeker zo belangrijk: we werken samen als een team, dus:
pt_pt: Por último, mas não menos importante, temos de trabalhar juntos como uma equipa, por isso:
ru: Наконец, что немаловажно, мы должны работать вместе, как команда, поэтому:
tr: Sonuncusu birlikte bir takım olarak çalışmamız gerekir, yani:

source: Please register on Transifex, even if you don't use its on line editor, then check all https://www.transifex.com/settings/notices/[notification settings], as it makes easier to keep all contributors informed at once of anything of general interest. Please indicate you full name, even if you use a nickname.
es: Por favor regístrese en Transifex, aunque no utilice su editor en línea, y luego revise toda la https://www.transifex.com/settings/notices/[configuración de notificaciones]. De esta forma es más fácil mantener a todos los colaboradores informados de inmediato sobre cualquier cosa de interés general. Por favor indique su nombre completo, aún si usa un apodo.
fr: Merci de vous enregistrer sur Transifex, même si vous n'en utilisez pas l'éditeur en ligne, puis cochez toutes les https://www.transifex.com/settings/notices/[notifications proposées]: il est ainsi plus facile de tenir au courant tous les contributeurs sur tout sujet d'intérêt général et de évolutions. Merci d'indiquer vos nom et prénom, même si vous utilisez un sobriquet.
nl: Registreer je bij Transifex, zelfs als je de online-editor niet gebruikt, en controleer alle https://www.transifex.com/settings/notices/[notificatie instellingen], omdat die het direct informeren van alle bijdragers over algemene zaken vergemakkelijken. Vermeld je volledige naam, zelfs wanneer je een 'nickname' gebruikt.
pt_pt: Por favor, registe-se em Transifex, mesmo se não usar o seu editor em linha, verifique depois todas as https://www.transifex.com/settings/notices/[configurações de notificação], pois torna imediatamente mais fácil manter todos os colaboradores informados de qualquer coisa de interesse geral. Por favor, indique o seu nome completo, mesmo se usar uma alcunha.
ru: Пожалуйста, зарегистрируйтесь на Transifex, даже если вы не используете их онлайн-редактор, затем проверьте все https://www.transifex.com/settings/notices/[настройки уведомлений], это упростит информирование всех участников сразу обо всем интересном всем. Пожалуйста указывайте свое настоящее имя, даже если вы используете псевдоним.
tr: Lütfen çevrimiçi düzenleyici olarak kullanmasanız da Transifex'e üye olunuz, sonra, tüm katkı verenlerin tek seferde bilgilendirilmesini sağlamak için daha kolay bir yol olduğu için tüm https://www.transifex.com/settings/notices/[notification settings] i kontrol ediniz. Lütfen takma isim kullansanız bile tam isminizi belirtiniz.

source: We strongly suggest that you subscribe to https://lists.sourceforge.net/lists/listinfo/slint-translators[slint-translators mailing-list]. This will allow you to ask and answer questions, participate in discussions, make suggestions and proposals.
es: Le sugerimos enfáticamente que se suscriba a la https://lists.sourceforge.net/lists/listinfo/slint-translators[lista de correo slint-translators]. Esto le permitirá hacer y contestar preguntas, participar en discusiones, hacer sugerencias y propuestas.
fr: Nous vous recommandons vivement de vous abonner à la liste de diffusion https://lists.sourceforge.net/lists/listinfo/slint-translators[slint-translators]. Cela vous permettra de poser des questions et de répondre à d'autres, de participer à des discussions, d'émettre suggestions et propositions.
nl: We adviseren met klem je te abonneren op https://lists.sourceforge.net/lists/listinfo/slint-translators[slint-translators mailing-lijst]. Hier kun je vragen stellen en beantwoorden, deelnemen aan discussies en suggesties aandragen.
pt_pt: Nós sugerimos vivamente que você se inscreva em https://lists.sourceforge.net/lists/listinfo/slint-translators[slint-tradutores mailing-list]. Isto irá permitir-lhe fazer e responder perguntas, participar de discussões, fazer sugestões e propostas.
ru: Мы настоятельно рекомендуем вам подписаться на https://lists.sourceforge.net/lists/listinfo/slint-translators[список рассылки slint-translators]. Это позволит вам задавать вопросы и отвечать на них, участвовать в дискуссиях, вносить предложения.
tr: https://lists.sourceforge.net/lists/listinfo/slint-translators[slint-translators mailing-list] listesine üye olmanızı şiddetle öneririz. Bu soru sormanızı ve cevaplamanızı, tartışmalarda yer almanızı, öneri ve teklifte bulunmanızı sağlayacaktır.

source: Be ready to provide an email address allowing your team's coordinator and Slint's maintainer to reach you.
es: Esté preparado para proveer una dirección de correo electrónico, para que el coordinador de su equipo y el encargado de Slint puedan comunicarse.
fr: Tenez-vous prêt à communiquer une adresse courriel permettant au coordinateur de votre équipe et au mainteneur de Slint de vous joindre.
nl: Zorg voor een e-mailadres waarop je teamcoördinator en Slint's maintainer je kunnen bereiken.
pt_pt: Esteja preparado para fornecer um endereço de e-mail a permitir que o coordenador da sua equipa e o coordenador do Slint cheguem a si.
ru: Будьте готовы предоставить свой адрес электронной почты, чтобы координатор вашей команды и сопровождающий Slint могли связаться с вами.
tr: Takım koordinatörünün ya da Slint bakımcısının size ulşabileceği bir e-posta adresi sağlamaya hazır olun.

source: You can also use the Discussion feature available on Transifex in your language's page of the Slint project.
es: Puede también utilizar la función de Discusiones en Transifex en la página de su lenguaje del proyecto Slint.
fr: Vous pouvez aussi utiliser la fonction Discussion disponible sur Transifex dans la page de votre langue du projet Slint.
nl: Je kunt tevens de Discussie-functie op de Slint webpagina van jouw taal op Transifex gebruiken.
pt_pt: Você também pode usar o recurso de discussão disponível em Transifex na página do seu idioma do projeto Slint.
ru: Вы можете воспользоваться функцией Дискуссия, доступной на Transifex на странице вашего языка в проекте Slint.
tr: Ayrıca Transifex üzerinde Slint projesinin kendi dilinizdeki sayfasındaki Tartışma özelliğini de kullanabilirsiniz.
