Repository: DidierSpaier/slint-website
Catalog: old/po/contribute/contribute.*.po
Languages: es, fr, nl, pt_pt, ru, tr

source: All new pages are generated using application http://asciidoc.org['AsciiDoc'], included in Slackware (shipped in package linuxdoc-tools). The source files are text files, including formatting instructions for AsciiDoc, e.g. a line begining with two equal signs will be considered as a header of level two, that will be written as a <h2> tag in XHTML file generated by asciidoc.
es: Todas las páginas nuevas se generan utilizando la aplicación http://asciidoc.org['AsciiDoc'], incluída en Slackware (se encuentra en el paquete linuxdoc-tools). Los archivos fuente son archivos de texto, incluyendo las instrucciones de formato para asciidoc, por ejemplo, dos símbolos de igual al principio de una línea son considerados como un encabezado de segundo nivel, el cual será convertido a una etiqueta <h2> en el archivo XHTML generado por asciidoc.
fr: Toutes les nouvelles pages du site Internet sont générées par l'application http://asciidoc.org['AsciiDoc'], inclue dans Slackware (contenue dans le paquet 'linuxdoc-tools'). Le fichiers sources sont des fichiers textes, comportant des instructions pour AsciiDoc, par exemple une ligne commençant par deux signes "égale" sera considérée comme une en-tête de niveau deux, écrite comme une balise <h2> dans un fichier XHTML généré par AsciiDoc.
nl: Alle nieuwe pagina's worden gegenereerd met de applicatie http://asciidoc['AsciiDoc'] die meekomt met Slackware (in het pakket linuxdoc-tools). De bronbestanden zijn tekstbestanden die ook de Asciidoc-opmaakinstructies bevatten. Bijvoorbeeld dat een regel die begint met twee isgelijkaan-tekens wordt beschouwd als een koptekst van niveau twee, geschreven als een <h2> tag in het XHTML-bestand gegenereerd door asciidoc.
pt_pt: Todas as novas páginas são criadas usando a aplicação http://asciidoc.org['AsciiDoc'], incluída no Slackware (fornecida no pacote linuxdoc-tools). Os ficheiros fonte são ficheiros de texto, incluindo instruções de formatação para AsciiDoc, por exemplo, uma linha começando com dois sinais de igual será considerada como um cabeçalho de nível dois, que será escrito como uma etiqueta <h2> num ficheiro XHTML criado pelo asciidoc.
ru: Все новые страницы сгенерированы приложением http://asciidoc.org['AsciiDoc'], входящим в Slackware (поставляется в пакете linuxdoc-tools). Исходные файлы являются обычными текстовыми файлами, включают инструкции форматирования для AsciiDoc, например, строка, начинающаяся с двух одиноковых символов будет считаться заголовком второго уровня, это будет записано как тег <h2> в результирующем файле XHTML, сгенерированного asciidoc.
tr: Tüm yeni sayfalar Slackware içindeki (linuxdoc-tools paketi içinde gelen) http://asciidoc.org['AsciiDoc'] uygulaması kullanılarak üretildi. Kaynak dosyalar metin dosyalarıdır, AsciiDoc için, örn. iki eşit işaret ile başlayan satırlar ikinci seviye başlık olarak ele alnırlar, bunlar asciidoc tarafından üretilen XHTML dosyası içine <h2>etiketi olarak yazılır, gibi biçimlendirme yönergeleri dahil edilmiştir.

source: Specific instructions and tips to translate text files to be processed by 'AsciiDoc' are provided in link:tools.html#asciidoc[Translation of text files to be processed by 'AsciiDoc' to generate web pages].
es: Instrucciones específicas y consejos para traducir archivos de texto procesados por 'AsciiDoc' se proveen en la página link:tools.html#asciidoc[Traducción de archivos de texto para ser procesados con 'AsciiDoc' para generar páginas web].
fr: Des instructions spécifiques pour la traduction des fichiers textes à traiter par 'AsciiDoc' sont fournies dans link:tools.html#asciidoc[Translation of text files to be processed by 'AsciiDoc' to generate web pages].
nl: Specifieke instructies en tips voor het vertalen van tekstbestanden die door 'AsciiDoc' verwerkt worden staan op link:tools.html#asciidoc[Vertalen van door 'AsciiDoc' tot webpagina's te verwerken tekstbestanden].
pt_pt: As instruções específicas e dicas para traduzir ficheiros de texto a serem processados por 'AsciiDoc' são fornecidas na link:tools.html#asciidoc[Tradução de ficheiros de texto a serem processados por 'AsciiDoc' para criar páginas da internet].
ru: Специальные инструкции и советы по переводу текстовых для последующей обработки 'AsciiDoc' представлены в link:tools.html#asciidoc[Перевод текстовых файлов для последующе й обработки 'AsciiDoc' для генерации web-страниц].
tr: Özel yönergeler ve 'AsciiDoc' yarafından işlenecek çevirilecek metin dosyaları link:tools.html#asciidoc[Translation of text files to be processed by 'AsciiDoc' to generate web pages] içinde bulunmaktadır.

source: For each language, when translation of template.po, link:slint.html[slint.html], link:installer.html[installer.html] and link:package.html[package.html] will be completed, the old home page will be replaced by the new one so that end users benefit of new pages in that language.
es: Para cada lenguaje, cuando la traducción de template.po, link:slint.html[slint.html], link:installer.html[installer.html] y link:package.html[package.html] esté completa, la página de inicio antigua será reemplazada con la nueva, de forma que los usuarios se beneficien con las nuevas páginas en cada lenguaje.
fr: Pour chaque langue, une fois complétées les traductions de template.po, link:slint.html[slint.html], link:installer.html[installer.html] et link:package.html[package.html], l'ancienne page d'accueil est remplacée par la nouvelle afin que les utilisateurs finaux bénéficient des nouvelles pages dans leur langue.
nl: Voor elke taal waarvan de vertaling van template.po, link:slint.html[slint.html], link:installer.html[installer.html] en link:package.html[package.html] klaar is zal de oude webpagina door de nieuwe vervangen worden zodat de eindgebruikers gebruik kunnen maken van de nieuwe pagina's in die taal..
pt_pt: Para cada idioma, quando a tradução de template.po, link:slint.html[slint.html], link:Installer.html[Instalador.html] e link:package.html[pacote.html] é completada, a velha página de início será substituída por uma nova, de modo a que os utilizadores finais beneficiem das novas páginas nesse idioma.
ru: Для каждого языка, когда перевод template.po, link:slint.html[slint.html], link:installer.html[installer.html] и link:package.html[package.html] будет завершен, старая домашняя страница будет заменена новой, так как это принесет пользу конечным пользователям новых страниц на этом языке.
tr: Her bir dil için, template.po, link:slint.html[slint.html], link:installer.html[installer.html] ve link:package.html[package.html] çevirisi bittiğinde, eski sayfa , son kullanıcı o dilde yeni sayfalardan faydalansın diye, yenisi ile değiştirilecektir.

source: Practical recommendations for translators
es: Recomendaciones prácticas para traductores
fr: Recommandations pratiques destinées aux traducteurs
nl: Praktische aanbevelingen voor vertalers
pt_pt: Recomendações práticas para tradutores
ru: Практические рекомендации переводчикам.
tr: Çevirmenler için pratik tavsiyeler

source: Depending on amount of work needed and available resources, there can be one translator or a team of translators per target language. In all cases, I recommend that at least one person be responsible for organizing the team's work, checking the translations and transmitting the checked PO file to the maintainer(s). Let's call this person the team coordinator.
es: Dependiendo de la cantidad de trabajo necesario y de los recursos disponibles, puede haber un traductor o un grupo de traductores por cada lenguaje destino. En todos los casos, recomiendo que por lo menos una persona sea responsable de organizar el trabajo de equipo, revisando las traducciones y transmitiendo el archivo PO revisado al administrador. Llamemos a esta persona el coordinador del equipo.
fr: Selon la quantité de travail nécessaire et les ressources disponibles il peut y avoir un seul traducteur ou une équipe de traducteurs par langue cible. Dans tous les cas, il est recommandé qu'une personne soit responsable de l'organisation du travail de l'équipe, de vérifier les traductions et de transmettre le fichier PO vérifié au mainteneur. Appelons cette personne le coordinateur de l'équipe.
nl: Afhankelijk van de hoeveelheid werk en de beschikbare capaciteit kan er één vertaler of een team van vertalers per taal zijn. In elk geval adviseer ik dat er één persoon verantwoordelijk is voor de organisatie van het werk, de controle van de vertalingen en het overbrengen van het gecontroleerde PO-bestand naar de onderhouder(s). Laten we dit de teamcoördinator noemen.
pt_pt: Dependendo da quantidade de trabalho necessária e dos recursos disponíveis, pode haver um tradutor ou uma equipa de tradutores por idioma-alvo. Em todos os casos, eu recomendo que pelo menos uma pessoa seja responsável pela organização do trabalho da equipa, verificando as traduções e transmitindo o ficheiro PO revisto para o administrador(es). Vamos chamar a essa pessoa o coordenador da equipa.
ru: В зависимости от объема работы и доступных ресурсов, может быть один переводчик или одна команда переводчиков на каждый целевой язык. Во всех случаях, я рекомендую чтобы хотя бы один человек отвечал за организацию работы команды, проверял переводы и передавал проверенный PO-файл сопровождающему(-им). Назовем этого человека координатором команды.
tr: İhtiyaç duyulan iş miktarına ve eldeki kaynağa bağlı olarak, hedeflenen dil başına bir çevirici ya da bir takım olabilir. Her durumda, takım işleri organizasyonundan sorumlu, çevirilerin denetlenmesi ve PO dosyasının bakımcılara gönderilmesinden sorumlu en azından bir kişi tavsiye edilir. Buna takım koordinatörü diyelim.

source: Don't feel obliged to translate verbatim. Not only is this rarely the best way to convey the meaning, but in addition this often leads to sentences too long to fit in allowed space.
es: No se sienta obligado de hacer una traducción literal. Rara vez esta es la mejor manera de expresar el significado, y adicionalmente genera oraciones muy largas que no caben en el espacio permitido.
fr: Ne vous sentez pas obligé de traduire mot à mot. Non seulement c'est rarement la meilleure façon de transmettre le sens, mais en plus cela conduit souvent à des phrases trop longues pour l'espace imparti.
nl: Voel je niet verplicht alles letterlijk te vertalen. Dit is niet alleen zelden de manier om de boodschap over te brengen maar leidt vaak ook tot te lange zinnen voor de beschikbare ruimte.
pt_pt: Não se sinta obrigado a traduzir palavra a palavra. Não só isto é raramente a melhor maneira de transmitir o significado, mas além disso isto leva muitas vezes a frases muito longas para caber no espaço permitido.
ru: Не чувствуйте себя обязанными перевести дословно. Не всегда это лучший способ передать смысл, но часто это приводит к предложениям, которые не умещаются на доступном пространстве.
tr: Kendinizi kelimesi kelimesine çevirmeye mecbur hissetmeyin. Bunun sadece anlamı ifade etmenin en iyi yolu olmadığından değil, fakat buna ek olarak cümlenin sıklıkla izin verilen boşluktan daha uzun olmasına yol açtığı için.

source: Use a specialized PO editor, 'not' a general text editor. This will not only prevent inadvertently editing 'msgid' strings but also facilitate their work and automatize additional checks, as the presence of a variable in the translation with the same spelling as in the original.
es: Utilice un editor PO especializado, 'no' un editor de texto general. Esto le ayuda a prevenir editar involuntariamente textos 'msgid', también facilita el trabajo y automatiza revisiones adicionales, tales como la presencia de una variable en la traducción con la misma ortografía que en el original.
fr: Utilisez un éditeur spécialisé de fichiers PO, 'pas' un éditeur de textes généraliste. Cela prévient la modification par inadvertance des chaînes de caractères 'msgid', facilite aussi le travail et automatise des vérifications complémentaires, comme la présence d'une variable dans la traduction reproduite de manière identique à l'original.
nl: Gebruik een speciale PO-editor en geen generieke tekstbewerker. Dit voorkomt niet alleen het onbedoeld vertalen van 'msgid' strings maar vergemakkelijkt het werk en automatiseert aanvullende controles als de aanwezigheid van variabelen in de vertaling met dezelfde spelling als het origineel.
pt_pt: Use um editor de PO especializado, 'não' um editor de texto comum. Isso não só vai impedir a edição inadvertida de strings 'msgid', mas também facilitar o seu trabalho e automatizar verificações adicionais, como a presença de uma variável na tradução com a mesma grafia, como no original.
ru: Пользуйтесь специализированным PO-редактором, а 'не' обычным текстовым редактором. Это не только предупреждает нечаянное редактирование строк 'msgid', но и облегчает работу и автоматизирует дополнительные проверки, такие как наличие переменной в переводе с таким же написанием как в оригинале.
tr: Özel bir PO düzenleyici kullanın, bir metin düzenleyici 'değil'. Bu sadece 'msgid' dizilerinin yanlışla değiştirlmesini engellemeyecek, ayrıca değişkenin çeviri içinde orjinali ile aynı yazımda bulunması gibi ek denetimleri de mümkün kılar.

source: While translating, choose a serif fixed width (or "monospaced") font, like Courier. That allow to visually distinguish characters that otherwise would look the same, and check line's length when that matters.
es: Al traducir, seleccione una fuente serif con ancho fijo (o "monoespacio"), como Courier. Esto le permite distinguir visualmente caracteres que de otra forma se verían igual, además de permitirle revisar el largo de las líneas cuando es importante.
fr: Pour traduire, préférez une police de caractère serif à chasse fixe (ou "monospace"), comme Courier. Cela permet de distinguer visuellement des caractères qui autrement apparaîtraient identiques et de vérifier la longueur de la ligne quand cela importe.
nl: Kies voor het vertalen een serif font met vaste breedte (monospaced) zoals Courier. Hierdoor kun je onderscheid maken tussen karakters die er anders hetzelfde uit zouden zien en waar nodig de regellengte controleren.
pt_pt: Durante a tradução, escolha uma fonte serif de largura fixa (ou "monoespaçada") como a Courier. Isso permite distinguir visualmente caracteres que de outra forma ficariam iguais, e verificar o comprimento da linha, quando isso importa.
ru: При переводе выбирайте шрифт фиксированной ширины (или «моноширинный»), например, Courier. Это позволит визуально отличать символы, которые в противном случае будут выглядеть одинаково и проверять длину строки, когда это имеет значение.
tr: Çevirirken, Courier gibi, serif sabit genişlikli ("monospaced" değil) bir fontu seçin. Bu görsel olarak, aksi halde aynı gözükecek karakterleri ayırt etmenizi ve önemli olduğunda satır uzunluğunu denetleminizi sağlar,

source: If possible, check the layout of the messages. You could do that looking at the context in the relevant source file. Even better, simply run the translated script. This is especially important if you are translating dialog boxes. In particular, take care not to write too long sentences on one single line if it appears that the text can't flow on next one.
es: Si es posible, revise la disposición de los mensajes. Puede hacer esto observando el contexto en el archivo origen correspondiente. Aún mejor, simplemente ejecute el script traducido. Esto es especialmente importante si está traduciendo cajas de diálogo. En particular, tenga cuidado de no escribir oraciones muy largas en una sola línea si es aparente que el texto no continuará en la siguiente línea.
fr: Si possible, vérifiez la disposition visuelle du message. Vous pouvez le faire en examinant le contexte dans le fichier source. Encore mieux, exécutez le script traduit. C'est particulièrement important si vous traduisez des boites de dialogue. En particulier, prenez soin de ne pas écrire de trop longues phrases sur une seule ligne quand il apparaît que le texte ne peut pas déborder sur la suivante.
nl: Controleer als het mogelijk is de layout van de teksten. Je kunt dat doen door het bekijken van de context in het relevante bronbestand. Of nog beter, door het uitvoeren van het vertaalde script. Dit is vooral van belang bij vertaling van dialoogvensters. Let er vooral op niet te lange zinnen op een enkele regel te maken als het er op lijkt dat de tekst niet naar de volgende regel kan doorlopen.
pt_pt: Se possível, verifique a disposição das mensagens. Você poderia fazer isso olhando para o contexto no ficheiro fonte relevante. Ainda melhor, simplesmente execute o script traduzido. Isto é especialmente importante se você está a traduzir caixas de diálogo. Em particular, tenha cuidado para não escrever frases muito longas numa única linha se isso se verificar o texto não pode fluir no próximo.
ru: Если возможно, проверяйте расположение сообщений. Вы можете сделать это, глядя на контекст в соответствующем исходном файле. Даже лучше просто запустить переведенный сценарий. Особенно важно, если вы переводите диалоговые окна. В частности, не пишите очень длинные предложения в одной строке, если кажется, что текст может не поместиться на следующей.
tr: Eğer mümkünse, mesajın yerleşimini denetleyin. Bunu ilgili kaynak dosyadaki bağlama bakarak yapabilirsiniz. Daha da iyisi, çevirilen betiği çalıştırın. Bu özellikle dialog kutularını çevirirken önemlidir. Özellikle, eğer metin bir sonraki üzerine gelmiyorsa tek bir satırda çok uzun bir cümle yazmamaya özen gösterin.

source: Bear in mind that in VGA mode (used in text installers, in particular), line's width is limited theoretically to 80 characters, but practically often to 74.
es: Tenga presente que en el modo VGA (utilizado por instaladores en particular), el largo de las líneas es en teoría 80 caracteres, pero en la práctica frecuentemente es 74.
fr: Gardez présent à l'esprit qu'en mode VGA (utilisé dans les installateurs en mode texte, en particulier), la longueur d'une ligne est théoriquement limitée à 80 caractères, mais pratiquement souvent à 74.
nl: Onthoud dat in VGA-mode (vaak gebruikt in tekst-installers) de regellengte theoretisch beperkt is tot 80 karakters maar in de praktijk meestal tot 74.
pt_pt: Tenha em mente que no modo VGA (usado nos instaladores de texto, em particular), a largura da linha é teoricamente limitado a 80 caracteres, mas na prática frequentemente isto é 74.
ru: Имейте в виду, что в режиме VGA (в частности, используемом в текстовых установщиках) длина строки теоретически ограничена до 80 символов, но на практике - до 74.
tr: Aklınızdan çıkarmayın, VGA modunda (özellikle metin kurucularda kullanılır), satır genişliği teorik olarak 80 karakter ile, fakat pratikte sıklıkla 74 karakter ile sınırlandırılmıştır.

source: Do not add question marks that are not present in the original message.
es: No agregue signos de pregunta que no están presentes en el mensaje original.
fr: N'ajoutez pas en fin de phrase de points d'interrogation absents du message d'origine.
nl: Voeg geen vraagtekens toe die niet in de originele tekst staan.
pt_pt: Não adicione pontos de interrogação que não estão presentes na mensagem original.
ru: Не добавляейте знаки вопроса, которые не присутствуют в оригинальном сообщении.
tr: Orjinal mesajda olmayan soru işaretlerini eklemeyin

source: If the message refers to tags (text on the buttons) of dialog boxes, like "OK", "Yes", "NO", "Continue", "Cancel", check how theses tags are translated in your language in dialog's interface and use the same words.
es: Si el mensaje se refiere a etiquetas (texto en los botones) en cajas de diálogo, tales como "OK", "Yes", "NO", "Continue" y "Cancel", revise como estas etiquetas están traducidas en la interfaz de los diálogos en su lenguaje, y use las mismas palabras.
fr: Si le message se rapporte à une étiquette (texte sur les boutons) de boites de dialogue, telle que "OK", "Yes", "NO", "Continue", "Cancel", vérifiez comment ces étiquettes sont traduites dans votre langue dans l'interface de dialogue et utilisez les mêmes mots.
nl: Als de tekst refereert aan labels (tekst op de knoppen) of dialoogvensters, zoals "OK", "Yes", "NO", "Continue", "Cancel", controleer dan hoe deze labels zijn vertaald in de interface dialogen in jouw taal en gebruik dezelfde woorden.
pt_pt: Se a mensagem se refere a etiquetas (texto nos botões) de caixas de diálogo, como "OK", "Sim", "NÃO", "Continuar", "Cancelar", verifique como essas etiquetas são traduzidas no seu idioma na interface do diálogo e use as mesmas palavras.
ru: Если сообщение ссылается на теги (текст на кнопках) диалоговых окон, например "OK", "Да", "Нет", "Продолжить", "Отмена", проверьте как эти теги переводятся на ваш язык в диалоговых окнах интерфейса и используйте те же самые слова.
tr: Eğer mesaj etiketleri (düğme üzerindeki yazılar) referans veriyorsa, "OK", "Yes", "NO", "Continue", "Cancel" gibi, bu etiketlerin diyaloglarda dilinize nasıl çevirildiğini kontrol edin ve aynı kelimeleri kullanın.

source: Avoid colloquialisms and technical slang.
es: Evite coloquialismos y argot técnico.
fr: Évitez le langage parlé et l'argot technique.
nl: Voorkom plat taalgebruik en technisch jargon.
pt_pt: Evite coloquialismos e gírias técnicas.
ru: Избегайте разговорных выражений и технического жаргона.
tr: Konuşma dili üslubundan ve teknik dilden kaçının

source: To "cut" (or end) a line inside a "dialog" box you should type \n: pressing [Enter] will 'not' insert a "new line" character in the text viewed by user.
es: Para "cortar" (o terminar) una línea dentro de una caja de "diálogo", debe escribir \n: presionar [Enter] 'no' insertará un caracter de "nueva línea" en el texto que ve el usuario.
fr: Pour"couper" (ou terminer) une ligne dans une boite de dialogue, tapez les deux caractères '\n' : presser [Entrée] n'insérera 'pas' un caractère "saut de ligne" dans le texte vu par l'utilisateur.
nl: Om een regel in een dialoogvenster af te breken typ je \n: Het indrukken van de [Enter] toets zal geen "new line" karakter invoegen in de door de gebruiker bekeken tekst.
pt_pt: Para "cortar" (ou terminar) uma linha dentro de uma caixa "diálogo" deve escrever \n: pressionar [Enter] 'não' vai inserir um caractere de "nova linha" no texto que o utilizador vê.
ru: Для «обрыва» (или завершения) строки внутри окна "dialog" необходимо набирать \n: нажатием [Ввод], а 'не' вставлять символ «новая строка» в текст, видимый пользователю.
tr: Bir "dialog" içinde bir satırı "kesmek" (ya da sonlandırmak) için \n karakteri eklemelisiniz: [Enter] a basmak kullanıcı tarafından görülen "satır başı" karakterini 'eklemez'.

source: In addition, you will have to comply to gettext's requirements for it to work:
es: Adicionalmente, es necesario cumplir con los requerimientos de gettext para que funcione:
fr: En outre, vous devrez satisfaire aux exigences de 'gettext' pour qu'il fonctionne :
nl: Ook zal je moeten voldoen aan de vereisten van gettext voor het gebruik ervan:
pt_pt: Além disso, você terá que cumprir com as necessidades do gettext para que ele funcione:
ru: В дополнение, вы должны соблюдать требования gettext:
tr: Ek olarak, bunun çalışması için gettext'in gerekliliklerine uyun
