Repository: DidierSpaier/slint-website
Catalog: old/po/contribute/contribute.*.po
Languages: es, fr, nl, pt_pt, ru, tr

source: You can also follow http://www.linuxquestions.org/questions/slackware-14/internationalized-slackware-14-installer-what-languages-to-start-4175455701/[this thread] in Slackware forum of LinuxQuestions.org. For that, register to LQ and either post a message in the thread, or display it then click Thread Tools => Subscribe to this Thread (in the dark blue stripe just above the first message displayed).
es: Puede también seguir http://www.linuxquestions.org/questions/slackware-14/internationalized-slackware-14-installer-what-languages-to-start-4175455701/[este hilo] en el foro de Slackware de LinuxQuestions.org. Para hacer esto, regístrese en LQ y ponga un mensaje en el hilo, o despliéguelo y haga click en "Thread Tools => Subscribe to this Thread" (en la barra azul justo arriba del primer mensaje).
fr: Vous pouvez aussi suivre http://www.linuxquestions.org/questions/slackware-14/internationalized-slackware-14-installer-what-languages-to-start-4175455701/[ce fil de discussion] dans le forum Slackware de LinuxQuestions.org. Pour cela, inscrivez-vous à LQ puis postez un message dans ce fil ou cliquez sur "Thread Tools" => "Subscribe to this Thread" (dans la bande bleu foncé juste au-dessus du premier message affiché).
nl: Je kunt ook http://www.linuxquestions.org/questions/slackware-14/internationalized-slackware-14-installer-what-languages-to-start-4175455701/[deze topic] volgen in het Slackware forum van LinuxQuestions.org. Registreer hiervoor op LQ en plaats ofwel een bericht in deze thread, of bekijk hem en klik Thread Tools => Subscribe to this Thread (in de donkerblauwe strook vlak boven het eerste weergegeven bericht).
pt_pt: Pode ainda acompanhar http://www.linuxquestions.org/questions/slackware-14/internationalized-slackware-14-installer-what-languages-to-start-4175455701/[esta discussão] no fórum Slackware do LinuxQuestions.org. Para isso, registe-se no LQ e ponha uma mensagem no tópico ou exiba-a , depois clique em Ferramentas do Tópico => Subscrever a este Tópico (na faixa azul escuro logo acima da primeira mensagem exibida).
ru: Вы можете отслеживать http://www.linuxquestions.org/questions/slackware-14/internationalized-slackware-14-installer-what-languages-to-start-4175455701/[эту тему] в форуме Slackware на LinuxQuestions.org. для этого зарегистрируйтесь на LQ и напишите сообщение в тему или отобразите ее и кликните Инструменты => Подписаться на эту тему (на темно-синей полосе над первым сообщением).
tr: Ayrıca LinuxQuestions.org'un Slackware forumunda http://www.linuxquestions.org/questions/slackware-14/internationalized-slackware-14-installer-what-languages-to-start-4175455701/[this thread] i takip edebilirsiniz. Bunun için, LQ'ya kayıt olun ve bir tartışmaya mesaj gönderin ya da Thread Tools => Subscribe to this Thread (gösterilen ilk mesajın hemen üzerindeki koyu mavi şerit) e tıklayarak mesajı görüntüleyin.

source: Translation scope
es: Alcance de la traducción
fr: Périmètre de la traduction
nl: Omvang van de vertaling
pt_pt: Âmbito da tradução
ru: Перевод
tr: Çeviri kapsamı

source: Target languages
es: Lenguajes destino
fr: Langues cibles
nl: Doel-talen
pt_pt: Idiomas alvo
ru: Целевые языки
tr: Hedef diller

source: At time of writing slint installer and main Slackware administration tools are fully translated in French, German, Polish, Portuguese, Russian, Spanish and Ukrainian. Other translations are in progress, their current status can be checked on https://www.transifex.com/projects/p/slint/resource/slint/[this page].
es: Al momento de escribir esto, el instalador slint y las principales herramientas de administración de Slackware están completamente traducidas en Francés, Alemán, Polaco, Portugués, Ruso, Español y Ucraniano. Otras traducciones están en progreso, su estado actual puede ser revisado en https://www.transifex.com/projects/p/slint/resource/slint/[esta página].
fr: Au moment de la rédaction l'installateur Slackware et les principaux outils d'administration Slackware sont complètement traduits en Allemand, Espagnol, Français, Polonais, Portugais, Russe et Ukrainien. D'autres traductions sont en cours, leur état d'avancement actuel est affiché sur https://www.transifex.com/projects/p/slint/resource/slint/[cette page].
nl: Momenteel zijn de slint-installer en de belangrijkste Slackware beheertools volledig vertaald in het Duits, Frans, Nederlands, Pools, Portugees, Russisch, Spaans en Oekraïens. De status van de andere vertalingen is te controleren op https://www.transifex.com/projects/p/slint/resource/slint/[deze pagina].
pt_pt: No momento da escrita o instalador Slint e as principais ferramentas de administração do Slackware estão totalmente traduzidas em Francês, Alemão, Polaco, Português, Russo, Espanhol e Ucraniano. Outras traduções estão em desenvolvimento, o seu estado atual pode ser verificado https://www.transifex.com/projects/p/slint/resource/slint/[nesta página].
ru: На момент написания установщик Slint и главные инструменты администратора Slackware полностью переведены на французский, немецкий, польский, португальский, русский, испанский и украиский языки. Остальные переводы пока не готовы, их текущее состояние можно проверить на https://www.transifex.com/projects/p/slint/resource/slint/[этой странице].
tr: Slint kurucunun yazıldığı sıralarda ana Slackware yönetim araçları Fransızca, Almanca, Portekizce, Rusça, İspanyolca ve Ukraynaca dillerine tam olarak çecrilmişti. Diğer çeviriler devam ediyor, şu anki durumları https://www.transifex.com/projects/p/slint/resource/slint/[this page] üzerinden kontrol edilebilir.

source: Manual pages are translated in more languages, complete translations are listed in file https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT]
es: Las páginas de manual están traducidas en más lenguajes, las traducciones completas están listadas en el archivo https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT]
fr: Des pages de manuel sont traduites dans davantage de langues, la liste des traductions complètes se trouve dans le fichier https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT].
nl: Manual pagina's zijn in meer talen vertaald. Een lijst met volledige vertalingen vind je op https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT]
pt_pt: As páginas do Manual são traduzidas em mais idiomas, traduções completas estão em lista no ficheiro https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT]
ru: Страницы руководств переведены на многие языки, перечень завершенных переводов приведен в файле https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT]
tr: Kılavuz sayfalar daha fazla dile çevirilmiştir, tüm çeviriler https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT] dosyası içinde listelenmiştir

source: Translated content
es: Contenido traducido
fr: Contenu traduit
nl: Vertaalde inhoud
pt_pt: Conteúdo traduzido
ru: Переводы
tr: Çevirilen içerik

source: Translated content takes the form of files including original English messages alongside their translations, called PO files, produced and processed through GNU 'gettext'. Each given set of messages (in English in Slint's case) to be translated is recorded in a so called POT file, from which is generated one corresponding PO file for each target language, see http://docs.slackware.com/howtos:misc:internationalization_and_localization_of_shell_scripts[Internationalization and localization of shell scripts] on http://docs.slackware.com/start[SlackDocs] to know more.
es: El contenido traducido se conforma de archivos que incluyen los mensajes originales en Inglés junto a su traducción, llamados archivos PO. Estos archivos son producidos y procesados por la aplicación GNU 'gettext'. Cada grupo de mensajes (en Inglés en el caso de Slint) para la traducción se almacenan en un archivo POT, a partir del cual se genera un archivo PO correspondiente para cada lenguaje destino. Vea la página http://docs.slackware.com/howtos:misc:internationalization_and_localization_of_shell_scripts[Internationalización y localización de scripts de shell] en http://docs.slackware.com/start[SlackDocs] para saber más sobre esto.
fr: Le contenu traduit prend la forme de fichiers comportant des messages originaux en Anglais côte à côte avec leurs traductions, appelés des fichiers PO, produits et par le logiciel GNU 'gettext'. Chaque ensemble de messages (en Anglais dans le cas de Slint) à traduire est enregistré dans "fichier POT", à partit duquel est initialisé un "ficher PO" pour chaque langue cible, voir http://docs.slackware.com/howtos:misc:internationalization_and_localization_of_shell_scripts[Internationalization and localization of shell scripts] (en Anglais) sur le site http://docs.slackware.com/start[SlackDocs] pour en savoir plus.
nl: Vertaalde inhoud heeft de vorm van bestanden, PO bestanden genoemd, die de originele engelse berichten bevat samen met hun vertalingen, verkregen door GNU 'gettext';. Elke te vertalen verzameling berichten (in het engels, in het geval van Slint) staan in een zgn. POT-bestand waarvan voor elke doel-taal een PO-bestand wordt gegenereerd. Zie http://docs.slackware.com/howtos:misc:internationalization_and_localization_of_shell_scripts[Internationalization and localization of shell scripts] op http://docs.slackware.com/start[SlackDocs] voor meer info.
pt_pt: O conteúdo traduzido assume a forma de ficheiros, incluindo mensagens originais em inglês ao lado das suas traduções, chamados ficheiros PO, produzidos e processados ​​através do GNU 'gettext'. Cada conjunto de dados de mensagens (em Inglês, no caso do Slint) a ser traduzido é registado num chamado ficheiro POT, a partir do qual é criado um ficheiro PO correspondente para cada idioma de destino, consulte http://docs.slackware.com/howtos:misc:internationalization_and_localization_of_shell_scripts[Internacionalização e localização de shell scripts] em http://docs.slackware.com/start [SlackDocs] para saber mais.
ru: Переводы имеют форму файлов, включая оригинальные английские сообщения вместе со своими переводами, называемых PO-файлами, получаемых и обрабатываемых при помощи GNU 'gettext'. Каждый данный набор сообщений (на английском в случае Slint) для перевода записан в так наываемый POT-файл, из которого генерируются один соответствующий PO-файл для данного языка, подробнее смотрите в http://docs.slackware.com/howtos:misc:internationalization_and_localization_of_shell_scripts[интернационализация и локализация сценариев оболочки] на http://docs.slackware.com/start[SlackDocs].
tr: Çevirilen içerik PO dosyaları denen, GNU 'gettext' tarafından üretilen ve işlenen, çevirilerin yanında orjinal İngilizce mesajların da dahil edildiği dosyalar biçimindedir. Çevirilecek olan verilen her mesaj kümesi (Slint'in durumunda İngilizce), POT dosyası denen, her bir hedef dil için ilişkili PO dosyasından üretilen dosya içine kaydedilir, daha fazlası için bakınız http://docs.slackware.com/howtos:misc:internationalization_and_localization_of_shell_scripts[Internationalization and localization of shell scripts] on http://docs.slackware.com/start[SlackDocs].

source: Messages included in a given POT file are gathered from one or several shell scripts or manual pages. Here is the current list of Slint's POT files and their scopes (see page link:tools.html[Tools] to know how to use associated tools).
es: Los mensajes incluidos en un archivo POT son obtenidos de uno o varios scripts de shell o páginas de manual. A continuación está la lista de los archivos POT actuales en Slint y sus alcances (vea la página link:tools.html[Herramientas] para saber cómo usar las herramientas relacionadas).
fr: Les messages contenus dans un fichier POT donné sont rassemblés à partir d'un ou plusieurs scripts shell ou pages de manuel. Voici la liste à jour des fichiers POT et leurs périmètres (voir la page link:tools.html[Outils] pour savoir comment utiliser les outils associés).
nl: Berichten in een gegeven POT-bestand zijn verzameld uit één of meer shell scripts of man pagina's. Hier is de actuele lijst van Slint POT-bestanden en hun doel (zie link:tools.html[Tools] om meer over de desbetreffende tools te weten te komen).
pt_pt: Mensagens incluídas num determinado ficheiro POT são recolhidas a partir de um ou vários shell scripts ou páginas de manual. Aqui está a lista atual de ficheiros POT do Slint e suas extensões (veja a página link:tools.html[Ferramentas] para saber como usar as ferramentas associadas).
ru: Сообщения, включенные в данный POT-файл, собраны из одного или нескольких сценариев оболочки или страниц руководства. Ниже список POT-файлов Slint и их охват (смотрите страницу link:tools.html[Инструменты], чтобы узнать как использовать соответствующие инструменты).
tr: Verilen POT dosyasına dahil edilen mesajlar bir ya da bir çok kabuk betiğinden ya da kılavuz sayfasından elde edilmiştir. Burada Slint'in aktif POT dosyaları ve bunların kapsamları vardır (eşleşen araçların nasıl kullanıldığını öğrenmek için bakınız link:tools.html[Tools] ).
