Repository: DidierSpaier/slint-website
Catalog: old/po/contribute/contribute.*.po
Languages: es, fr, nl, pt_pt, ru, tr

source: If a word beginning with a dollar sign is included in the original text it should be present in the translation with exactly the same spelling (case matters).
es: Si una palabra que empieza con un símbolo de dólar se incluye en el texto original, ésta debe estar presente en la traducción con exactamente la misma ortografía (la distinción entre mayúsculas y minúsculas es importante).
fr: Si un mot commençant par un symbole dollar est contenu dans le texte d'origine il doit être présent à l'identique dans la traduction (avec la même casse).
nl: Als een woord voorafgegaan door een dollarteken in de originele tekst staat moet het exact zo in de vertaalde tekst worden gespeld (hooflettergevoelig).
pt_pt: Se uma palavra que começa com um sinal de dólar é incluída no texto original esta deve estar presente na tradução com exatamente a mesma ortografia (a distinção entre maiúsculas e minúsculas é importante).
ru: Если слово начинается с знака доллара, входящего в оригинальный текст, оно должно быть в переводе с тем же написанием (формой падежа).
tr: Eğer orjinal mesaja dolar işareti ile başlayab bir mesaj eklenmişse bu çeviride tamamen aynı yazımla bulunmalıdır (büyük küçük harf önemlidir).

source: The translation text should include a "new line" character (or line feed, represented by "\n") at the beginning or at the end, exactly as the original text does. Conversely, if the original text doesn't have the character, then the translation shouldn't have it.
es: El texto de la traducción debe incluir un caracter de "nueva línea" (o cambio de línea, representado por "\n") al principio o al final, exactamente como lo tenga el texto original. Del mismo modo, si el texto original no tiene el caracter, entonces la traducción no debe tenerlo.
fr: Le texte traduit devrait comporter un caractère "nouvelle ligne" (ou saut de ligne, représenté par "\n') au début ou à la fin d'un message, exactement comme le texte d'origine. Inversement, si le texte d'origine de comporte pas ce caractère en début ou fin de message, la traduction ne doit pas le comporter non plus.
nl: De vertaling moet een "new line" karakter bevatten (of een line feed, vertegenwoordigd door "\n") aan het begin of eind, precies als in de originele tekst. Omgekeerd, als de originele tekst het karakter niet heeft moet de vertaling die ook niet hebben.
pt_pt: O texto de tradução deve incluir um caractere de "nova linha" (ou avanço de linha, representado por "\n") no início ou no final, exatamente como tem o texto original. Por outro lado, se o texto original não tem o caractere, então a tradução não o deve ter.
ru: Текст перевода должен содержать символ "новой строки" (или перевод каретки, представляемый как "\n") в начале или в конце, в точности как в оригинальном тексте. И наоборот, если в оригинальном тексте нет такого символа, то и в переводе его не должно быть.
tr: Çevirilen metin başta ya da sonda, tam olarak orjinal metinde olduğu gibi, "yeni satır" karakteri içermeli (ya da "\n" ile gösterilen satır sonu). Diğer taraftan orjinal metinde bu karakter yoksa çevirilen metinde de olmamalı.

source: A single backslash character "\" is not allowed in the translation.
es: Un caracter de barra invertida "\" por sí mismo no está permitido en la traducción.
fr: un caractère barre oblique inversée "\" isolé n'est pas autorisé dans la traduction.
nl: Een enkel backslash karakter "\" is niet toegestaan in de vertaling.
pt_pt: Um único caractere de barra invertida "\" não é permitido na tradução.
ru: Одиночный символ обратной косой черты "\" не разрешается использовать в переводе.
tr: Tek bir ters slaş karakterine "\" çevirilerde izin verilmez.

source: To check your translation against gettext's requirements you could run following command:
es: Para revisar que su traducción pase los requerimientos de gettext, puede ejecutar el siguiente comando:
fr: Pour vérifier que votre traduction satisfasse les exigences de 'gettext' vous pouvez exécuter a commande suivante :
nl: Om je vertaling te controleren op de vereisten van gettext geef je het volgende commando:
pt_pt: Para verificar a sua tradução em relação aos requisitos do gettext pode executar o seguinte comando:
ru: Чтобы проверить ваш перевод на соответствие требованиям gettext выполните следующую команду:
tr: Çevirinizin gettext'in gerekliliklerine uyumunu denetlemek için şu komutu çalıştırabilirsiniz:

source: msgfmt -c <name of the PO file>
es: msgfmt -c <nombre del archivo PO>
fr: msgfmt -c <nom du fichier PO>
nl: msgfmt -c <naam van het PO-bestand>
pt_pt: msgfmt -c <nome do ficheiro PO>
ru: msgfmt -c <имя PO-файла>

source: Warning about translation of man pages
es: Advertencia sobre la traducción de páginas de manual
fr: Avertissement concernant la traduction des pages de manuel
nl: Waarschuwing betreffende de vertaling van man pagina's
pt_pt: Aviso sobre a tradução de páginas de manual
ru: Предупреждение о переводе страниц руководств
tr: Kılavuz sayfalarının çevirisi ile ilgili uyarılar

source: Preserve carefully syntax of man pages found in English markup. For instance don't replace:
es: Preserve cuidadosamente la sintaxis de las páginas de manual con el marcado en Inglés. Por ejemplo, no reemplace:
fr: Préservez soigneusement la syntaxe des pages de manuel trouvées dans le balisage en Anglais. Par exemple ne remplacez pas :
nl: Behoud nauwkeurig de syntax van in het engels opgemaakte man pagina's. Vervang b.v. niet:
pt_pt: Preserve cuidadosamente a sintaxe das páginas de manual encontrada na marcação em Inglês. Por exemplo não substitua:
ru: Тщательно сохраняйте синтаксис страниц руководств в английской разметке. Например, не заменяйте:
tr: İngilizce işaretlede bulunan kılavuz sayfalarının sözdizimini dikkatlice koruyun. Örneğin şunları değiştirmeyin:

source: 'B<' with 'B <' (don't insert a space)
es: 'B<' con 'B <' (no inserte un espacio)
fr: 'B<' par 'B <' (n'insérez pas une espace)
nl: 'B<' door 'B <' (voeg geen spatie toe)
pt_pt: 'B<' com 'B <' (não insira um espaço)
ru: 'B<' на 'B <' (не вставляйте пробел)
tr: 'B<' with 'B <' (boşluk eklemeyin)

source: 'B<' with 'b<' (keep the B as a capital letter - and don't replace it by the Greek capital letter BETA that looks the same on the screen)
es: 'B<' con 'b<' (mantenga la B mayúscula - no la reemplace por la letra griega mayúscula BETA, que se ve similar en la pantalla)
fr: 'B<' par 'b<' (conservez la lettre B en capitale - et ne la remplacez pas par la lettre capitale grecque BETA, qui apparaît identique à l'écran)
nl: 'B<' door 'b<' (behoud de B als hoofdletter - en vervang hem niet door de Griekse hoofdletter BETA die er op het scherm hetzelfde uit ziet)
pt_pt: 'B<' com 'b<' (mantenha o B como uma letra maiúscula - e não a substitua pela letra grega maiúscula BETA que tem a mesma aparência no ecrã)
ru: 'B<' на 'b<' (сохраните B строчной буквой - и не заменяйте ее греческой строчной буквой BETA, которая выглядит на экране точно так же)
tr: 'B<' with 'b<' (B'yi büyük harf olarak tutun - ve onu yunan alfabesindeki aynı şekilde gözüken BETA ile değiştirmeyin)

source: "I" with '|' (don't replace the capital letter I with a pipe symbol)
es: "I" con '|' (no reemplace la I mayúscula con un símbolo de barra vertical)
fr: "I" par '|' (ne remplacez pas la lettre capitale I par une barre verticale)
nl: "I" door '|' (vervang de hoofdletter I niet door een pipe symbool)
pt_pt: "I" com '|' (não substitua a letra maiúscula I com um símbolo de barra vertical)
ru: "I" на '|' (не заменяйте строчную букву I на символ пайпа)
tr: "I" with '|' (büyük harf I ile boru sembolünü değiştirmeyin)

source: When translating shell commands, preserve English names of paths when needed. But you may and should translate arguments to be replaced by a value like 'packagename'
es: Al traducir comandos de shell, preserve los nombres en inglés de las rutas de directorios cuando sea necesario. Pero puede y debe traducir los argumentos que se reemplazan con un valor como 'packagename'.
fr: Quand vous traduisez des commandes shell, conservez les noms de chemins du texte d'origine quand c'est nécessaire. Mais vous pouvez et devez traduire les arguments devant être remplacés par une valeur, comme 'packagename'
nl: Behoud bij het vertalen van shell commando's waar nodig de engelse padnamen. Maar argumenten die te vervangen zijn door een waarde zoals 'packagename' mag en zou je moeten vertalen.
pt_pt: Ao traduzir comandos shell, preserve nomes em inglês dos caminhos de diretórios quando necessário. Mas pode e deve traduzir argumentos para ser substituído por um valor como 'packagename'
ru: При переводе команд оболочки при необходимости сохраняйте английские имена путей. Но вы можете и должны переводить аргументы, заменяя значения вроде 'packagename'
tr: Kabuk komutlarını çevirirken, İngilizce yol isimlerini gerekliyse değiştirmeyin. Fakat argümanları 'paketismi' gibi bir değerle değiştirebilirsiniz ve değiştirmelisiniz
