Repository: DidierSpaier/slint-website
Catalog: old/po/contribute/contribute.*.po
Languages: es, fr, nl, pt_pt, ru, tr

source: |POT File name|Resource name (Transifex)|Scope|Associated tool |slackware.pot|https://www.transifex.com/projects/p/slint/resource/slint/[slint]|Slint installer Slint package (without man pages)|toolbox.sh |pkgtools.pot|https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools]|man pages contained in package 'pkgtools'|gen_man_pages |slackpkg.pot|https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]|man pages contained in package 'slackpkg'|gen_man_pages |slint.pot|https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]|script slint.sh, see page link:tools.html[Tools]|toolbox_slint_sh |index.html.pot|https://www.transifex.com/projects/p/slint/resource/indexhtml/[index.html]|link:index.html[Old Slint's home page]|(none) |template.pot|https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po]|Sidebar and top title of Slint web pages|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/slinttxt/[slint.txt]|link:slint.html[Slint's home page]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/installertxt/[installer.txt]|link:installer.html[Slint installer]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/packagetxt/[package.txt]|link:package.html[Slint package]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/translatorstxt/[translators.txt]|link:translators.html[Translators]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/contributetxt/[contribute.txt]|link:contribute.html[Contribute]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/toolstxt/[tools.txt]|link:tools.html[Tools]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/changelogtxt/[changelog.txt]|link:changelog.html[ChangeLog]|(none)
es: |Archivo POT|Nombre del Recurso (Transifex)|Alcance|Herramienta asociada |slackware.pot|https://www.transifex.com/projects/p/slint/resource/slint/[slint]|Instalador Slint Paquete Slint (sin páginas de manual)|toolbox.sh |pkgtools.pot|https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools]|páginas de manual contenidas en el paquete 'pkgtools'|gen_man_pages |slackpkg.pot|https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]|páginas de manual contenidas en el paquete 'slackpkg'|gen_man_pages |slint.pot|https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]|script slint.sh, vea la página link:tools.html[Herramientas]|toolbox_slint_sh |index.html.pot|https://www.transifex.com/projects/p/slint/resource/indexhtml/[index.html]|link:index.html[Página de inicio antigua de Slint]|(ninguno) |template.pot|https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po]|Barra lateral y título superior de las páginas de Slint|(ninguno) |(ninguno)|https://www.transifex.com/projects/p/slint/resource/slinttxt/[slint.txt]|link:slint.html[Página de Inicio de Slint]|(ninguno) |(ninguno)|https://www.transifex.com/projects/p/slint/resource/installertxt/[installer.txt]|link:installer.html[Instalador Slint]|(ninguno) |(ninguno)|https://www.transifex.com/projects/p/slint/resource/packagetxt/[package.txt]|link:package.html[Paquete Slint]|(ninguno) |(ninguno)|https://www.transifex.com/projects/p/slint/resource/translatorstxt/[translators.txt]|link:translators.html[Traductores]|(ninguno) |(ninguno)|https://www.transifex.com/projects/p/slint/resource/contributetxt/[contribute.txt]|link:contribute.html[Contribuir]|(ninguno) |(ninguno)|https://www.transifex.com/projects/p/slint/resource/toolstxt/[tools.txt]|link:tools.html[Herramientas]|(ninguno) |(ninguno)|https://www.transifex.com/projects/p/slint/resource/changelogtxt/[changelog.txt]|link:changelog.html[ChangeLog]|(ninguno)
fr: |Nom du fichier POT |Nom de la "ressource" (Transifex)|Périmètre|Outil associé |slackware.pot|https://www.transifex.com/projects/p/slint/resource/slint/[slint]|Installateur Slint Paquet Slint (sans les pages de manuel)|toolbox.sh |pkgtools.pot|https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools]|Pages de manuel contenues dans un paquet 'pkgtools'|gen_man_pages |slackpkg.pot|https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]|Pages de manuel contenues dans un paquet 'slackpkg'|gen_man_pages |slint.pot|https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]|script slint.sh, voir la page link:tools.html[Outils]|toolbox_slint_sh |index.html.pot|https://www.transifex.com/projects/p/slint/resource/indexhtml/[index.html]|link:index.html[Ancienne page d'accueil du site Internet]|(aucun) |template.pot|https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po]|menu latéral et titre tout en haut des pages du site Internet|(aucun) |(aucun)|https://www.transifex.com/projects/p/slint/resource/slinttxt/[slint.txt]|link:slint.html[Accueil]|(aucun) |(aucun)|https://www.transifex.com/projects/p/slint/resource/installertxt/[installer.txt]|link:installer.html[Installateur Slint]|(aucun) |(aucun)|https://www.transifex.com/projects/p/slint/resource/packagetxt/[package.txt]|link:package.html[Paquet Slint]|(aucun) |(aucun)|https://www.transifex.com/projects/p/slint/resource/translatorstxt/[translators.txt]|link:translators.html[Traducteurs]|(aucun) |(aucun)|https://www.transifex.com/projects/p/slint/resource/contributetxt/[contribute.txt]|link:contribute.html[Contribuer]|(aucun) |(aucun)|https://www.transifex.com/projects/p/slint/resource/toolstxt/[tools.txt]|link:tools.html[Outils]|(aucun) |(aucun)|https://www.transifex.com/projects/p/slint/resource/changelogtxt/[changelog.txt]|link:changelog.html[Journal de bord]|(aucun)
nl: |POT-bestandsnaam|Bronnaam (Transifex)|Doel|Betreffende tool |slackware.pot|https://www.transifex.com/projects/p/slint/resource/slint/[slint]|Slint installer Slintpakket (zonder man pages)|toolbox.sh |pkgtools.pot|https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools]|man pages in pakket 'pkgtools'|gen_man_pages |slackpkg.pot|https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]|man pages in pakket 'slackpkg'|gen_man_pages |slint.pot|https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]|script slint.sh, zie link:tools.html[Tools]|toolbox_slint_sh |index.html.pot|https://www.transifex.com/projects/p/slint/resource/indexhtml/[index.html]|link:index.html[Old Slint's home page]|(none) |template.pot|https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po]|Zijbalk en hoofd-titel van Slint web-pagina's|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/slinttxt/[slint.txt]|link:slint.html[Slint's home page]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/installertxt/[installer.txt]|link:installer.html[Slint installer]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/packagetxt/[package.txt]|link:package.html[Slint package]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/translatorstxt/[translators.txt]|link:translators.html[Translators]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/contributetxt/[contribute.txt]|link:contribute.html[Contribute]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/toolstxt/[tools.txt]|link:tools.html[Tools]|(none) |(none)|https://www.transifex.com/projects/p/slint/resource/changelogtxt/[changelog.txt]|link:changelog.html[ChangeLog]|(none)
pt_pt: |Nome do ficheiro POT|Nome do recurso (Transifex)|Âmbito|Ferramenta associada |slackware.pot|https://www.transifex.com/projects/p/slint/resource/slint/[Slint]|Instalador Slint Pacote Slint (sem páginas de manual)|toolbox.sh |pkgtools.pot|https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools]|páginas de manual contidas no pacote 'pkgtools'|gen_man_pages |slackpkg.pot|https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]|páginas de manual contidas no pacote 'slackpkg'|gen_man_pages |slint.pot|https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[ficheiro POT para slint.sh]|script slint.sh, veja a página link:tools.html[Ferramentas]|toolbox_slint_sh |index.html.pot|https://www.transifex.com/projects/p/slint/resource/indexhtml/[index.html]|link:index.html[Antiga página de início Slint]|(nenhum) |template.pot|https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po]|Barra lateral e título superior das páginas da internet do Slint|(nenhum) |(none)|https://www.transifex.com/projects/p/slint/resource/slinttxt/[slint.txt]|link:slint.html[Página de início do Slint]|(nenhum) |(nenhum)|https://www.transifex.com/projects/p/slint/resource/installertxt/[installer.txt]|link:installer.html[Instalador Slint]|(nenhum) |(nenhum)|https://www.transifex.com/projects/p/slint/resource/packagetxt/[package.txt]|link:package.html[Pacote Slint]|(nenhum) |(nenhum)|https://www.transifex.com/projects/p/slint/resource/translatorstxt/[translators.txt]|link:translators.html[Tradutores]|(nenhum) |(nenhum)|https://www.transifex.com/projects/p/slint/resource/contributetxt/[contribua.txt]|link:contribute.html[Contribua]|(nenhum) |(nenhum)|https://www.transifex.com/projects/p/slint/resource/toolstxt/[tools.txt]|link:tools.html[Ferramentas]|(nenhum) |(nenhum)|https://www.transifex.com/projects/p/slint/resource/changelogtxt/[changelog.txt]|link:changelog.html[ChangeLog]|(nenhum)
ru: |Имя POT-файла|Название ресурса (Transifex)|Охват|Инструмент |slackware.pot|https://www.transifex.com/projects/p/slint/resource/slint/[slint]|Установщик Slint Пакет Slint (без страниц руководств)|toolbox.sh |pkgtools.pot|https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools]|Страницы руководств из пакета 'pkgtools'|gen_man_pages |slackpkg.pot|https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]|Страницы руководств из пакета 'slackpkg'|gen_man_pages |slint.pot|https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]|Сценарий slint.sh, смотрите страницу link:tools.html[Инструменты]|toolbox_slint_sh |index.html.pot|https://www.transifex.com/projects/p/slint/resource/indexhtml/[index.html]|link:index.html[Старая домашняя страница Slint]|(нет) |template.pot|https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po]|Боковая панель и заголовок web-страниц Slint|(нет) |(нет)|https://www.transifex.com/projects/p/slint/resource/slinttxt/[slint.txt]|link:slint.html[Домашняя страница Slint]|(нет) |(нет)|https://www.transifex.com/projects/p/slint/resource/installertxt/[installer.txt]|link:installer.html[Установщик Slint]|(нет) |(нет)|https://www.transifex.com/projects/p/slint/resource/packagetxt/[package.txt]|link:package.html[Пакет Slint]|(нет) |(нет)|https://www.transifex.com/projects/p/slint/resource/translatorstxt/[translators.txt]|link:translators.html[Переводчикам]|(нет) |(нет)|https://www.transifex.com/projects/p/slint/resource/contributetxt/[contribute.txt]|link:contribute.html[Содействие]|(нет) |(нет)|https://www.transifex.com/projects/p/slint/resource/toolstxt/[tools.txt]|link:tools.html[Инструменты]|(нет) |(нет)|https://www.transifex.com/projects/p/slint/resource/changelogtxt/[changelog.txt]|link:changelog.html[Журнал изменений]|(нет)
tr: |POT Dosya ismi|Kaynak adı (Transifex)|Kapsam|Eşleşen araç |slackware.pot|https://www.transifex.com/projects/p/slint/resource/slint/[slint]|Slint kurucu Slint paketi (kılavuz sayfaları olmadan)|toolbox.sh |pkgtools.pot|https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools]|man sayfaları 'pkgtools' içinde bulunur|gen_man_pages |slackpkg.pot|https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]|man sayfaları 'slackpkg' paketi içinde bulunur|gen_man_pages |slint.pot|https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]|slint.sh betiği, bakınız sayfa link:tools.html[Tools]|toolbox_slint_sh |index.html.pot|https://www.transifex.com/projects/p/slint/resource/indexhtml/[index.html]|link:index.html[Old Slint's home page]|(yok) |template.pot|https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po]|Sidebar and top title of Slint web pages|(yok) |(yok)|https://www.transifex.com/projects/p/slint/resource/slinttxt/[slint.txt]|link:slint.html[Slint's home page]|(yok) |(none)|https://www.transifex.com/projects/p/slint/resource/installertxt/[installer.txt]|link:installer.html[Slint kurucu]|(yok) |(yok)|https://www.transifex.com/projects/p/slint/resource/packagetxt/[package.txt]|link:package.html[Slint package]|(yok) |(yok)|https://www.transifex.com/projects/p/slint/resource/translatorstxt/[translators.txt]|link:translators.html[Translators]|(none) |(yok)|https://www.transifex.com/projects/p/slint/resource/contributetxt/[contribute.txt]|link:contribute.html[Contribute]|(none) |(yok)|https://www.transifex.com/projects/p/slint/resource/toolstxt/[tools.txt]|link:tools.html[Tools]|(none) |(yok)|https://www.transifex.com/projects/p/slint/resource/changelogtxt/[changelog.txt]|link:changelog.html[ChangeLog]|(none)

source: Transition from old to new web pages
es: Transición de las páginas web antiguas a las nuevas
fr: Transition des anciennes vers les nouvelles pages du site Internet
nl: Transitie van oude naar nieuwe webpagina's
pt_pt: Transição das páginas da internet antigas para as novas
ru: Переход от старых к новым web-страницам
tr: Eskisinden yeni sayfalara çeviriler

source: Our link:index.html[old home page] has been written directly in xhtml. This page has been translated in 13 languages, and will be progressively replaced by the current one, tentatively named link:slint.html[slint.html].
es: Nuestra link:index.html[página de inicio antigua] había sido escrita directamente en xhtml. Esta página ha sido traducida a 13 lenguajes, y será reemplazada progresivamente por la página actual, llamada tentativamente link:slint.html[slint.html].
fr: Notre link:index.html[ancienne page d'accueil] a été écrite directement en xhtml. Cette page a été traduite en 13 langues, et sera progressivement remplacée par l'actuelle, provisoirement nommée link:slint.html[slint.html].
nl: Onze link:index.html[oude home pagina] is rechtstreeks in xhtml geschreven. Deze pagina is vertaald in 13 talen en zal successievelijk vervangen worden door de huidige, voorlopig link:slint.html[slint.html] genoemd.
pt_pt: A nossa link:index.html[página de início antiga] tinha sido escrita diretamente em xhtml. Esta página foi traduzida em 13 idiomas, e será substituída progressivamente pela atual, provisoriamente chamada link:slint.html[slint.html].
ru: Наша link:index.html[старая домашняя страница] была написана на XHTML. Она была переведена на 13 языков и постепенно будет заменена новой, с предварительным названием link:slint.html[slint.html].
tr: link:index.html[old home page] sayfamız doğrudan xhtml ile yazılmıştır. Bu 13 dile çevirilmiştir ve sürekli olarak şu anki geçici olarak isimlendirilmiş link:slint.html[slint.html] ile değiştirilecektir.

source: Web pages are listed in the menu on the sidebar. The link:slint.html[home page] will progressively replace the old one, that will be neither translated to more languages nor updated any more.
es: Las páginas web están listadas en el menú en la barra lateral. El enlace link:slint.html[página de inicio] reemplazará progresivamente el antiguo, el cual ya no será traducido a más lenguajes ni será actualizado.
fr: Les pages du site sont listées dans le menu latéral. La link:slint.html[page d'accueil] remplacera progressivement l'ancienne, qui ne sera plus traduite dans de nouvelles langues ni mise à jour.
nl: Webpagina's staan in het menu op de zijbalk. De link:slint.html[homepage] zal geleidelijk de oude vervangen die niet in meer talen zal worden vertaald en niet meer zal worden bijgewerkt.
pt_pt: Páginas da internet estão inseridas no menu da barra lateral. A link:slint.html[Página de início] irá substituir progressivamente a antiga, que não será nem traduzida para mais idiomas nem atualizada.
ru: Web-страницы приведены в меню на боковой панели. link:slint.html[Домашняя страница] постепенно заменит старую, которая не будет переводиться на новые языки и обновляться.
tr: Web sayfaları kenar çubuğu üzerindeki menüde listelenmiştir. link:slint.html[home page] sürekli olarak, daha fazla dile çevrilmeyecek ya da artık güncellenmeyecek, eski olanı değiştirir,

source: Translation of web pages
es: Traducción de páginas web
fr: Traduction de pages du site Internet
nl: Vertaling van webpagina's
pt_pt: Tradução de páginas web
ru: Перевод web-страниц
tr: Web sayfalarının çevirisi

source: Some of the web pages are intended for end-user: link:slint.html[slint.html], link:installer.html[installer.html] and link:package.html[package.html]. Translation of these pages and of https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po] (used to generate translated top title and left sidebar of web pages) should be given priority.
es: Algunas de las páginas web están orientadas al usuario final: link:slint.html[slint.html], link:installer.html[installer.html] and link:package.html[package.html]. Estas páginas, así como https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po] (usado para generar el título superior traducido y la barra lateral izquierda de las páginas web) deben ser traducidas con prioridad.
fr: Quelques unes des pages du site Internet sont destinées aux utilisateurs finaux: link:slint.html[slint.html], link:installer.html[installer.html] and link:package.html[package.html]. Ces pages ainsi que le fichier https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po] (utilisé pour générer le menu latéral et le titre tout en haut des pages du site Internet) devraient être traduites en priorité.
nl: Sommige webpagina's zijn bedoeld voor eindgebruikers: link:slint.html[slint.tml], link:installer.html[installer.html] en link:package.html[package.html]. Vertaling van deze pagina's en van https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po] (gebruikt om de vertaalde hoofdtitel en linker zijbalk van de webpagina's te genereren) hebben prioriteit.
pt_pt: Algumas das páginas da internet são destinadas ao utilizador final: link:slint.html[slint.html], link:Installer.html[Instalador.html] e link:package.html[pacote.html]. Estas páginas assim como https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po] (usado para criar o título superior traduzido e a barra lateral esquerda das páginas da internet) devem ser traduzidas com prioridade.
ru: Некоторые web-страницы предназначены для конечных пользователей: link:slint.html[slint.html], link:installer.html[installer.html] and link:package.html[package.html]. Перевод этих страниц и https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po] (используется для генерации перевода заголовка и левой боковой панели web-страниц) должен быть осуществлен в первую очередь.
tr: Bazı sayfalar son kullanıcılar içindir: link:slint.html[slint.html], link:installer.html[installer.html] ve link:package.html[package.html]. Bu dosyaların çevirilmesine ve https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po] ya öncelik verilmelidir.

source: Other web pages: link:contribute.html[Contribute], link:translators.html[Translators], link:tools.html[Tools] and link:changelog.html[ChangeLog] may also be translated (that's up to each translation team) but 'after' pages listed in above paragraph have been translated.
es: Otras páginas web: link:contribute.html[Contribuir], link:translators.html[Traductores], link:tools.html[Herramientas] y link:changelog.html[ChangeLog] también pueden ser traducidas (eso depende de cada equipo de traducción) pero 'después' de que las páginas listadas en el párrafo anterior han sido traducidas.
fr: Les autres pages du site : link:contribute.html[Contribuer], link:translators.html[Traducteurs], link:tools.html[Outils] et link:changelog.html[Journal de bord] peuvent aussi être traduites (selon le choix de chaque équipe de traducteurs), mais 'après' traduction des pages listées au paragraphe précédent.
nl: Andere webpagina's zoals link:contribute.html[Bijdragen], link:translators.html[Vertalers], link:tools.html[Tools] en link:changelog.html[ChangeLog] mogen ook worden vertaald (dat is aan elk vertaalteam) maar alleen nadat de pagina's hierboven genoemd vertaald zijn.
pt_pt: Outras páginas da internet: link:contribute.html[Contribua], link:translators.html[Tradutores], link:tools.html[Ferramentas] e link:changelog.html[ChangeLog] podem também ser traduzidas (isso depende de cada equipa de tradução), mas 'depois' das páginas apresentadas no parágrafo acima tiverem sido traduzidas.
ru: Прочие web-страницы: link:contribute.html[contribute.html], link:translators.html[translators.html], link:tools.html[tools.html] and link:changelog.html[changelog.html] могут также быть переведены (на усмотрение каждой команды переводчиков), но 'после' страниц, приведенных параграфом выше.
tr: Diğer web sayfaları: link:contribute.html[Contribute], link:translators.html[Translators], link:tools.html[Tools] ve link:changelog.html[ChangeLog] da ayrıca çevirilebilir (bu her bir çeviri takımına kalmıştır) fakat yukarıdaki paragrafta listelenen sayfalar çevirildikten 'sonra'.

source: For a given language, when translating template.po it's better to leave in English names of (yet) untranslated web pages, so that visitors will understand that clicking on corresponding links in the menu will display these pages in English.
es: Para un lenguaje dado, al traducir template.po, es mejor dejar los nombres en Inglés de las páginas web sin traducir (por ahora), de forma que los visitantes entiendan que al hacer click en los enlaces correspondientes en el menú se desplegarán estas páginas en Inglés.
fr: Dans une langue donnée, lors de la traduction de 'template.po' il est préférable de laisser en Anglais les noms des pages non (encore) traduites, afin que les visiteurs comprennent que cliquer sur les liens correspondants dans le menu affichera ces pages en Anglais.
nl: Bij het vertalen van template.po van een gegeven taal is het beter de engelse namen van de (nog) niet vertaalde webpagina's te behouden zodat bezoekers die op de overeenkomstige links in het menu klikken weten dat ze deze pagina's in het engels zullen zien.
pt_pt: Para um certo idioma, ao traduzir o template.po é melhor deixar os nomes em Inglês das páginas da internet não traduzidas (por agora), para que os visitantes entendam que ao clicar nos links correspondentes no menu irá exibir essas páginas em Inglês.
ru: При переводе template.po лучше сохранять английские названия еще не переведенных страниц, это подскажет посетителям, что по щелчку на соответствующей ссылке в меню они увидят страницу на английском языке.
tr: Bir dil için, template.po'yu çevirirken henüz çevirilmemiş bir sayfanın isminin İngilizce olarak brakılması, kullanıcı ona tıkladığında karşılaşacağı sayfanın İnngilizce olacağını anlayacağı için, daha iyidir.
