Repository: DidierSpaier/slint-website
Catalog: old/po/installer/installer.*.po
Languages: es, ia, pl, pt_pt, sv, tr

source: Options are provided to set as defaults in the installed system the language and keymap used during installation, and make corresponding settings of keyboard under X if the X server is installed.
es: Se proveen opciones para establecer como estándar en el sistema instalado el lenguaje y el mapa del teclado usados durante la instalación, y hacer la configuración correspondiente al teclado en X si el servidor X es instalado.
ia: Optiones es fornite pro fixar como predefinite in le systema installate le linguage e le mappa de claviero usate durante le installation, e facer preferentias de claviero correspondente sub X si le servitor de X es installate.
pl: Podczas instalacji dostępne są opcje ustawienia domyślnego języka i mapy klawiatury oraz zapisania ich dla X (jeśli X jest zainstalowany)
pt_pt: As opções são fornecidas para definir como padrão no sistema instalado o idioma e mapa de teclado usado durante a instalação, e fazer ajustes correspondentes do teclado sob o X se o servidor X está instalado.
sv: Alternativ finns för att ställa in som standard i det installerade systemet språk och tangentlayout som används under installationen och gör motsvarande inställningar för tangentbordet under X om X-servern är installerad.
tr: Kurulum sırasında kullandığınız dil ve karakter haritasını, kurulan sistemde varsayılan olarak ayarlama seçenekleri sunulur ve eğer X sunucusu yüklenmişse X altında gerekli ayarlarlamalar da yapılır.

source: A Slint package is installed, that provides translations of the main Slackware tools and their manual pages, listed in link:package.html[Slint package], as well as documents put in /usr/doc/slint-<version>-<date>, including a Slint-HOWTO.txt and a script reinstall-slackware-packages.sh.
es: Se instala un paquete Slint que provee traducciones de las principales herramientas de Slackware y sus páginas de manual, listadas en link:package.html[paquete Slint], así como documentos en /usr/doc/slint-<versión>-<fecha>, incluyendo un Slint-HOWTO.txt y un script llamado reinstall-slackware-packages.sh.
ia: Un pacchetto de Slint es installate, illo forni traductiones del principal instrumentos de Slackware e de lor paginas de manual, listate in link:package.html[Slint package], assi como documentos ponite in /usr/doc/slint-<version>-<date>, includente un Slint-HOWTO.txt e un script reinstall-slackware-packages.sh.
pl: Pakiet Slint zapewnia tłumaczenia głównych narzędzi systemu Slackware oraz stron man wyszczególnionych w link:package.html[Pakiet Slint] oraz dokumentów umieszczonych w folderze /usr/docs/slint-<version>-<date>, włączając Slint-HOWTO.txt oraz skrypt reinstall-slackware-packages.sh.
pt_pt: Um pacote Slint está instalado, que oferece traduções das principais ferramentas do Slackware e seus manuais de referência, em lista no link:package.html[pacote Slint], bem como os documentos colocados em /usr/doc/slint-<versão>-<data>, incluindo um Slint-HOWTO.txt e um script reinstalar-slackware-packages.sh.
sv: En Slint-paketet är installerat, som ger översättningar av de viktigaste Slackware verktyg och deras manualsidor, som anges i länken: package.html[Slint package], liksom dokument som läggs i /usr/doc/slint-<version>-<datum>, däribland en Slint-HOWTO.txt och ett skript reinstall-slackware-packages.sh.
tr: Bir Slink paketi yüklendi, bu paket link:package.html[Slint paketi] listesinde de gösterilen ana Slackware araçları bunların kullanım kılavuzları için çevirileri sağlıyor. Ayrıca /usr/doc/slint-<version>-<date> altına bir Slint-HOWTO.txt ve reinstall-slackware-packages.sh betiği de içeren dökümanlar yüklendi.

source: If you use the small version of the installer, during installation you will also need a 'source media', in other words a media containing Slackware packages. Packages can be installed from a Slackware DVD/CDs, a Slackware USB stick, a pre-mounted directory, a hard drive partition, a Samba share, NFS (Network File System), a FTP/HTTP server. When choosing the SOURCE in the menu, the installer tells you what to do according to the kind of selected media.
es: Si utiliza la versión pequeña del instalador, durante la instalación también necesitará un 'medio de origen', en otras palabra un medio que contenga los paquetes de Slackware. Los paquetes pueden ser instalados de CDs o un DVD de Slackware, un dispositivo USB de Slackware, un directorio previamente montado, una partición de disco duro, un recurso compartido de Samba, NFS (Network File System), o un servidor FTP/HTTP. Cuando escoga la opción SOURCE en el menú, el instalador le dirá qué hacer de acuerdo al tipo de medio seleccionado.
ia: Si tu usa le parve version del installator, durante le installation tu anque necessitara 'medio de fonte', in altere parolas un medio continente pacchettos de Slackware. Pacchettos pote esser installate ex un DVD/CD de Slackware, un clave USB de Slackware, un directorio pre-montate, un partition de disco fixate, un quota de Samba,NFS (Network File System), un servitor FTP/HTTP. Quando on selige le FONTE in le menu, le installator dice te que facer secundo le typo de medio seligite.
pl: Jeśli używasz mayłej wersji instalatora, podczas instalacji będziesz potrzebował 'nośnika źródłowego', czyli nośnika zawierającego pakiety Slackware. Pakiety mogą być zainstalowane z płyty CD/DVD systemu Slackware, zasobu Samba, NFS, lub serwera FTP/HTTP. W zależności od wyboru ŹRÓDŁA w menu, instalator podejmie odpowiednie kroki.
pt_pt: Se você usar a versão pequena do instalador, durante a instalação, você também vai precisar de uma 'media de origem', noutras palavras, uma media contendo pacotes do Slackware. Os pacotes podem ser instalados a partir de um DVD/CDs Slackware, uma pen USB Slackware, um diretório pré-montado, uma partição do disco rígido, um compartilhamento Samba, NFS (Sistema de ficheiros de rede), um servidor FTP/HTTP. Quando escolher a FONTE no menu, o instalador diz-lhe o que fazer de acordo com o tipo de media selecionada.
sv: Om du använder den lilla versionen av installationsprogrammet, under installationen behöver du även ett "källmedia", med andra ord ett media innehållande Slackwarepaket. Paket kan installeras från Slackware DVD/CD-skivor, ett Slackware USB-minne, en förmonterad katalog, en hårddiskpartition, en Samba utdelning, NFS (Network File System), en FTP/HTTP-server. När du väljer SOURCE på menyn, berättar installationsprogrammet vad du ska göra beroende på vilken typ valda medier.
tr: Eğer kurucunun küçük sürümünü kullanıyorsanız, kurulum sırasında ayrıca bir 'kaynak ortam' a, diğer bir deyişle Slackware peketleri içeren bir ortama, onlar Slint kurucusu içinde olmadığından, ihtiyacınız olacak. Paketler Slackware CDsinden veya DVDsinden, Slackware USB belleğinden, bağlanmış bir dizinden, bir sabit disk bölümünden, Samba paylaşımından, NFS (Ağ Dosya Sistemi)inden, FTP/HTTP sunucudan kurulabilir. Menüde KANAK ı seçtiğinizde, kurucu size seçilen ortamın türüne göre ne yapılacağını söyler.

source: To get a source media, follow this link: http://www.slackware.com/getslack/[Get Slack]
es: Para conseguir el medio de origen, vea este enlace: http://www.slackware.com/getslack/[Get Slack]
ia: Pro obtener un medio de fonte, seque iste ligamine: http://www.slackware.com/getslack/[Get Slack]
pl: Aby pobrać nośnik źródłowy, odwiedź http://www.slackware.com/getslack/[Get Slack]
pt_pt: Para ter uma média de fonte, siga este link: http://www.slackware.com/getslack/[Get Slack]
sv: För att hitta källmedia, följ denna länk: http://www.slackware.com/getslack/[Get Slack]
tr: Bir kaynak ortam almak için şu bağlantıyı takip edin: http://www.slackware.com/getslack/[Get Slack]

source: If need be you can replace the installation media by another one containing the packages, as at time of installing the packages the installer will have been already loaded in memory.
es: Si es necesario puede reemplazar el medio de instalación por otro que contenga los paquetes, ya que al momento de instalar los paquetes el instalador ya ha sido cargado en memoria.
ia: Si tu necessita tu pote reimplaciar le medio de installation per un altere continente le pacchettos, perque al momento de installar le pacchettos, le installator ja habera essite cargate in memoria.
pl: Jeśli zajdzie potrzeba, możesz zastąpić nośnik instalacyjny innym nośnikiem zawierającym pakiety (w trakie instalacji pakietów, installator będzie już załadowany do pamięci).
pt_pt: Se for necessário, você pode substituir a media de instalação por uma outra contendo os pacotes, pois no momento da instalação dos pacotes do instalador eles já foram carregados na memória.
sv: Om så behövs kan du byta ut installationsmedia med ett annat som innehåller paketen, som vid tidpunkten för installationen av paket kommer installationsprogrammet redan ha lästs in i minnet.
tr: Gerekliyse, bu aşamada kurucu halihazırda belleğe yüklendiği için, kurulum CDnizi, paketleri içeren bir DVD ile değiştirebilirsiniz.
