Repository: DidierSpaier/slint-website
Catalog: old/po/installer/installer.*.po
Languages: es, ia, pl, pt_pt, sv, tr

source: Slint installer
es: Instalador Slint
ia: Installator de Slint
pl: Instalator Slint
pt_pt: Instalador Slint
sv: Slint installerare
tr: Slint kurucu

source: Slint installer allows you to use your prefered language during installation, and add translated administration tools and manual pages to Slackware.
es: El instalador Slint le permite utilizar su lenguaje preferido durante la instalación, y agregar herramientas de administración y páginas de manual a Slackware.
ia: Installator de Slint permitte te usar tu linguage preferite durante le installation, e adder instrumentos de administration e paginas de manual traducite a Slackware.
pl: Instalator Slint pozwala na instalację w twoim wybranym języku oraz dodanie so systemu Slackware przetłumaczonych narzędzi administracyjnych i stron man.
pt_pt: O Instalador Slint permite que você use o seu idioma preferido durante a instalação, adicione ferramentas de administração traduzidas e páginas de manual para Slackware.
sv: Slint installationsprogram tillåter dig att använda önskat språk under installationen, och lägger till översatta administrationsverktyg och manualsidor till Slackware.
tr: Slint kurucu kurulum sırasında tercih ettiğiniz dili kullanmanıza izin verir, ve Slackware'e tercüme edilmiş yönetim araçlarını ve kılavuz sayfalarını ekler.

source: A 'Braille terminal' can also be used to install then pilot the system. Instructions for use are available in https://slint.fr/docs/README_BRLTTY.
ia: Un 'terminal Braille' anque pote esser usate pro installar e postea pilotar le systema. Instructiones pro usar es disponibile in https://slint.fr/docs/README_BRLTTY.
pt_pt: Um 'terminal de Braille' também pode ser utilizado para instalar e depois pilotar o sistema. As instruções de utilização estão disponíveis em https://slint.fr/docs/README_BRLTTY.
tr: Sistemi yüklemek için 'Braille terminali' kullanılabilir. Kullanım talimatlarına https://slint.fr/docs/README_BRLTTY adresinden ulaşabilirsiniz.

source: Download and check installer's ISO image
es: Descargar y revisar la imagen ISO del instalador
ia: Discarga e verifica le imagine ISO del installator
pl: Pobierz i sprawdź obraz ISO instalatora
pt_pt: Transfira e verifique o instalador da imagem ISO
sv: Ladda ner och kontrollera installations ISO-avbild
tr: İndirin ve kurucu ISO kalıbını kontrol edin

source: Two sizes of ISO images are available:
es: Las imágenes ISO están disponibles en dos tamaños:
ia: Imagines ISO de duo grandor es disponibile:
pl: Obrazy ISO dostępne są w dwóch wielkościach:
pt_pt: Dois tamanhos de imagens ISO estão disponíveis:
sv: Två storlekar på ISO-avbilder finns:
tr: İki farklı boyutta kullanılabilir ISO kalıbı var:

source: The http://sourceforge.net/projects/slint/files/[DVD + USB full ISO images] contain all you need to install Slackware.
es: Las http://sourceforge.net/projects/slint/files/[imágenes ISO completas DVD + USB] contienen todo lo que necesita para instalar Slackware.
ia: Le http://sourceforge.net/projects/slint/files/[DVD + USB plen imagines ISO] contine omne cosas tu necessita pro installar.
pl: http://sourceforge.net/projects/slint/files/[Pełne obrazy ISO DVD + USB] zawierają wszystko, co jest niezbędne do instalacji systemu Slackware.
pt_pt: O http://sourceforge.net/projects/slint/files/[DVD + USB imagens ISO completas] contêm tudo o que você precisa para instalar o Slackware.
sv: http://sourceforge.net/projects/slint/files/[DVD + USB full ISO-avbilder] innehåller allt du behöver för att installera Slackware.
tr: http://sourceforge.net/projects/slint/files/[DVD + USB tam ISO kalıpları] Slackware'i yüklemek için ihtiyacınız olan her şeyi içerir.

source: The https://slint.fr/installers[CD + USB small ISO images] need to be completed by a media containing the Slackware packages, for instance a Slackware DVD.
es: Las https://slint.fr/installers[imágenes ISO pequeñas CD + USB] necesitan complementarse con un medio que contenga los paquetes de Slackware, por ejemplo un DVD de Slackware.
ia: Le https://slint.fr/installers[CD + parve imagines ISO de USB] necessita esser completate per un medio continente le pacchettos de Slackware, pro exemplo un DVD de Slackware.
pl: https://slint.fr/installers[Małe obrazy ISO CD + USB] potrzebują nośniki zawierające pakiety systemu Slackware, na przykład płyta DVD Slackware.
pt_pt: O https://slint.fr/installers[CD + USB imagens ISO pequenas] precisam de ser completadas por uma media que contém os pacotes do Slackware, por exemplo, um DVD do Slackware.
sv: https://slint.fr/installers[CD + USB små ISO-avbilder] behöver kompletteras med en media som innehåller Slackwarepaket, exempelvis en Slackware DVD.
tr: https://slint.fr/installers[CD + USB küçük ISO kalıpları] Slackware paketlerini içeren bir medyayla tamamlanmalıdır, örneğin bir Slackware DVD'si.

source: To download a full ISO image, first click on its version number, for instance 14.1.
es: Para descargar una imagen ISO completa, primero haga clic en el número de versión, por ejemplo 14.1.
ia: Pro discargar un imagine ISO complete, in prime loco pulsa sur su numero de version, per exemplo 14.1
pl: Aby pobrać pełny obraz ISO, naciśnij na właściwą wersję, na przykład 14.1.
pt_pt: Para transferir uma imagem ISO completa, clique primeiro no seu número de versão, por exemplo 14.1.
sv: För att ladda ner hela ISO-avbilden, klicka först på dess versionsnummer, till exempel 14.1.
tr: Bir tam ISO kalıbını indirmek için önce sürüm numarasına tıklayın, örneğin 14.1.

source: You can check the integrity of the ISO image with its md5 check sum.
es: Puede revisar la integridad de la imagen ISO con su suma de verificación md5.
ia: Tu pote verificar le integritate del imagine ISO per su summa de verifica md5.
pl: Możesz sprawdzić poprawność obrazu ISO przy użyciu sumy kontrolnej md5.
pt_pt: Você pode verificar a integridade da imagem ISO com a sua soma de verificação md5.
sv: Du kan kontrollera integriteten i ISO-avbilden med dess md5 checksumma.
tr: ISO kalıbının bütünlüğünü doğrumalak için md5 checksum kullanabilirsiniz.

source: For the small ISO images, downloading and using its associated md5 file (whose name ends in .md5).
es: Para las imágenes ISO pequeñas, descargue y use su archivo md5 asociado (cuyo nombre termina en .md5)
ia: Pro le parve imagines ISO, discarga e usa su associate file md5 (cuje nomine termina in .md5).
pl: Dla małych obrazów ISO, pobierz i użyj pliku md5 (plik z końcówką .md5).
pt_pt: Para as pequenas imagens ISO, transferindo e usando o seu ficheiro md5 associado (cujo nome termina em .md5).
sv: För de små ISO-avbilderna, ladda ner och använd dess tillhörande md5-fil (vars namn slutar på Md5).
tr: Küçük ISO kalıpları için ilgili md5 dosyasını (ismi .md5 ile biten) indirip kullanabilirsiniz

source: For the full ISO image, you can display the check sum clicking on the letter i in a black circle on the right of the link to the ISO image.
es: Para la imagen ISO completa, puede desplegar la suma de verificación al hacer clic en la letra i en el círculo negro a la derecha del enlace de la imagen ISO.
ia: Pro le imagine ISO complete, tu pote monstrar le summa de controlo check-sum per pulsar sur le littera i in un circulo nigre al dextera del ligamine al imagine ISO.
pl: Dla pełnych obrazów ISO, możesz wyświetlić sumę kontrolną klikając na literę i w czarnym kole na prawo od linku do płyty ISO.
pt_pt: Para a imagem ISO completa, você pode exibir a soma de verificação clicando sobre a letra i num círculo preto à direita do link para a imagem ISO.
sv: För den kompletta ISO-avbilden kan du visa granskningssumman genom att klicka på i'et i den svarta cirkel till höger om länken till ISO-avbilden.
tr: Tam ISO kalıpları için ISO kalıbı bağlantısının sağında siyah çember içine alınmış i harfine tıklayarak checksum bilgisini görüntüleyebilirsiniz.

source: For instance to make a polyglot installer of an internationalized Slackware64-14.1, download the ISO image (and the md5 file, in case of a small installer) then in the same directory type for instance one of following commands
es: Por ejemplo, para hacer un instalador políglota de un Slackware64-14.1 internacionalizado, descargue la imagen ISO (y el archivo md5, en el caso de un instalador pequeño) y en el mismo directorio escriba por ejemplo uno de los siguientes comandos
ia: Pro exemplo per facer un installator polyglotte de un Slackware64-14.1 internationalisate, discarga le imagine ISO (e le file md5, in caso de un parve installator) postea in le mesme directorio typa pro exemplo un del sequente commandos
pl: Na przykład aby utworzyć wielojęzyczny instalator umiędzynarodowionego systemu Slackware64-14.1, pobierz obraz ISO (oraz odpowiedni plik md5 przypadku małego instalatora), następnie w tym samym katalogu wpisz następujące polecenie:
pt_pt: Por exemplo, para criar um programa de instalação de um poliglota Slackware64-14.1 internacionalizado, transfira a imagem ISO (e o ficheiro md5, no caso de um pequeno instalador), depois no mesmo tipo de diretório, por exemplo, um dos seguintes comandos
sv: Till exempel för att göra en flerspråkig installation av en internationaliserad Slackware64-14.1, ladda ner ISO-avbilden (och md5-filen, i händelse av en liten installation) kör sedan i samma katalog till exempel ett av följande kommandon
tr: Örneğin, yerelleştirilmiş Slackware64-14.1 çokdilli kurucusunu yapmak için ISO kalıbını (eğer küçük kurucuyu kullanıyorsanız md5 dosyasını da) indirin ve aynı klasördeyken şu komutlardan birini uygulayın

source: md5sum -c slint64-14.1.iso.md5 # answer should be: OK md5sum slint64-14.1-full.iso # the result should be the same as displayed on the website
es: md5sum -c slint64-14.1.iso.md5 # la respuesta debe ser: OK md5sum slint64-14.1-full.iso # el resultado debe ser igual al mostrado en el sitio web
ia: md5sum -c slint64-14.1.iso.md5 # responsa deberea esser: OK md5sum slint64-14.1-full.iso # le exito deberea esser le mesme como monstrate in le website
pl: md5sum -c slint64-14.1.iso.md5 # powinno zwrócić: OK md5sum slint64-14.1-full.iso # wyświetlony ciąg powinien odpowiadać temu na stronie.
pt_pt: md5sum -c slint64-14.1.iso.md5 # a resposta deve ser: OK md5sum slint64-14.1-full.iso # o resultado deve ser o mesmo que o apresentado no site da internet
sv: md5sum -c slint64-14.1.iso.md5 # svaret skall bli: OK md5sum slint64-14.1-full.iso # Resultatet skall vara desamma som visas på hemsidan
tr: md5sum -c slint64-14.1.iso.md5 # yanıt OK olmalı md5sum slint64-14.1-full.iso # çıktısı web sayfasında gösterilenle aynı olmalıdır

source: Burn the ISO image on a DVD, a CD or an USB stick
es: Quemar la imagen ISO en un DVD, un CD o un dispositivo USB
ia: Grava le imagine ISO sur un DVD, un CD o un clave USB
pl: Wypal obraz ISO na nośnikach DVD, CD lub USB
pt_pt: Grave a imagem ISO num DVD, um CD ou numa pen USB
sv: Bränn ISO-avbilden på en DVD, en CD-skiva eller en USB-sticka
tr: ISO kalıbı CD, DVD veya USB bellek üzerine yazın

source: Make a bootable USB stick
es: Crear un dispositivo USB de arranque
ia: Crea un clave USB bootabile
pl: Stwórz bootowalny nośnik USB
pt_pt: Crie uma unidade USB de arranque
sv: Gör en bootbar USB-sticka
tr: Önyüklenebilir USB bellek oluşturun

source: All previous content of the USB stick will be LOST
es: Todo el contenido previo del dispositivo USB será ELIMINADO
ia: Omne previe contentos del clave USB essera PERDITE
pl: Cała poprzednia zawartość nośnika USB zostanie UTRACONA
pt_pt: Todos os ficheiros contidos no dispositivo USB serão PERDIDOS
sv: Allt innehåll på USB-minnet kommer att gå förlorade
tr: USB belleğin önceki tüm içeriği SİLİNECEK

source: Re-read carefully your command to make sure that you didn't write the name of a hard disk partition instead of that of the USB stick as this partition's content would be IRRECOVERABLY LOST
es: Lea cuidadosamente su comando para asegurarse de no haber escrito el nombre de una partición de disco duro en lugar del dispositivo USB, ya que el contenido de esta partición será ELIMINADO IRRECUPERABLEMENTE
ia: Relege con attention tu commando pro esser secur que tu non habeva scribite le nomine de un partition de disco fixate in loco de lo del clave USB perque le contento de iste partition essera PERDITE IRREPARABILEMENTE
pl: Dokładnie sprawdź, czy przypadkowo w twoim poleceniu nie podałeś nazwy partycji twardego dysku zamiast nośnika USB, gdyż zawartość wymienionej partycji zostanie BEZPOWROTNIE UTRACONA.
pt_pt: Releia atentamente o seu comando para se certificar de que você não escreveu o nome de uma partição do disco rígido em vez de a do dispositivo USB uma vez que os conteúdos desta partição seriam IRREMEDIAVELMENTE PERDIDOS
sv: Läs noga ditt kommando för att se till att du inte skrev namnet på en hårddiskpartition i stället för det USB-minnet eftersom denna partitions innehåll skulle OÅTERKALLELIGT FÖRLORAS
tr: Bu bölüm içeriğininde KURTARILAMAZ KAYIP olabileceğinden USB Belleğin ismi yerine Disk bölümünün ismini yazmadığınızdan emin olmak için komutunuzu dikkatlice tekrar okuyunuz.

source: On 'Linux' plug in the USB stick, then check its name with following commands:
es: En 'Linux', conecte el dispositivo USB, luego revise el nombre con los siguientes comandos:
ia: In 'Linux' inserta le clave USB, postea controla su nomine con le sequente commandos:
pl: Pod systemem 'Linux' włóż nośnik USB i sprawdź jego oznaczenie przy użyciu następujących poleceń:
pt_pt: No 'Linux' conecte o dispositivo USB, de seguida verifique o seu nome com os seguintes comandos:
sv: På 'Linux' plugga in USB-minnet, kontrollera sedan dess namn med följande kommandon:
tr: 'Linux''da USB belleği takın, sonra şu komutlarla ismini kontrol edin:

source: If its name is /dev/sdc for instance, type:
es: Si el nombre es, por ejemplo, /dev/sdc, escriba:
ia: Si su nomine es /dev/sdc pro exemplo, typa:
pl: Jeśli jego nazwa to przykładowo /dev/sdc wpisz:
pt_pt: Se por exemplo o seu nome é /dev/sdc, digite:
sv: Om till exempel namnet är /dev/sdc, skriv:
tr: Eğer ismi /dev/sdc ise örneğin, şunu yazın:

source: dd if=<filename.iso> of=/dev/sdc bs=1M
es: dd if=<nombre.iso> of=/dev/sdc bs=1M
pt_pt: dd if=<nome_do_ficheiro.iso> of=/dev/sdc bs=1M
sv: dd if=<filnamn.iso> of=/dev/sdc bs=1M
tr: dd if=<dosyaadı.iso> of=/dev/sdc bs=1M

source: On 'Windows' use application http://rufus.akeo.ie/[Rufus] that is free and open source.
es: En 'Windows' use la aplicación http://rufus.akeo.ie/[Rufus], la cual es gratis y de código abierto.
ia: In 'Windows' usa application http://rufus.akeo.ie/[Rufus] que es gratuite e open source, i.e. de software aperite.
pl: Pod systemem 'Windows' użyj darmowej i wolnej aplikacji http://rufus.akeo.ie/[Rufus]
pt_pt: No 'Windows' utilize a aplicação http://rufus.akeo.ie/[Rufus] que é livre e de código aberto.
sv: På "Windows" använd programet http://rufus.akeo.ie/[Rufus] som är gratis och öppen källkod.
tr: 'Windows' üzerinde özgür ve açık kaynak kodlu olan http://rufus.akeo.ie/[Rufus] yazılımını kullanın.

source: Make a bootable CD (small installer) or DVD (big installer)
es: Hacer un CD de arranque (instalador pequeño) o DVD (instalador grande)
ia: Crea un CD (installator parve) o un DVD (installator grande) que pote facer le boot
pl: Utwórz bootowalną płytę CD (mały instalator) lub DVD (duży instalator)
pt_pt: Crie um CD de arranque (pequeno instalador) ou DVD (grande instalador)
sv: Gör en startbar CD (liten installerare) eller DVD (stor installerare)
tr: Önyüklenebilir bir CD (küçük kurucu) veya DVD (büyük kurucu) oluşturun

source: On 'Linux' type a command like the first one below for a CD, or the second one for a DVD.
es: En 'Linux', escriba un comando como el primero abajo para un CD, o el segundo para un DVD.
ia: In 'Linux' typa un commando como le prime a basso pro un CD, o le secunde pro un DVD.
pl: W systemie Linux wpisz jedno z poniższych poleceń (pierwsze dla płyty CD, drugie dla DVD):
pt_pt: No 'Linux' digite um comando como o primeiro a seguir para um CD, ou o segundo para um DVD.
sv: På "Linux" skriv ett kommando som den första nedan för en CD-skiva, eller den andra för en DVD.
tr: 'Linux' üzerinde aşağıdaki komutlardan CD için birinciyi, DVD için ikinciyi girin:

source: On 'Windows 2000/XP/Vista/7' use application http://infrarecorder.org/[InfraRecorder] that is free and open source.
es: En 'Windows 2000/XP/Vista/7' use la aplicación http://infrarecorder.org/[InfraRecorder], la cual es gratis y de código abierto.
ia: In 'Windows 2000/XP/Vista/7' usa application http://infrarecorder.org/[InfraRecorder] que es gratuite e de software aperite.
pl: Na systemach 'Windows 2000/XP/Vista/7' użyj darmowej i wolnej aplikacji http://infrarecorder.org/[InfraRecorder].
pt_pt: No 'Windows 2000/XP/Vista/7' utilize a aplicação http://infrarecorder.org/[InfraRecorder] que é livre e de código aberto.
sv: På "Windows 2000/XP/Vista/7" använd programet http://infrarecorder.org/[InfraRecorder] som är gratis och öppen källkod.
tr: 'Windows 2000/XP/Vista/7' üzerinde özgür ve açık kaynak kodlu olan http://infrarecorder.org/[InfraRecorder] yazılımını kullanın.

source: On 'Windows 7/8' use http://windows.microsoft.com/en-US/windows7/Burn-a-CD-or-DVD-from-an-ISO-file[Windows Disk Image Burner], shipped with Windows 7 and 8
es: En 'Windows 7/8' use http://windows.microsoft.com/en-US/windows7/Burn-a-CD-or-DVD-from-an-ISO-file[Windows Disk Image Burner], incluido con Windows 7 y 8.
ia: In 'Windows 7/8' usa http://windows.microsoft.com/en-US/windows7/Burn-a-CD-or-DVD-from-an-ISO-file[Windows Disk Image Burner], fornite con Windows 7 e 8
pl: Na systemach 'Windows 7/8' użyj aplikacji http://windows.microsoft.com/en-US/windows7/Burn-a-CD-or-DVD-from-an-ISO-file[Windows Disk Image Burner], która jest częścią tych systemów.
pt_pt: No 'Windows 7/8' utilize o Windows http://windows.microsoft.com/en-US/windows7/Burn-a-CD-or-DVD-from-an-ISO-file[Windows Disk Image Burner], fornecido com o Windows 7 e 8
sv: På 'Windows 7/8 "Använd http://windows.microsoft.com/en-US/windows7/Burn-a-CD-or-DVD-from-an-ISO-file[Windows Disk Image Burner], som levereras med Windows 7 och 8
tr: 'Windows 7/8' üzerinde Windows 7 ve 8 ile gelen http://windows.microsoft.com/en-US/windows7/Burn-a-CD-or-DVD-from-an-ISO-file[Windows Disk Image Burner] kullanın

source: Use your polyglot installer
es: Use su instalador políglota
ia: Usa tu installator polyglotte
pl: Użyj wielojęzycznego instalatora
pt_pt: Utilize o seu instalador poliglota
sv: Använda din flerspråkiga installerare
tr: Çokdilli kurucunuzu kullanın

source: Just insert the installation media (CD, DVD or USB stick) and reboot your machine.
es: Solo inserte el medio de instalación (CD, DVD o dispositivo USB) y reinicie su máquina.
ia: Solmente inserta le medio de installation (CD,DVD o clave USB) e face de novemente le boot de tu machina.
pl: Włóż nośnik instalacyjny (CD, DVD lub USB) oraz zrestartuj komputer.
pt_pt: Apenas insira a media de instalação (CD, DVD ou pen USB) e reinicie o computador.
sv: Bara sätt in installationsmediat (CD, DVD eller USB-minne) och starta om din maskin.
tr: Kurulum ortamını (CD, DVD veya USB bellek) takın ve makinenizi yeniden başlatın.

source: On the greeting screen, you will choose your prefered language for installation typing the corresponding two digits code.
es: En la pantalla inicial, puede escoger su lenguaje preferido para la instalación escribiendo el código de dos dígitos correspondiente.
ia: Sur le schermo de benvenite, tu seligera tu linguage preferite pro le installation per typar le correspondente codice de duo digitos.
pl: Na ekranie powitalnym, wybierzesz język dla instalacji wpisując dwucyfrowy kod:
pt_pt: No ecrã de saudação, você vai escolher o seu idioma preferido para a instalação digitando o código de dois dígitos correspondente.
sv: På välkomstskärmen, kommer du att välja önskat språk för installation skriva in motsvarande två siffror.
tr: Karşılama ekranında yükleme için tercih ettiğiniz dili ilgili iki harflik kodu yazarak seçeceksiniz.

source: Beyond being polyglot, the Slint installers offer following features in addition to those of the genuine Slackware installers:
es: Además de ser políglotas, los instaladores Slint ofrecen las siguientes características adicionales a aquellas ofrecidas por los instaladores genuinos de Slackware:
ia: Ultra esser polyglotte, le installatores de Slint offere le sequente characteristicas in addition a illos del genuin installatores de Slackware:
pl: Oprócz bycia wielojęzycznym, instalatory Slint oferują następujące funkcje ponad te istniejące w oryginalnym instalatorze Slackware.
pt_pt: Além de ser poliglota, os instaladores Slint oferecem as seguintes características para além das dos instaladores Slackware genuínos:
sv: Utöver att vara flerspråkig, erbjuder Slint installationsprogram följande funktioner utöver de för original Slackware installationsprogram:
tr: Sliny kurucular çokdilli olmalarının yanında Slackware kurucularına ek olarak aşağıdaki özellikleri de sunar:

source: Default font and keymap are adapted to the language used for installation.
es: El tipo de letra y mapa del teclado estándares están adaptados al lenguaje utilizado en la instalación.
ia: Font predefinite e mappa de claviero es adaptate al linguage usate per le installation.
pl: Domyślna czcionka i mapa klawiatury dopasowana jest do języka używanego przy instalacji.
pt_pt: Fonte padrão e mapa de teclado são adaptados para a linguagem usada na instalação.
sv: Standard tecken och tangentlayout är anpassade till det språk som används för installation.
tr: Varsayılan yazı tipi ve tuş haritası kurulum için kullanılan dile uyarlanmıştır.

source: Whenever possible, a True Type font is used during installation, to automatically adapt the font size to the screen's resolution (for Slackware versions 14.0 and 14.1 only).
es: Siempre que sea posible, un tipo de letra True Type se usa durante la instalación, para adaptar automáticamente el tamaño de la letra a la resolución de la pantalla (solamente para las versiones 14.0 y 14.1 de Slackware).
ia: Quandocunque possibile, un font de typo True Type es usate durante le installation, pro adaptar automaticamente le grandor del font al resolution del schermo (solmente per versiones de Slackware 14.0 e 14.1).
pl: Gdzie tylko możliwe, czcionka True Type jest używana w czasie instalacji w celu automatycznego dopasowania wielkości czcionki do rozdzielczości ekranu (wyłącznie dla wersji 14.0 oraz 14.1)
pt_pt: Sempre que possível, uma fonte True Type é usada durante a instalação, para adaptar automaticamente o tamanho da fonte para a resolução do ecrã (para versões do Slackware 14.0 e 14.1 apenas).
sv: När det är möjligt, är det ett True Type teckensnitt som används under installationen för att automatiskt anpassa teckenstorleken till skärmens upplösning (endast för Slackware versionerna 14.0 och 14.1).
tr: Kurulum esnasında yazı tipinin ekran çözünürlüğüne otomatik olarak uyarlanması için mümkün olduğu taktirde True Type yazı tipleri kullanılır (sadece Slackware 14.0 ve 14.1 sürümleri için)

source: Option to create regular user accounts at end of installation (before rebooting) is provided.
es: Se provee una opción para crear cuentas de usuario normales al final de la instalación (antes de reiniciar).
ia: Il es fornite un option pro crear contos de usator regular al fin del installation (ante refacer le boot).
pl: Istnieje opcja utworzenia konta zwykłego użytkownika pod koniec instalacji (przed ponownym uruchomieniem komputera).
pt_pt: Opção para criar contas de utilizadores regulares no final da instalação (antes de reiniciar) é fornecida.
sv: Alternativ att skapa vanliga användarkonton vid slutet av installationen (innan omstart) finns.
tr: Yükleme sonunda (yeniden başlatmadan önce) düzenli kullanıcı hesaplarının oluşturulması seçeneği sunulmaktadır.
