Repository: DidierSpaier/slint-website
Catalog: old/po/*.pkgtools.po
Languages: fa

source: Output a report about which packages would be installed or upgraded but don't actually perform the upgrades.
fa: گزارشی از پکیج هایی که نصب و یا بروزرسانی می شوند ارائه می کند اما واقعا فرایند بروزرسانی را اجرا نمی کند.

source: Normally upgradepkg only upgrades packages that are already installed on the system, and will skip any packages that do not already have a version installed. If B<--install-new> is specified, the behavior is modified to install new packages in addition to upgrading existing ones.
fa: به صورت معمول upgradepkg تنها پکیج هایی را که روی سیستم نصب هستند بروزرسانی می کند و از نصب پکیج هایی که روی سیستم وجود ندارند خودداری می کند. اگر از این گزینه استفاده شود علاوه بر بروزرسانی پکیج های موجود، پکیج های جدید نیز نصب خواهند شد.

source: Upgradepkg usually skips packages if the exact same package (matching name, version, arch, and build number) is already installed on the system. Use the --reinstall option if you want to upgrade all packages even if the same version is already installed.
fa: فرمان upgradepkg معمولا از بروزرسانی پکیج هایی که مشخصات (نام، نسخه، معماری و شماره ساخت) مشابهی دارند خودداری می کند. استفاده از این گزینه تمام پکیج ها را بدون توجه به نسخه آنها بروزرسانی می کند.

source: Show all the gory details of the upgrade.
fa: تمام جزئیات بروزرسانی را نمایش می دهد.

source: BUGS
fa: باگها

source: Before upgrading a package, save any configuration files (such as in /etc) that you wish to keep. Sometimes these will be preserved, but it depends on the package structure. If you want to force new versions of the config files to be installed, remove the old ones manually prior to running upgradepkg.
fa: قبل از بروزرسانی پکیج، تمام فابلهای پیکربندی (نظیر فایلهای موجود در دایرکتوری etc/) که تمایل به نگهداری آنها دارید ذخیره نمائید. گاهی اوقات این فایلها حفظ می شوند اما این بستگی به ساختار پکیج دارد. اگر می خواهید نسخه های جدید فایلهای پیکربندی نصب شوند، به صورت دستی نسخه های قدیمی را قبل از اجرای upgradepkg حذف کنید.
