Repository: DidierSpaier/slint-website
Catalog: old/po/*.pkgtools.po
Languages: fa

source: 21 May 1994
fa: ۲۱ می ۱۹۹۴

source: Slackware Version 2.0.0
fa: اسلکور نسخه ۲.۰.۰

source: NAME
fa: نام

source: explodepkg - Extract the contents of a tar+compression package (such as a Slackware software package) in the current directory.
fa: ؛ explodepkg: استخراج کننده محتویات یک پکیج مبتنی بر tar (نظیر یک پکیج نرم افزاری اسلکور) در دایرکتوری فعلی ؛

source: SYNOPSIS
fa: اختصار

source: DESCRIPTION
fa: توصیف

source: B<explodepkg> uncompresses and untars Slackware *.tgz (or .tbz, .tlz, .txz) packages (or any archive that was created by compressing a tarfile with one of the supported compression utilities) in the current directory. It is not usually used to install packages, since it doesn't execute the installation scripts in ./install or ./var/log/setup. The primary use for B<explodepkg> is in package maintenance - exploding a package in a subdirectory, making fixes to it or upgrading the software, and then building the updated package with B<makepkg.>
fa: ابزار explodepkg پکیج های اسلکور با فرمتهای tgz ،tbz ،tlz و txz یا هر پکیج دیگری که از فشرده سازی یک فایل tar با ابزارهای استاندارد بدست آمده باشد، در دایرکتوری فعلی استخراج می کند. این فرمان معمولا برای نصب پکیج استفاده نمی شود چون قادر به اجرای اسکریپت های نصب موجود در install/. یا در var/log/setup/. نیست. استفاده اصلی این ابزار در مدیریت پکیج ها به معنی استخراج بک پکیج در یک زیردایرکتوری، تعمیر یا ارتقاء آن و سپس ساخت پکیج ارتقاء یافته با استفاده از ابزار makepkg می باشد.

source: AUTHOR
fa: نویسنده

source: SEE ALSO
fa: نگاه کنید به

source: 22 Nov 2001
fa: ۲۲ نوامبر ۲۰۰۱

source: Slackware Version 8.1.0
fa: اسلکور نسخه 8.1.0

source: installpkg - install Slackware packages.
fa: ؛ installpkg: نصاب پکیج های اسلکور ؛

source: B<installpkg> installs single or multiple *.tgz (or .tbz, .tlz, .txz) binary packages designed for use with the Slackware Linux distribution onto your system.
fa: ابزار installpkg یک یا چند پکیج باینری اسلکور با فرمت های tgz ،tbz ،tlz و txz که برای استفاده در توزیع اسلکور لینوکس طراحی شده اند، روی سیستم شما نصب می کند.

source: OPTIONS
fa: گزینه ها

source: B<--warn packagename>
fa: B<--warn پکیج>

source: Generate a list of files that would be overwritten to the standard output, but do not actually install the package. The list is formatted in a suitable fashion to use as a list of files to backup.
fa: لیستی از فایلهایی که جایگزین خروجی استاندارد (stdout) می شوند تهیه می کند اما پکیج را نصب نمی کند. این لیست در یک فرمت مناسب تهیه شده و به عنوان لیست فایلهای لازم برای پشتیبان گیری مورد استفاده قرار می گیرد.

source: B<--md5sum packagename>
fa: B<--md5sum پکیج>

source: Record the package md5sum in the metadata written in /var/log/packages.
fa: اطلاعات md5sum یک پکیج را در مسیر var/log/packages/ ثبت می کند.

source: Install using a location other than / (the default) as the root of the filesystem to install on. In the example given, use /otherroot instead. Setting the ROOT environment variable does the same thing.
fa: پکیج را در محلی غیر از محل پیش فرض (/) به عنوان ریشه فایل سیستم نصب می کند. در مثال ارائه شده از otherroot/ استفاده می شود. تنظیم متغیر محیطی ROOT عمل مشابهی انجام می دهد.

source: Use /bin/dialog to display an informational dialog as the package is installed. Primarily used when installpkg is called from other scripts.
fa: برای نمایش اطلاعات از bin/dialog/ به هنگام نصب پکیج استفاده شده و به ویژه به هنگام فراخوانی installpkg از اسکریپت های دیگر مورد استفاده قرار می گیرد.

source: Use /bin/dialog to display a menu asking the user if they would like to install the package(s) or not. Generally used when installpkg is called from other scripts.
fa: از bin/dialog/ برای نمایش پرسش از کاربر به منظور نصب پکیج استفاده می کند. این گزینه نیز معمولا به هنگام فراخوانی این ابزار از اسکریپت های دیگر استفاده می شود.

source: Install the package displaying only a single description line to stdout.
fa: پکیج را صرفا با نمایش یک توصیف یک خطی در خروجی استاندارد، نصب می کند.

source: Used with -menu mode. When selected, always ask if a package should be installed regardless of what the package's priority is.
fa: به همراه حالت منو (menu-) استفاده شده و به هنگام انتخاب، بدون توجه به اولویت پکیج نصب آن را از کاربر سئوال می کند.

source: When installing with the -menu option, package priority levels (found in the file "tagfile" in the package directory) are used to automatically install (ADD) or skip (SKP) a package, or to suggest recommended (REC) or optional (OPT) to the user if a menu is displayed. If a priority is set on the command line, it will override the values set in the tagfile for the entire package list.
fa: به هنگام نصب با استفاده از گزینه منو (menu-)، این گزینه از سطوح اهمیت پکیج ها (ارائه شده در فایل tagfile موجود در دایرکتوری پکیج) برای نصب (ADD)، عدم نصب اتوماتیک (SKP) یا پیشنهاد پکیج های توصیه شده (REC) یا انتخابی (OPT) (در صورت نمایش منو) استفاده می کند. اگر یک اولویت در خط فرمان تعیین شود جایگزین مقادیر مندرج در فایل tagfile برای لیست تمام پکیج ها خواهد شد.

source: Specify a different file to use for package priorities (in this example, /somedir/tagfile will be used). The default is "tagfile" in the package's directory.
fa: فایل جایگزینی برای استفاده در اولویت بندی پکیج ها مشخص می کند (در این مثال از somedir/tagfile/ استفاده می شود). حالت پیش فرض، فایل tagfile موجود در دایرکتوری پکیج می باشد.

source: EXAMPLES
fa: مثالها

source: B<Install a font package for X:>
fa: B<نصب یک پکیج فونت برای X:>

source: Note that if a package is already installed, upgradepkg(8) should be used instead.
fa: به خاطر داشته باشید که اگر یک پکیج قبلا نصب شده بود باید از upgradepkg استفاده شود.

source: B<Create a backup of the files that would be overwritten if the package is installed:>
fa: B<ساخت پشتیبان از فایلهایی که در صورت نصب یک پکیج جایگزین خواهند شد:>

source: makepkg - make Slackware packages.
fa: ؛ makepkg: سازنده پکیج های اسلکور ؛

source: B<makepkg> [ B<-l, --linkadd y|n> ] [ B<-c, --chown y|n> ] B<packagename>
fa: B<makepkg> [ B<-l, --linkadd y|n> ] [ B<-c, --chown y|n> ] B<پکیج>

source: B<makepkg> creates a new Slackware compatible package. The package is constructed using the contents of the current directory and all subdirectories. If symbolic links exist, they will be converted to script code to recreate them when the package is installed. This code will be appended to the primary installation script B<( install/doinst.sh )> , or, if that script does not exist it will be created with those contents. The package will be written out to the file B<packagename> which should be the full name, including the extension. This is usually .tgz, but .tbz, .tlz, and .txz are also accepted. The proper compression utility (gzip, bzip2, lzma, or xz) needs to be installed on the machine.
fa: ابزار makepkg یک پکیج سازگار با اسلکور ایجاد می کند. پکیج با استفاده از محتویات دایرکتوری فعلی و تمام زیرشاخه های آن ایجاد می شود. اگر لینک های نمادین (symbolic link) وجود داشته باشند، به منظور تولید دوباره در هنگام نصب به اسکریپت تبدیل می شوند. این کد به انتهای اسکریپت اصلی نصب واقع در مسیر install/doinst.sh اضافه شده یا اگر آن اسکریپت وجود نداشت با استفاده از آن محتویات تولید خواهد شد. پکیج به صورت یک فایل ساخته می شود که باید حاوی نام کامل فایل به همراه پسوند آن باشد. این پسوند معمولا tgz است اما پسوندهای tbz ،tlz و txz نیز قابل قبول هستند. لازم است که ابزار فشرده سازی مناسب (مانند gzip ،bzip2 ،lzma یا xz) روی سیستم نصب باشند.

source: If y, add any symbolic links found to the install script (doinst.sh) and delete them. This is the recommended action. If this option is not used, makepkg will prompt if symbolic links are found.
fa: در صورت انتخاب y برای این گزینه، هر لینک نمادینی که پیدا شود به اسکریپت نصب (doinst.sh) اضافه شده و حذف می شود. این روش مورد توصیه است. اگر از این گزینه استفاده نشود، makepkg در صورت پیدا کردن لینک های نمادین اطلاع رسانی خواهد کرد.

source: If this option is given, then any symbolic links added to doinst.sh will be prepended to the existing script. This is useful for packages that contain shared libraries that need to be linked first because programs will use them later in the doinst.sh script.
fa: اگر این گزینه مورد استفاه قرار گیرد، تمام لینک های نمادین اضافه شده به doinst.sh به ابتدای اسکریپت موجود اضافه خواهند شد. این شیوه برای پکیج هایی که حاوی کتابخانه های مشترکی هستند که باید لینک شوند مفید است. چون برنامه ها بعدا در اسکریپت doinst.sh از آنها استفاده خواهند کرد.

source: If y, makepkg will reset all directory permissions to 755 and ownership to root:root. In general, you should have the permissions and ownerships worked out yourself, so relying on setting this option to y is somewhat sloppy. It is not the default. If an option is not provided, makepkg will prompt.
fa: در صورت وارد کردن y برای این گزینه، makepkg تمام دسترسی های دایرکتوری را به ۷۵۵ تغییر داده و مالکیت آنها را به root:root تغییر می دهد. بطور معمول شما باید دسترسی و مالکیت را خودتان تعیین کنید. بنابراین انتخاب y برای این گزینه چندان مناسب نبوده و گزینه پیش فرض نمی باشد. اگر گزینه ای انتخاب نشود، makepkg از شما سئوال خواهد کرد.

source: INSTALLATION SCRIPTS
fa: اسکریپت های نصب

source: There are 3 types of installation scripts supported in the Slackware package system.
fa: سه نوع اسکریپت نصب در سیستم پکیج اسلکور پشتیبانی می شوند.

source: The first is the
fa: اولین آنها

source: B<primary> installation script. This is found in the subdirectory B<./install> and must have the name B<doinst.sh> in order to be recognized. This ( and other install scripts ) should be written using the basic Bourne shell syntax recognized by the B<ash> shell, since this is the shell that will be used to execute the script when installing from a Slackware install floppy. This is a common trap - beware of using B<bash> syntax extensions, because the script will work fine when installed from the hard drive, but will bomb out when installed from floppy. If the package is for personal use, this isn't a problem. Be careful, though, if you plan to share your package with other users. The B<primary installation script> is executed immediately after the package is installed with B<installpkg, pkgtool,> or B<setup.>
fa: اسکریپت نصب B<اصلی> می باشد. این اسکریپت در زیردایرکتوری install/. یافت شده و باید دارای نام doinst.sh باشد تا شناخته شود. این اسکریپت و دیگر اسکریپت های نصب باید با استفاده از Bourne shell نوشته شوند تا بوسیله Bash شناخته شوند. چون bash تنها مفسری است که به هنگام نصب از فلاپی اسلکور مورد استفاده قرار می گیرد. زمان استفاده از اسکریپت های bash مراقب باشید چون اسکریپت به هنگام نصب از هارددیسک عالی کار می کند اما هنگام نصب از روی فلاپی خوب عمل نمی کند. اگر پکیج برای استفاده شخصی باشد، این مسئله مشکلی به وجود نخواهد آورد. به هر صورت اگر تصمیم دارید پکیج را با دیگر کاربران به اشتراک بگذارید, احتیاط کنید. B<اسکریپت اصلی نصب> بلافاصله پس از نصب پکیج بوسیله installpkg ،pkgtool یا setup. اجرا می شود.

source: The second type of script is the
fa: دومین نوع اسکریپت

source: B<configuration> script. This is found in the subdirectory B<./var/log/setup> and must have a name that starts with B<setup.> in order to be recongnized. An example is the timezone script: B</var/log/setup/setup.timeconfig.> These scripts are executed during the B<CONFIGURE> phase of B<setup,> and are re-executed each time the user runs the B<CONFIGURE> option from B<setup> from then on. Typically, the user will go through this phase of setup following the installation of all the packages. Anything that needs to be interactive should go in one of these scripts to avoid halting the package installation process during B<setup.>
fa: اسکریپت B<پیکربندی> می باشد. این اسکریپت در مسیر var/log/setup/. یافت شده و نام آن باید با setup آغاز شود تا شناسایی گردد. اسکریپت منطقه زمانی یا همان .var/log/setup.timeconfig/ مثالی از این نوع می باشد. این اسکریپت در مرحله پیکربندی (CONFIGURE) به هنگام نصب سیستم (setup) اجرا شده و هر زمان گزینه CONFIGURE انتخاب شود، مجددا اجرا می گردد. معمولا کاربر پس از نصب تمام پکیج ها وارد این مرحله از نصب سیستم می شود. هر چیزی که نیاز به گزینه های تعاملی دارد باید وارد این اسکریپت ها شود تا مانع نصب پکیج ها هنگام نصب سیستم نشود.

source: The third type of script is the
fa: نوع سوم اسکریپت

source: B<onlyonce> script. Like the name suggests, these are executed only once after the package is installed, in contrast to the standard B<configuration> script. These scripts are also found in the B<./var/log/setup> directory and must have a name that starts with B<setup.,> but in addition the name must contain the string B<onlyonce.> An example might be a script with the name B</var/log/setup/setup.onlyonce.testscript>
fa: اسکریپت های B<یکبارمصرف> می باشند که همانطور که از اسمشان پیداست تنها یکبار پس از نصب پکیج اجرا می شوند. برخلاف اسکریپت استاندارد B<پیکربندی> این اسکریپت ها در زیردایرکتوری var/log/setup/. نیز یافت شده و نام آنها علاوه بر عبارت setup باید دارای onlyonce نیز باشد. مانند: var/log/setup/setup.onlyonce.testscript/

source: PACKAGE FORMAT
fa: فرمت پکیج

source: B<makepkg> uses GNU tar plus GNU gzip to create its packages. A simple way to extract the contents of a package (without executing the installation scripts, of course) is to use a command like this:
fa: فرمان makepkg علاوه بر GNU tar از ابزار GNU gzip برای تولید پکیج ها استفاده می کند. روش ساده برای استخراج یک پکیج (بدون اجرای اسکریپت نصب) استفاده از فرمانی شبیه این می باشد:

source: explodepkg package.tgz
fa: explodepkg پکیج.tgz

source: Or, something like this:
fa: یا چیزی شبیه این:

source: gzip -dc package.tgz | tar xvvf -
fa: gzip -dc پکیج.tgz | tar xvvf -

source: 24 Nov 1995
fa: ۲۲ نوامبر ۱۹۹۵

source: Slackware Version 3.1.0
fa: اسلکور نسخه ۳.۱.۰

source: pkgtool - software package maintenance tool.
fa: ؛ pkgtool: ابزار مدیریت پکیج های اسکلور ؛

source: B<pkgtool> is a menu-driven package maintenance tool provided with the Slackware Linux distribution. It allows the user to install, remove, or view software packages through an interactive system. Pkgtool can also be used to re-run the menu-driven scripts normally executed at the end of a Slackware installation. This is useful for doing basic reconfiguration (like changing the mouse type).
fa: فرمان pkgtool یک ابزار مدیریت پکیج دارای منو در توزیع اسلکور لینوکس می باشد. این ابزار به کاربر اجازه نصب، حذف یا مشاهده پکیج های اسلکور از طریق یک سیستم تعاملی را می دهد. همچنین pkgtool می تواند برای اجرای مجدد اسکریپت های دارای منو که در حالت معمول در انتهای نصب اسلکور اجرا می شوند، مورد استفاده قرار گیرد. این عمل برای بازنگری در برخی پیکربندیهای ابتدایی نظیر تغییر نوع موس مورد استفاده مفید است.

source: Most users will not want to use any options when running B<pkgtool.> These are generally used only when B<pkgtool> is run during the initial system installation. Feel free to try them, but be careful.
fa: اغلب کاربران به هنگام استفاده از pkgtool از هیچ گزینه ای استفاده نمی کنند. این گزینه ها معمولا تنها هنگام نصب سیستم مورد استفاده قرار می گیرند. در استفاده از آنها آزاد هستید اما مراقب باشید.

source: Install the disk sets A, B, C. Seperate the disk set names by '#' symbols.
fa: سری دیسک های B ،A و C را نصب می کند. نام سری دیسک ها را با علامت # از یکدیگر تفکیک کنید.

source: When this flag is present, B<pkgtool> will not attempt to unmount and remount the source device with each disk.
fa: زمانی که این گزینه ارائه شود pkgtool تلاشی برای لغو اتصال سخت افزار منبع (unmount) و اتصال مجدد (remount) برای هر دیسک نخواهد کرد.

source: When this flag is present, B<pkgtool> will install every package encountered no matter what the tagfiles say.
fa: زمانی که این گزینه استفاه شود B<pkgtool> هر پکیجی را که با آن مواجه شود، بدون توجه به محتویات فایل tagfile نصب خواهد کرد.

source: This flag is used to specify from the command line which tagfile should be used for the installation.
fa: این گزینه برای مشخص کردن فایل tagfile مورد استفاده برای نصب پکیج ها، استفاده می شود.

source: B<--source_dir directory>
fa: B<--source_dir دایرکتوری>

source: Used when installing multiple packages from disk sets. This is the directory in which the subdirectories for each disk are found. This isn't used when installing from floppy.
fa: این گزینه برای نصب چندین پکیج از سری دیسک ها مورد استفاده قرار می گیرد. این یک دایرکتوری است که تمام زیرشاخه ها برای هر دیسک در آن قرار دارند. این گزینه برای نصب از طریق فلاپی استفاده نمی شود.

source: B<--target_dir directory>
fa: B<--target_dir دایرکتوری>

source: The directory where the target root directory is located. This is '/' when installing on the hard drive, or typically '/mnt' when installing from an install disk.
fa: مسیری که دایرکتوری ریشه فایل سیستم مقصد در آن قرار دارد. به هنگام نصب روی هارددیسک این دایرکتوری همان '/' و هنگام نصب از روی دیسک نصب، 'mnt/' می باشد.

source: B<--source_device device>
fa: B<--source_device سخت افزار>

source: The source device to install from. This is not used if you've provided the B<--source_mounted> flag. It's usually used when installing from floppy, as in: --source_device /dev/fd0u1440 or --source_device /dev/fd1h1200.
fa: سخت افزار منبعی که برای نصب استفاه می شود. این گزینه برای زمانی که گزینه source_mounted-- استفاده می شود، مورد استفاده قرار نمی گیرد. بلکه معمولا به هنگام نصب از طریق فلاپی به کار می رود. نظیر مثالهای زیر: --source_device /dev/fd0u1440 --source_device /dev/fd1h1200

source: 23 Nov 2001
fa: ۲۳ نوامبر ۲۰۰۱

source: removepkg - remove Slackware packages.
fa: ؛ removepkg: حذف کننده پکیج های اسلکور ؛

source: B<removepkg> B<packagename>
fa: B<removepkg> B<پکیج>

source: [ B<ROOT=/mnt> ] B<removepkg> [ B<-copy> ] [ B<-keep> ] [ B<-preserve> ] [ B<-warn> ] B<packagename>
fa: [ B<ROOT=/mnt> ] B<removepkg> [ B<-copy> ] [ B<-keep> ] [ B<-preserve> ] [ B<-warn> ] B<پکیج>

source: B<removepkg> removes a previously installed Slackware package, while writing a progress report to the standard output. A package may be specified either by the full package name (as you'd see listed in /var/log/packages/), or by the base package name. For example, the package foo-1.0-i486-1.tgz may be removed with any of the following commands:
fa: ابزار removepkg یک پکیج نصب شده اسکلور را در حالیکه گزارش پیشرفت را در خروجی استاندارد نمایش می دهد، حذف می کند. پکیج می تواند بوسیله نام کامل (به صورتی که در var/log/packages/ لیست شده) و یا نام مخفف مشخص شود. به عنوان مثال پکیج foo-1.0-i486-1.tgz می تواند با هر کدام از فرمانهای زیر حذف شود:

source: removepkg foo-1.0-i486-1.tgz (also recognized: .tbz, .tlz, .txz)
fa: removepkg foo-1.0-i486-1.tgz (tbz و tlz ،txz یا فرمتهای)

source: When deleting files, B<removepkg> will analyze the contents of the other packages installed on your system, and will only delete the files that are unique to the package being removed. Similarly, the installation scripts for all the other packages will be considered when deciding whether or not to delete symbolic links from the package.
fa: هنگام حذف فایلها removepkg محتویات تمام پکیج های نصب شده روی سیستم را آنالیز کرده و تنها فایلهایی را حذف می کند که منحصر به پکیج در حال حذف هستند. به صورت مشابه اسکریپت های نصب تمام پکیج های دیگر هنگام تصمیم گیری در خصوص حذف یا عدم حذف لینک های سمبولیک از پکیج، مورد ملاحظه قرار می گیرند.

source: Removing a package (as well as installing one) can be a dangerous undertaking. For this reason, there is the B<-warn> option available. When you use this, B<removepkg> will not actually remove any files or links, but will output a detailed report of what it would do if you actually did remove the package. It's suggested that you do this (and maybe pipe the output to B<less> ) before removing packages to make sure you've backed up anything that might be important.
fa: حذف یک پکیج (مانند نصب پکیج) ممکن است خطرانی در پی داشته باشد. به همین دلیل گزینه warn- وجود دارد. هنگام استفاده از این گزینه removepkg واقعا فایل یا لینکی را حذف نخواهد کرد بلکه یک گزارش تفضیلی از اتفاقاتی که زمان حذف پکیج رخ می دهد ارائه می کند. پیشنهاد می شود که قبل از حذف پکیج از این گزینه استفاده کرده (و در صورت تمابل نسبت به pipe کردن خروجی به ابزار less اقدام کنید) تا از پشتیبان گیری از موارد مهم اطمینان حاصل نمائید.

source: When removing a package, it's original file index will be moved from /var/log/packages to /var/log/removed_packages. Likewise, it's installation script will be moved from /var/log/scripts to /var/log/removed_scripts.
fa: به هنگام حذف یک پکیج، فایل ایندکس آن از مسیر var/log/packages/ به دایرکتوری var/log/removed_packages/ منتقل خواهد شد. همچنین، اسکریپت نصب آن از var/log/scripts/ به var/log/removed_scripts/ منتقل می شود.

source: B<-warn packagename>
fa: B<-warn پکیج>

source: Generate a report to the standard output about which files and directories would be removed, but does not actually remove the package.
fa: گزارشی در خروجی استاندارد درباره فایلها و دایرکتوریهایی که در صورت حذف بکیج حذف خواهند شد تولید می کند، اما پکیج را حذف نمی کند.

source: B<-preserve packagename>
fa: B<-preserve پکیج>

source: If specified, the complete package subtree is reconstructed in /var/log/setup/tmp/preserved_packages/packagename.
fa: با انتخاب این گزینه زیرشاخه کامل پکیج در این مسیر ساخته می شود: "پکیج/var/log/setup/tmp/preserved_packages/"

source: B<-copy packagename>
fa: B<-copy پکیج>

source: Construct a copy of the package under /var/log/setup/tmp/preserved_packages/packagename, but don't remove it. (same effect as -warn -preserve)
fa: در دایرکتوری "نام پکیج/var/log/setup/tmp/preserved_packages/" یک پکیج ایجاد می کند اما پکیج را حذف نمی کند (نظیر استفاده از گزینه ترکیبی warn -preserve-)

source: Save the intermediate files created by removepkg (delete_list, required_files, uniq_list, del_link_list, required_links, required_list). Mostly useful for debugging purposes.
fa: فایلهای بینابینی زیر که بوسیله removepkg ساخته می شوند، ذخیره می کند (این عمل به ویژه برای فرایندهای عیب یابی مفید است): delete_list, required_files, uniq_list, del_link_list, required_links, required_list

source: It's possible to remove a package from a filesystem other than / by supplying B<removepkg> with a B<ROOT> environment variable:
fa: حذف یک پکیج از فایل سیستمی غیر از / بوسیله تنظیم متغیر محیطی ROOT برای ابزار removepkg امکان پذیر است:

source: B<ROOT=/mnt removepkg package>
fa: B<ROOT=/mnt removepkg پکیج>

source: AUTHORS
fa: نویسندگان

source: Patrick J. Volkerding E<lt>volkerdi@slackware.comE<gt>, with enhancements by Christian Franke E<lt>c.franke@acm.orgE<gt>
fa: Patrick J. Volkerding E<lt>volkerdi@slackware.comE<gt>, با همکاری Christian Franke E<lt>c.franke@acm.orgE<gt>

source: 31 May 2002
fa: ۳۱ می ۲۰۰۲

source: upgradepkg - upgrade Slackware packages.
fa: ؛ upgradepkg ؛ ارتقاء دهنده پکیج های اسلکور

source: B<upgradepkg> upgrades a Slackware package from an older version to a newer one. It does this by B<INSTALLING> the new package onto the system, and then B<REMOVING> any files from the old package that aren't in the new package. If the old and new packages have the same name, a single argument is all that is required. If the packages have different names, supply the name of the old package followed by a percent symbol (%), then the name of the new package. Do not add any extra whitespace between pairs of old/new package names.
fa: ابزار B<upgradepkg> یک پکیج اسلکور را از نسخه قدیمی تر به نسخه جدیدتر بروزرسانی می کند. این ابزار این کار را بوسیله B<نصب> پکیج جدید و B<حذف> فایلهای پکیج قدیمی که در پکیج جدید وجود ندارند انجام می دهد. اگر پکیج های جدید و قدیمی نام مشابهی داشته باشند، یک شناسه تنها چیزی است که مورد نیاز است. اگر پکیج ها دارای نام متفاوت باشند, ابتدا نام پکیج قدیمی سپس علامت درصد (%) و سپس نام پکیج جدید را وارد کنید. هیچ فاصله ای میان نام پکیج های جدید و قدیمی نباید وجود داشته باشد.

source: If upgradepkg finds more than one installed package matching the old package's name, it will remove them all.
fa: اگر upgradepkg بیش از یک پکیج با نام پکیج قدیمی روی سیستم پیدا کند، تمام آنها را حذف خواهد کرد.

source: To upgrade in a directory other than / (such as /mnt):
fa: برای بروزرسانی پکیج ها در یک دایرکتوری به جز / (نظیر mnt/) از فرمان زیر استفاده کنید:

source: ROOT=/mnt upgradepkg package.tgz (or .tbz, .tlz, .txz)
fa: ROOT=/mnt upgradepkg پکیج.tgz (.tbz و .tlz ،.txz یا)
