Repository: DidierSpaier/slint-website
Catalog: old/po/*.slackpkg.po
Languages: fa

source: May 2010
fa: می ۲۰۱۰

source: NAME
fa: نام

source: B<slackpkg> - Automated tool for managing Slackware Linux packages
fa: ؛ B<slackpkg> - ابزار اتوماتیک برای مدیریت پکیج های اسلکور لینوکس ؛

source: SYNOPSIS
fa: اختصار

source: B<slackpkg> B<[OPTIONS]> B<{install|remove|search|upgrade|reinstall|blacklist}> B<{>I<PATTERN>B<|>I<FILE>B<}>
fa: B<slackpkg> B<[گزینه ها]> B<{install|remove|search|upgrade|reinstall|blacklist}> B<{>I<فایل>B<|>I<الگو>B<}>

source: B<slackpkg [OPTIONS] {clean-system|upgrade-all|install-new}>
fa: B<slackpkg [گزینه ها] {clean-system|upgrade-all|install-new}>

source: B<slackpkg> B<[OPTIONS]> B<{search|file-search}> B<{>I<PATTERN>B<|>I<FILE>B<}>
fa: B<slackpkg> B<[گزینه ها]> B<{search|file-search}> B<{>I<فایل>B<|>I<الگو>B<}>

source: B<slackpkg> B<[OPTIONS]> B<{generate-template|install-template|remove-template}> I<TEMPLATENAME>
fa: B<slackpkg> B<[گزینه ها]> B<{generate-template|install-template|remove-template}> I<قالب>

source: B<slackpkg [OPTIONS] info> I<PACKAGE>
fa: B<slackpkg [گزینه ها] info> I<پکیج>

source: B<slackpkg [OPTIONS] update [gpg]>
fa: B<slackpkg [گزینه ها] update [gpg]>

source: B<slackpkg [OPTIONS] {new-config|check-updates}>
fa: B<slackpkg [گزینه ها] {new-config|check-updates}>

source: B<slackpkg [OPTIONS] help>
fa: B<slackpkg [گزینه ها] help>

source: DESCRIPTION
fa: توصیف

source: Slackpkg is a tool for those who want to easily install or upgrade packages via the network. With slackpkg, you can have a minimal installation of Slackware Linux and install/upgrade only those packages you need most.
fa: فرمان slackpkg یک ابزار برای کسانی است که می خواهند به راحتی از طریق شبکه پکیج ها را نصب کنند و یا ارتقا دهند. با استفاده از این ابزار شما می توانید اسلکور را به صورت حداقلی نصب کرده و صرفا پکیج هایی را نصب کرده و یا ارتقاء دهید که به آنها بیشتر نیاز دارید.

source: You don't need to setup NFS or make dozens of CDs for all your computers; all you need to do is to type one command and all of the latest official Slackware packages will be at your fingertips.
fa: شما نیاز به تنظیم فایل سیستم شبکه (NFS) و یا ساخت تعداد زیادی CD برای تمام کامپیوترهایتان ندارید. آنچه نیاز دارید تنها تایپ یک فرمان است تا آخرین نسخه پکیج های رسمی اسلکور در اختیار شما باشد.

source: INSTRUCTIONS
fa: راهنما

source: Slackpkg has many features. It can search for specific files, remove all third-party packages in your system, install packages added to Slackware since your last update, show package descriptions, etc.
fa: ابزار Slackpkg امکانات زیادی دارد. می تواند فایل خاصی را جستجو کند، تمام پکیج های غیررسمی را از سیستم شما حذف کند، تمام پکیج های اضافه شده به اسلکور پس از آخرین بروزرسانی را روی سیستم نصب کند، توصیف پکیج را نمایش دهد و غیره.

source: Before you do anything, you will need to uncomment one mirror in /etc/slackpkg/mirrors file and run:
fa: قبل از اینکه عملی انجام دهید, باید یکی از مخازن واقع در فایل موجود در مسیر etc/slackpkg/mirrors/ بدون علامت کرده (علامت # را از جلوی آینه مورد نظرتان حذف کرده) و فرمان زیر را اجرا کنید:

source: The "update" action will download and format the list of files and packages in Slackware. Every time this list is changed, the update need to be run.
fa: عملیات "update" لیست فایلها و پکیج ها را در اسلکور دانلود و فرمت می کند. هر زمانی که این لیست تغییر کند لازم است که update دوباره اجرا شود.

source: The main features of Slackpkg are the ones directly related to package management: install, upgrade, and remove packages. To do any of these tasks, the Slackpkg syntax is:
fa: مهمترین خصوصیات slackpkg آنهایی هستند که مستقیما به مدیریت پکیج ها مربوط هستند: نصب، ارتقاء و حذف پکیج ها. برای انجام هرکدام از این موارد، فرمان slackpkg به صورت زیر می باشد:

source: I<OPTIONS> can be one or more of the many configuration options listed in /etc/slackpkg/slackpkg.conf. There are equivalent command line options for most of the configuration directives found in slackpkg.conf - see the B<slackpkg.conf(5)> man-page to see what options are available.
fa: I<گزینه ها> (OPTIONS) می تواند شامل یک یا چند گزینه پیکربندی لیست شده در فایل موجود در مسیر etc/slackpkg/slackpkg.conf/ باشد. گزینه های خط فرمان مشابهی برای فرمانهای پیکربندی در فایل slackpkg.conf یافت می شود. برای مشاهده لیست گزینه های موحود به صفحه راهنمای B<slackpkg.conf> مراجعه کنید.

source: I<PATTERN> can be a package name or just part of package name. It can also be a software series (like kde, a, ap, ...).
fa: I<الگو> (PATTERN) می تواند نام یک پکیج یا فقط بخشی از نام پکیج باشد. همچنین می تواند نام سری نرم افزاری (نظیر kde ،a ،ap و غیره) باشد.

source: I<FILE> is a file with a list of I<PATTERNs> inside: either one per line, or several per line with spaces as separators.
fa: I<فایل> (FILE) نام فایلی است که لیستی از I<الگوها> در آن چه به صورت یک الگو در هر سطر و چه به صورت چند الگو در هر سطر که بوسیله فاصله از هم جدا شده اند، قرار دارد.

source: Slackpkg can be used to upgrade the whole distribution.
fa: ابزار Slackpkg می تواند برای ارتقاء تمام سیستم عامل مورد استفاده قرار گیرد.

source: The usual way is to do:
fa: روش معمول عبارت است از:

source: Another feature of Slackpkg is the ability to work with templates, which can make it much easier to create different machines with the same contents of packages. The basic steps are as follows:
fa: خصوصیت دیگر Slackpkg توانایی کار با قالب هاست که ایجاد سیستم هایی با پکیج های یکسان را امکان پذیر می سازد. مراحل اصلی کار عبارتند از:

source: Install one machine
fa: نصب به روی یک سیستم

source: Run "slackpkg generate-template TEMPLATENAME"
fa: اجرای فرمان "قالب slackpkg generate-template"

source: Copy /etc/slackpkg/templates/TEMPLATENAME.template to the same directory on the other machine
fa: کپی کردن "template.قالب/etc/slackpkg/templates/" در همان دایرکتوری در سیستم دیگر

source: Run "slackpkg install-template TEMPLATENAME" on the other machine
fa: اجرای فرمان "قالب slackpkg install-template" در سیستم دیگر

source: I<TEMPLATENAME> is the name of your template.
fa: I<قالب> همان نام قالب مورد استفاده شماست.

source: Following this manual page, you can find what each of these (and other) actions does.
fa: با استفاده از این صفحه راهنما، شما می توانید بفهمید که هر کدام از این (و دیگر) گزینه ها چه عملی انجام می دهند.

source: ACTIONS
fa: عملیاتها

source: Show slackpkg's actions and a short description of them. Useful if you need to know a little about slackpkg. The information here, on man-page is much more complete.
fa: عملیاتهای slackpkg و توصیف کوتاهی از آنها را نمایش می دهد. اگر بخواهید اطلاعات مختصری از slackpkg بدست آورید مفید است. اطلاعات ارائه شده در اینجا (صفحه راهنما) بسیار کاملتر است.

source: update will download the latest package lists from a Slackware mirror (or your CD). It's a good idea to run
fa: آخرین لیست پکیج ها را از یک مخزن اسلکور (یا CD شما) دانلود می کند. اجرای این فرمان:

source: before attempting to upgrade, install, or search for packages.
fa: قبل از تلاش برای ارتقاء، نصب و یا جستجوی پکیج ها ایده خوبیست.

source: If you need to update Slackware's GPG key, run
fa: اگر نیاز دارید که کلید GPG اسلکور را بروزرسانی کنید فرمان زیر را اجرا کنید:

source: The GPG key doesn't change. This should be a "one time" command - run it once and forget it...
fa: کلید GPG تغییر نمی کند. بنابراین این یک فرمان یکبار مصرف است. آن را یکبار اجرا کرده و فراموش کنید...

source: Verify if there is any update to ChangeLog.txt. This is good to be used from cron to alert the sysadmin about updates.
fa: مشخص می کند که آیا بروزرسانی در Changelog.txt وجود دارد یا خیر. خوب است که این فرمان از cron اجرا شود تا مدیر سیستم را درباره بروزرسانیها آگاه کند.

source: You can search the official Slackware packages for any file in the Slackware distribution. Do you need a strange library? Use file-search to find it.
fa: شما می توانید پکیج های رسمی اسلکور را برای هر فایلی در توزیع اسلکور مورد جستجو قرار دهید. آیا به دنبال یک کتابخانه ناآشنا هستید؟ از file-search برای پیدا کردن آن استفاده کنید.

source: # slackpkg file-search filename
fa: # slackpkg file-search فایل

source: All packages with matching "filename" will be shown, thus you can see whether the packages are installed or not; if not, you can download and install them with other slackpkg actions.
fa: تمام پکیج هایی که با کلمه "فایل" مطابقت داشته باشند، نمایش داده خواهند شد. بنابراین می توانید ببینید که آیا پکیج نصب شده یا خیر؛ در صورت عدم نصب، شما می توانید با استفاده از دیگر عملیات slackpkg آنها را دانلود و نصب کنبد.

source: You can search for any package distributed in Slackware.
fa: شما می توانید تمام پکیج های توزیع شده در اسلکور را مورد جستجو قرار دهید.

source: # slackpkg search pattern
fa: # slackpkg search الگو

source: All packages names that matches with "pattern" will be shown. Like file-search, you can see whether the packages are installed or not; if not, you can download and instll them with other slackpkg actions.
fa: تمام پکیج هایی که نام آنها با "الگو" مطابقت داشته باشد نمایش داده خواهند شد. همانند file-search شما می توانید مشاهده کنید که آیا پکیج نصب است و اگر نصب نیست آن را بوسیله دیگر عملیات دانلود و نصب کنید.

source: Installation of a package is very simple. You need only type:
fa: نصب یک پکیج بسیار ساده است. شما تنها نیاز به تایپ فرمان

source: # slackpkg install package
fa: # slackpkg install پکیج

source: and the package will be downloaded and installed.
fa: دارید که پکیج را دانلود و نصب می کند.

source: You can't use the "install" option to install an already installed package, but you may reinstall or upgrade it.
fa: شما نمی توانید از گزینه install برای نصب پکیجی که از قبل روی سیستم نصب شده استفاده کنید، اما می توانید آن را بازنصب کرده و یا ارتقاء دهید.

source: upgrade installs the most recent official version of the specified package(s).
fa: جدیدترین نسخه پکیج یا پکیج های رسمی مشخص شده را نصب می کند

source: upgrade will not attempt to install new packages (use the install function for that purpose; the latest official version of the package will be installed).
fa: فرمان upgrade برای نصب پکیج های جدید تلاش نمی کند (برای این منظور از دستور install استفاده کنید که باعث نصب آخرین نسخه رسمی پکیج می شود).

source: In case you mistakenly corrupt something, the reinstall option will allow you to reinstall the same version of a package that is currently installed.
fa: اگر به اشتباه چیزی را خراب کرده باشید، گزینه reinstall به شما اجازه می دهد تا نسخه مشابه پکیجی که قبلا نصب شده است را بازنصب کنید.

source: With remove, you can remove certain installed packages. As an example:
fa: با remove شما می توانید پکیج های نصب شده مشخصی را حذف کنید. در مثال زیر:

source: will remove all packages with "kde" in their name.
fa: تمام پکیج هایی که عبارت "kde" در نام آنها وجود دارد، حذف خواهند شد.

source: With this action, you can "blacklist" certain packages.
fa: با این عملیات، شما می توانید پکیج های خاصی را وارد لیست سیاه کنید.

source: Blacklisted packages will not be installed, upgraded, or removed by slackpkg. If you want to remove some package from the black list, please edit /etc/slackpkg/blacklist.
fa: پکیج هایی که وارد لیست سیاه شده اند بوسیله slackpkg نصب، ارتقاء و حذف نخواهند شد. اگر می خواهید برخی پکیج ها را از لیست سیاه خارج کنید، فایل واقع در مسیر etc/slackpkg/blacklist/ را تدوین کنید.

source: This action tells slackpkg to download the packages, but not to install them. They will be placed in /var/cache/packages, and you can install/upgrade/reinstall them later (or burn them to CD).
fa: با استفاده از این گزینه slackpkg پکیج را دانلود می کند اما آن را نصب نمی کند. پکیج های دانلود شده در مسیر var/cache/packages/ ذخیره می شوند و شما می توانید آنها را بعدا نصب کنید، ارتقاء دهید و یا بازنصب نمایید (یا حتی روی CD رایت کنید).

source: This action prints information about the package(s): compressed and uncompressed size, description, etcetera...
fa: این گزینه اطلاعاتی در مورد پکیج (ها) نظیر سایز معمولی و فشرده، توصیف و غیره ارائه می کند.

source: This action removes all of the packages that don't belong to a standard Slackware installation. With this option, you can clean up your system, removing third-party packages as well as any packages that were removed from the official Slackware package set.
fa: این عملیات تمام پکیج هایی که متعلق به نصب استاندارد اسلکور نیستند، حذف می کند. با این گزینه، شما می توانید سیستم خود را پاکسازی کرده و پکیج های غیررسمی را علاوه بر پکیج های حذف شده از سری رسمی پکیج های اسلکور (واقع در مخزن اینترنی)، حذف کنید.

source: If you have some third party (or custom built) packages that you would like to keep, you can temporarily add them to the list of blacklisted packages before you run the 'clean-system' action.
fa: اگر برخی پکیج های غیررسمی (با سفارشی شده) دارید که تمایل به نگاهداری آنها دارید، می توانید موقتا آنها را قبل از اجرای این عملیات در لیست سیاه وارد کنید.

source: This action upgrades every package installed on the system to the version in the official Slackware tree; this is the "good" way to upgrade the entire system.
fa: این عملیات تمام پکیج های نصب شده روی سیستم شما را به نسخه رسمی اسلکور ارتقاء می دهد. استفاده از این گزینه یک روش خوب برای ارتقاء کلی سیستم می باشد.

source: Remember to use the "install-new" action before you use "upgrade-all."
fa: به یاد داشته باشید که قبل از upgrade-all از install-new استفاده کنید.

source: This action installs any new packages that are added to the official Slackware package set. Run this if you are upgrading your system to another Slackware version or if you are using -current.
fa: این عملیات هر پکیج تازه ای که به سری رسمی پکیج های اسلکور اضافه شده باشد نصب می کند. اگر می خواهید سیستم اسلکور خود را به نسخه جدیدتر ارتقاء دهید و یا اگر از نسخه current- استفاده می کنید، این عملیات را اجرا کنید.

source: If you want to install all uninstalled Slackware packages onto your system, use the following command instead of the install-new action:
fa: اگر می خواهید تمام پکیج های حذف شده اسلکور را روی سیستم نصب کنید، به جای install-new از فرمان زیر استفاده کنید:

source: This action searches for .new configuration files and ask the user what to do with those files.
fa: این عملیات فایل های پیکربندی "new." را جستجو کرده و از کاربر سئوال می کند که می خواهد با آنها چه کند.

source: new-config is very useful when you perform an upgrade and leave the configuration files to be reviewed later. Instead of a manual search, diff, and replace; you can use the new-config action.
fa: new-config برای زمانی که سیستم را ارتقاء داده و فایل های پیکربندی را برای بازبینی های بعدی رها می کنید، گزینه مفیدی است. به جای جستجوی و جایگزینی دستی می توانید از new-config استفاده کنید.

source: This action creates a new template with all official packages that are installed in your system. The template is stored at /etc/slackpkg/templates
fa: این عملیات قالب جدیدی شامل تمام پکیج های رسمی اسلکور نصب شده روی سیستم شما ایجاد می کند. قالب در مسیر etc/slackpkg/templates/ ذخیره می شود.

source: This action install the required template in the system. The template must be in /etc/slackpkg/templates. If the template "includes" other templates, all of them needs to be in /etc/slackpkg/templates. You can disable the "includes" in slackpkg.conf or in command-line.
fa: این عملیات قالب درخواست شده را روی سیستم نصب می کند. قالب باید در مسیر etc/slackpkg/templates/ باشد. اگر قالب حاوی (includes) قالب های دیگر بود تمام آنها باید در مسیر etc/slackpkg/templates/ باشند. شما می توانید گزینه "includes" را در slackpkg.conf یا در خط فرمان غیرفعال کنید.

source: This action remove all packages that are part of selected template. Be careful, this can put your machine in a unusable state. The "include" handling can be activated/deactivated in slackpkg.conf or with the appropriate option in command-line.
fa: این گزینه تمام پکیج هایی که بخشی از قالب انتخاب شده هستند، حذف می کند. مراقب باشید، این گزینه می تواند سیستم شما را بلااستفاده کند. مدیریت "include" می تواند در slackpkg.conf یا بوسیله گزینه مناسب در خط فرمان فعال/غیرفعال شود.

source: FILES
fa: فایلها

source: File to specify the location from which to download packages
fa: این فایل محلی که پکیج ها باید از آنجا دانلود شوند، مشخص می کند.

source: General configuration of slackpkg
fa: فایل پیکربندی عمومی slackpkg

source: List of packages to skip
fa: فایل حاوی لیست پکیج هایی که باید نادیده گرفته شوند.

source: Contains all template files
fa: حاوی تمام فایلهای قالب ها می باشد.

source: Contains slackpkg core and additional functions
fa: شامل هسته slackpkg و کارکردهای اضافی آن می باشد.

source: Slackpkg internal use - Formatted package lists, copy of ChangeLog.txt, list of files, etcetera...
fa: شامل آیتم های مورد نیاز برای استفاده از slackpkg نظیر لیست پکیج ها، کپی فایل "ChangeLog.txt" و لیست فایل ها و غیره می باشد.

source: SEE ALSO
fa: نگاه کنید به:

source: AUTHORS
fa: نویسندگان

source: B<slackpkg.conf> - Configuration data for slackpkg
fa: ؛ B<slackpkg.conf> فایل حاوی اطلاعات پیکربندی slackpkg ؛

source: The slackpkg.conf file contains information for B<slackpkg> (8), an automated tool for managing Slackware Linux packages.
fa: فایل slackpkg.conf حاوی اطلاعاتی برای B<slackpkg> به عنوان ابزار اتوماتیک پکیج های اسلکور لینوکس می باشد.

source: The slackpkg.conf file is a sequence of shell script variables, and each variable controls one aspect of slackpkg. Comments begin with the # character and end at end of the line, and comments may appear anywhere inside the slackpkg.conf file. If some variable appears more than once in the file, slackpkg will use the value that was defined last.
fa: فایل slackpkg.conf گروهی از اسکریپت های shell است که هر متغیر آن جنبه ای از ابزار slackpkg را کنترل می کند. کامنت ها با کاراکتر # آغاز شده و با انتهای هر خط پایان می یابند. کامنت ها ممکن است در هر جای فایل یافت شوند. اگر برخی متغیرها در این فایل چندبار تکرار شوند، اسلکور از مقداری که آخر از همه تعیین شده استفاده می کند.

source: Many variables can be overridden by options passed to slackpkg on the command line. If you need to override the value of B<VARIABLE> , pass B<-variable=value> on the command line just before the slackpkg action. Multiple variables may be overridden.
fa: بسیاری از متغیرها با گزینه هایی که در خط فرمان برای slackpkg تعیین می'گردند، بی اثر می شوند. اگر می خواهید مقدار یک B<متغیر> را بی اثر کنید، در خط فرمان قبل از عملیات مورد نظر B<مقدار=متغیر> را وارد کنید. همچنین چندین متغیر می توانند به صورت همزمان بی اثر شوند.

source: EXAMPLE: slackpkg -batch=on -default_answer=y upgrade-all
fa: مثال: slackpkg -batch=on -default_answer=y upgrade-all

source: For configuration options that have only two states, possible values are either "on" or "off" unless otherwise indicated.
fa: برای گزینه های پیکربندی که تنها دو وضعیت می توانند داشته باشند، مقادیر محتمل on یا off هستند مگر اینکه مقادیر دیگری مشخص شده باشند.

source: The different configuration options are:
fa: گزینه های مختلف پیکربندی عبارتند از:

source: Chooses the system architecture. Usually Slackpkg can found the correct value using "uname -m". The valid values are:
fa: معماری سیستم را انتخاب می کند. معمولا slcakpkg می تواند مقدار درست را از طریق "uname -m" بفهمد. مقادیر معتبر عبارتند از:

source: The default value of B<ARCH> depends on your architecture.
fa: مقدار پیش فرض B<ARCH> بستگی به معماری سیستم شما دارد.

source: Slackpkg checks the package signature file (.asc) against the GPG signature of the project. Different ports of Slackware can have different signatures, and Slackpkg tries to find the correct one based on the architecture of your system. If the automatically-detected B<SLACKKEY> isn't correct, you can change it using this option.
fa: ابزار slackpkg فایل امضاء پکیج (asc.) را با امضاء GPG پروژه مطابقت می دهد. پورتهای مختلف اسلکور می توانند امضاء های مختلفی داشته باشند و slackpkg تلاش می کند که امضاء درست را براساس معماری سیستم شما تشخیص دهد. اگر B<SLACKKEY> که به صورت اتوماتیک شناسایی شده درست نباشد. شما می توانید با استفاده از این گزینه آن را تغییر دهید.

source: The default value of B<SLACKKEY> depends on your Slackware port.
fa: مقدار پیش فرض B<SLACKKEY> بستگی به پورت اسلکور شما دارد.

source: Defines the location to which slackpkg will download the packages before installing/upgrading them.
fa: محلی که slackpkg پکیج ها را قبل از نصب/ارتقاء در آنجا دانلود می کند، تعیین می نماید.

source: The default value of B<TEMP> is /var/cache/packages.
fa: مقدار پیش فرض B<TEMP> مسیر var/cache/packages/ می باشد.

source: Defines the directory for package lists, file lists, and other information used by slackpkg as it works. Do not change the value of this variable unless you know what you are doing.
fa: محل دایرکتوری لیست پکیج ها، فایلها و دیگر اطلاعات مورد نیاز برای ابزار slackpkg را مشخص می کند. تا وقتی که کاملا از کاری که می کنید مطمئن نیستید، مقدار پیش فرض این متغیر را تغییر ندهید.

source: The default value of B<WORKDIR> is /var/lib/slackpkg.
fa: مقدار پیش فرض B<WORKDIR> مسیر var/lib/slackpkg/ می باشد.

source: Selects special options for wget. If you need to use multiple options, remember to put them between double quotes.
fa: گزینه های ویژه برای wget را انتخاب می کند. اگر می خواهید که از چند گزینه استفاده کنید، آنها را مابین " " قرار دهید.

source: The default value of B<WGETFLAGS> is "--passive-ftp"
fa: مقدار پیش فرض B<WGETFLAGES> عبارت است از "passive-ftp--"

source: If set to "on", all downloaded files will be removed after slackpkg performs install or upgrade (this does NOT have any impact when slackpkg is run with "download"). If set to "off", the files will be kept in the directory defined in B<TEMP> (as described above).
fa: اگر روی "on" تنظیم شود، تمام فایلهای دانلود شده پس از نصب یا ارتقاء پکیج ها بوسیله slackpkg حذف خواهند شد (این عمل تأثیری بر عملکرد slackpkg با گزینه "download" نخواهد داشت). اگر روی "off" تنظیم شود، تمام فایلها را در مسیر تعیین شده در متغیر B<TEMP> نگاهداری خواهد کرد.

source: The default value of B<DELALL> is "on".
fa: مقدار پیش فرض B<DELALL> عبارت است از "on"

source: From command line, you can use -delall=value.
fa: از طریق خط فرمان، شما می توانید این متغیر را به صورت "مقدار=delall-" تنظیم کنید.

source: Enables (on) or disables (off) the checking of MD5 checksums of all downloaded packages before installing or upgrading them.
fa: عملیات بررسی MD5 پکیج های دانلود شده قبل از نصب و ارتقاء آنها را فعال (on) یا غیرفعال (off) می کند.

source: The default value of B<CHECKMD5> is "on".
fa: مقدار پیش فرض B<CHECKMD5> عبارت است از "on"

source: From command line, you can use -checkmd5=value.
fa: با خط فرمان می توانید مقدار این متغیر را با استفاده از "مقدار=checkmd5-" تنظیم کنید.

source: Enables (on) or disables (off) the check of GPG signature for each package before install or upgrade.
fa: بررسی امضاء GPG پکیج ها را قبل از نصب یا ارتقاء آنها فعال (on) یا غیرفعال (off) می کند.

source: The default value of B<CHECKGPG> is "on".
fa: مقدار پیش فرض برای B<CHECHGPG> عبارت است از "on"

source: From command line, you can use -checkgpg=value.
fa: تنظیم این متغیر با خط فرمان بوسیله "مقدار=checkgpg-" امکانپذیر است.

source: Enables (on) or disables (off) the check of available disk space for each package before install or upgrade.
fa: چک کردن فضای خالی موجود برای هر پکیج قبل از نصب یا ارتقاء آن را فعال (on) یا غیرفعال (off) می کند.

source: The default value of B<CHECKSIZE> is "off".
fa: مقدار پیش فرض متغیر B<CHECKSIZE> عبارت است از "off".

source: From command line, you can use -checksize=value.
fa: برای تنظیم این متغیر از خط فرمان می توانید از "مقدار=checksize-" استفاده کنید.

source: Defines the main distribution directory. Usually, you don't need to worry about this variable, as Slackpkg tries to find it based on your architecture. However, if you need to change it, then include this variable in your slackpkg.conf. This should always be the directory which contains the Slackware package set series (A, AP, D, E, F, ...).
fa: دایرکتوری اصلی توزیع را مشخص می کند. معمولا، شما نباید نگران این متغیر باشید. چون slackpkg تلاش می کند که محل دایرکتوری را براساس معماری سیستم شما بیابد. به هر حال اگر نیاز یه تغییر این دایرکتوری داشتید آن را در slackpkg.conf وارد کنید. این دایرکتوری همواره باید حاوی سریهای پکیج های اسکلور (مانند A, AP, D, E, F و غیره) باشد.
