Repository: DidierSpaier/slint-website
Catalog: old/po/*.slackpkg.po
Languages: fa

source: Default: depends on Slackware port
fa: مقدار پیش فرض بستگی به پورت اسلکور شما دارد.

source: This array selects the priority at which directories on the mirror will have when slackpkg looks for packages. If a package is found in more than one place, the package in first directory gets priority, then second, then third, then fourth and finally, the package found in last listed directory. You can use %PKGMAIN to use the contents of PKGMAIN variable.
fa: این متغیر اولویت دایرکتوریهای موجود در لینک اینترنتی را به هنگام جستجوی پکیج بوسیله slackpkg مشخص می کند. اگر یک پکیج در بیش از یک مکان یافت شد، اول پکیج موجود در دایرکتوری اول، بعد دایرکتوری دوم، سوم، چهارم و نهایتا پکیج موجود در آخرین دایرکتوری لیست شده دارای اولویت خواهند بود. شما می توانید از PKGMAIN% برای استفاده از محتویات متغیر PKGMAIN استفاده کنید.

source: Default values (in order): patches %PKGMAIN extra pasture testing
fa: مقادیر پیش فرض (به ترتیب) عبارتند از: patches %PKGMAIN extra pasture testing

source: Enables (on) or disables (off) slackpkg's post-installation features, such as checking for new (*.new) configuration files and new kernel images, and prompts you for what it should do.
fa: اقدامات پس از نصب پکیج ها توسط slackpkg نظیر جستجوی فایل پیکربندی و ایمیج کرنل جدید را فعال (on) یا غیرفعال (off) کرده و در خصوص اقدامات بعدی از شما سئوال می کند.

source: The default value of B<POSTINST> is "on".
fa: مقدار پیش فرض متغیر B<POSTINST> عبارت است از "on"

source: From command line, you can use -postinst=value.
fa: از طریق خط فرمان شما می توانید از "مقدار=postinst-" استفاده کنید.

source: When B<POSTINST> is set to "on", slackpkg will search for all .new files inside /etc and prompt the user for what to do with them. However, some users prefer to see only the .new files installed in slackpkg's last execution, so if this applies to you, set B<ONLY_NEW_DOTNEW> to "on".
fa: زمانی که B<POSTINST> روی "on" تنظیم شود، slackpkg تمام فایلهای "new." را در مسیر etc/ جستجو کرده و به کاربر هشدار می دهد که با آنها چه کند. به هر حال، برخی ترجیح می دهند که نصب فایلهای "new." را در آخرین مرحله اجرای slackpkg انجام دهند، پس اگر شما هم تمایل به اینکار دارید، مقدار B<ONLY_NEW_DOTNEW> را روی "on" تنظیم کنید.

source: The default value of B<ONLY_NEW_DOTNEW> is "off". Only change this if you know what are you doing...
fa: مقدار پیش فرض B<ONLY_NEW_DOTNEW> روی "off" تنظیم شده است. تنها زمانی آن را تغییر دهید که بدانید چه دارید می کنید...

source: From command line, you can use -only_new_dotnew=value.
fa: از طریق خط فرمان، شما می توانید از "مقدار=only_new_dotnew-" استفاده کنید.

source: The B<ONOFF> variable sets the initial behavior of the dialog interface. If you set this to "on" then all packages will be selected by default. If you prefer the opposite option (all unchecked), then set this to "off".
fa: متغیر B<ONOFF> رفتار ابتدایی رابط کاربری مبتنی بر دیالوگ را تنظیم می کند. اگر روی "on" تنظیم شود، تمام پکیج ها به صورت پیش فرض انتخاب می شوند. اگر تمایل به انتخاب مقدار مخالف دارید (هیچ پکیجی انتخاب شده نباشد)، آن را روی "off" تنظیم کنید.

source: The default value of B<ONOFF> is "on".
fa: مقدار پیش فرض B<ONOFF> روی "on" تنظیم شده است.

source: From command line, you can use -onoff=value.
fa: برای خط فرمان می توانید از "مقدار=onoff-" استفاده کنید.

source: If this variable is set to "on", all files will be downloaded before the requested operation (install or upgrade) is performed. If set to "off", then the files will be downloaded and the operation (install/upgrade) performed one by one.
fa: اگر این متغیر روی "on" تنظیم شود، تمام فایلها قبل از اجرای عملیات مورد نیاز (نصب یا ارتقاء) دانلود می شوند. اگر روی "off" تنظیم شود، فرایند دانلود و نصب/ارتقاء هر فایل یکی پس از دیگری انجام می شود.

source: The default value of B<DOWNLOAD_ALL> is "off".
fa: مقدار پیش فرض B<DOWNLOAD_ALL> عبارت است از "off"

source: From command line, you can use -download_all=value.
fa: برای خط فرمان می توانید از "مقدار=download_all-" استفاده کنید.

source: Enables (on) or disables (off) the dialog interface.
fa: رابط کاربری مبتنی بر دیالوگ را فعال (on) یا غیرفعال (off) می کند.

source: The default value of B<DIALOG> is "on".
fa: مقدار پیش فرض متغیر B<DIALOG> عبارت است از "on"

source: From command line, you can use -dialog=value.
fa: برای خط فرمان می توانید از "مقدار=dialog-" استفاده کنید.

source: Set the max number of characters that will be send to "dialog". If this number is reached in upgrade, slackpkg removes the information about current installed version of each package. If even without this information the number is reached again, slackpkg returns an error to the user.
fa: تعداد حداکثر کاراکترهایی که به دیالوگ فرستاده خواهند شد تنظیم می کند. اگر فرایند ارتقاء به این عدد برسد، slackpkg اطلاعات مربوط به پکیج هایی که در حال حاضر روی سیستم نصب شده اند پاک می کند. حتی اگر بدون این اطلاعات این عدد دوباره بدست آید، slackpkg یک پیغام خطا به کاربر نشان می دهد.

source: If B<DIALOG_MAXARGS> is unset, 19500 is the default value.
fa: اگر B<DIALOG_MAXARGS> تنظیم نشود، مقدار پیش فرض آن "19500" می باشد.

source: From command line, you can use -dialog_maxargs=value.
fa: برای خط فرمان می توانید از "مقدار=dialog_maxargs-" استفاده کنید.

source: Enables (on) or disables (off) the non-interactive mode. When run in batch mode, slackpkg will not prompt the user for anything; instead, all questions will get B<DEFAULT_ANSWER> (see below).
fa: حالت غیرتعاملی را فعال (on) یا غیرفعال (off) می کند. زمانیکه روی مقدار "on" تنظیم شود، slackpkg هیچ هشداری به کاربر نداده و پاسخ تمام سئوالها را از B<DEFAULT_ANSWER> بدست می آورد (به پائین مراجعه کنید)

source: If you perform an upgrade using this mode, you will need to run "slackpkg new-config" later to find and merge .new files.
fa: اگر با استفاده از این حالت عملیات ارتقاء را انجام دهید، شما نیاز دارید بعدا فرمان "slackpkg new-config" را برای جستجو و ادغام فایلهای "new." اجرا کنید.

source: The default value of B<BATCH> is "off".
fa: مقدار پیش فرض B<BATCH> عبارت است از "off"

source: From command line, you can use -batch=value.
fa: برای خط فرمان می توانید از "مقدار=batch-" استفاده کنید.

source: This is the default answer to questions when slackpkg prompts the user for some information. This is used only in non-interactive mode (when B<BATCH> is "yes" or the user turns batch mode on via the command line); otherwise, this variable has no effect.
fa: این متغیر همان پاسخ پیش فرضی سئوالاتی است که slackpkg برای برخی اطلاعات از کاربر می پرسد. این متغیر تنها زمانی که از حالت غیرتعاملی استفاده شود (زمانی که B<BATCH> روی مقدار "yes" تنظیم شود و یا حالت batch از طریق خط فرمان روشن شود)، مورد استفاده قرار می گیرد. در غیر اینصورت این متغیر هیچ اثری نخواهد داشت.

source: Valid values are "y" or "n".
fa: مقادیر معتبر "y" یا "n" هستند.

source: The default value of B<DEFAULT_ANSWER> is "n".
fa: مقدار پیش فرض B<DEFAULT_ANSWER> روی "n" تنظیم شده است

source: From command line, you can use -default_answer=value.
fa: برای خط فرمان می توانید از "مقدار=default_answer-" استفاده کنید.

source: Slackpkg templates can include other templates. This reduces the package duplication in many templates, but it can be a problem if you want to remove only a specific template. You can disable the #include parsing by setting this option to "off".
fa: قالبهای slackpkg می توانند شامل قالبهای دیگر باشند. گرچه این عمل باعث عدم تکرار پکیج در بسیاری از قالبها می شود، اما اگر بخواهید تنها یک قالب مخصوص را حذف کنید. می تواند مشکل ساز شود. شما می توانید گزینه "include#" را با تنظیم این متغیر روی "off" غیرفعال کنید.

source: The default value of B<USE_INCLUDES> is "on".
fa: مقدار پیش فرض B<USE_INCLUDES> روی "on" تنظیم شده است.

source: From command line, you can use -use_includes=value.
fa: برای خط فرمان می توانید از "مقدار=use_includes-" استفاده کنید.

source: When Slackpkg is doing an activity that takes some time, it gives visual feedback with a spinning bar. If you don't like the spinning bar, it can be disabled by setting this option to "off".
fa: وقتی slackpkg یک کار زمانبر انجام می دهد، یک بازخورد تصویری به صورت یک میله چرخان نمایش می دهد. اگر میله چرخان را دوست ندارید، می توانید آن را با تنظیم این متغیر روی "off" غیرفعال کنید.

source: The default value of B<SPINNING> is "on".
fa: مقدار پیش فرض B<SPINNING> روی "on" تنظیم شده است.

source: From command line, you can use -spinning=value.
fa: برای خط فرمان می توانید از "مقدار=spinning-" استفاده کنید.
