Repository: DidierSpaier/slint-website
Catalog: old/po/tools/tools.*.po
Languages: de, es, fr, pt_pt, ru, tr

source: Images: image:filename[caption] (inline image) image::filename[caption] (block image)
de: Bilder: image:dateiname[titel] (Inline-Bild) image::dateiname[titel] (Block-Bild)
es: Imágenes: image:archivo[título] (imagen en línea) image::archivo[título] (imagen en bloque)
fr: Images : image:nomdefichier[légende] (image en ligne) image::nomdefichier[légende] (image dans un contexte de bloc)
pt_pt: Imagens: image:filename[caption] (imagem em linha) image::nomedeficheiro[título] (bloco de imagem)
ru: Изображения: image:filename[заголовок] (встроенное изображение) image::filename[заголовок] (блок с изображением)
tr: Resimler: image:dosyaadı[başlık] (satıriçi resim) image::dosyaadı[başlık] (blok resim)
