Repository: DidierSpaier/slint-website
Catalog: old/po/tools/tools.*.po
Languages: de, es, fr, pt_pt, ru, tr

source: This compressed archive includes all that is needed to build slint products as well as tools intended for slint contributors. It is named slint-[date].tar.xz and provided in directory https://slint.fr/pub[pub/].
de: Dieses komprimierte Paket enthält alles Nötige um Slint-Produkte wie Werkzeuge zu erstellen die den Slint-Mitwirkenden dienen. Das Archiv heißt slint-[Datum].tar.xz und ist im Verzeichnis https://slint.fr/pub[pub/] verfügbar.
es: Este archivo comprimido incluye todo lo necesario para construir productos slint así como herramientas diseñadas para los colaboradores de slint. Se llama slint-[fecha].tar.xz y se ubica en el directorio https://slint.fr/pub[pub/].
fr: Cette archive comprimée inclut tout ce qui est nécessaire pour constituer les produits Slint ainsi que des outils destinés aux contributeurs. Il est nommé slint-[date].tar.xz et fourni dans le répertoire https://slint.fr/pub[pub/].
pt_pt: Este ficheiro compactado inclui tudo o que é necessário para construir produtos slint, bem como ferramentas destinadas a contribuidores slint. É nomeado Slint-[data].tar.xz e fornecido no diretório https://slint.fr/pub[pub/].
ru: Этот сжатый архив содержит все необходимое для создания продуктов slint, как и инструменты для участников slint. Он называется slint-[дата].tar.xz и находится в каталоге https://slint.fr/pub[pub/].
tr: Bu sıkıştırılmış arşiv slint ürünleri inşasında gerekli olan herşeyin yanında slint katkı vericileri için araçlar da bulunur. slint-[date].tar.xz ismindedir ve https://slint.fr/pub[pub/] dizini içinde bulunur.

source: To unpack it, type:
de: Um es zu entpacken, geben Sie folgendes ein:
es: Para descomprimirlo, escriba:
fr: Pour la déballer, taper :
pt_pt: Para descompactá-lo, escreva:
ru: Для его распаковки наберите:
tr: Paketi açmak için yazınız:

source: tar xf slint-[date].tar.xz
es: tar xf slint-[fecha].tar.xz
ru: tar xf slint-[дата].tar.xz

source: This will output a directory slint-[date]. See file CONTENT.TXT in it for details, table below only lists scripts used to build slint products, and tools intended for translators. All paths indicated are relative to that directory.
de: Das Archiv wird in das Verzeichnis slint-[Datum] entpackt. Für mehr Details lesen Sie die CONTENT.TXT. In der unteren Tabelle werden nur Skripts aufgelistet, die für die Erstellung von Slint-Produkten gebraucht werden und Werkzeuge für Übersetzer. Alle aufgelisteten Pfade haben einen relativen Bezug zu diesem Verzeichnis.
es: Este comando generará un directorio slint-[fecha]. Vea el archivo CONTENT.TXT para los detalles, la tabla abajo solo lista los scripts usados para construir los productos slint, y las herramientas diseñadas para los traductores. Todas las rutas indicadas son relativas a este directorio.
fr: Cela créera un répertoire slint-[date]. Voir dans celui-ci le fichier CONTENT.TXT pour les détails, le tableau ci-dessous liste seulement les scripts utilisés pour constituer les produits Slint ainsi que les outils destinés aux traducteurs.
pt_pt: Este comando irá criar um diretório slint-[data]. Ver ficheiro CONTENT.TXT para mais detalhes, a tabela abaixo apenas mostra os scripts usados ​​para construir produtos slint e ferramentas destinadas a tradutores. Todos os caminhos indicados são relativos a esse diretório.
ru: Появится каталог slint-[дата]. Смотрите файл CONTENT.TXT в нем для более подробной информации, таблица ниже только приводит сценарии, используемые для создания продуктов slint и инструменты для переводчиков. Все пути указаны относительно этого каталога.
tr: slint-[tarih] dizini çıkaracaktır. Detaylar için CONTENT.TXT dosyasına bakınız, aşağıdaki tablo sadece slint ürünleri inşasında kullanılan betikleri ve çevirmenlerin kullanımı için araçları listeler.

source: |Script name and location|Purpose |build/slint.sh |Make hybrid (CD/DVD or USB) image of slackware installer or of a Slackware distribution including it |build/make_slint_packages |Internationalize some Slackware packages and build package SlintLocales. |build/slintLocales |Make a package including all up to date translations of Slackware scripts included in Slint installers (all versions) or in tools intended for Slackware. |tools_for_translators/toolbox.sh |This toolbox manage translations of messages gathered in slackware.pot. |tools_for_translators/toolbox_slint_sh |This toolbox manage translations of messages output of script slint.sh . |tools_for_translators/generate_man_pages |Generate localized man pages for some tools intended for Slackware. This allows to check PO files. Usage of this script requires to have installed package po4a, available in directory https://slint.fr/packages/extra[extra/].
de: |Name und Ort des Skripts|Funktion |build/slint.sh |Erstellen hybrider (CD-/DVD- oder USB-) Abbilder, die den Slackware-Installer oder eine Slackware-Distribution beinhalten |build/make_slint_packages |Internationalisieren einiger Slackware-Pakete und Erstellen des Pakets SlintLocales. |build/slintLocales |Erstellen eines Pakets, das alle aktuellen Übersetzungen von Slackware-Skripts enthält, inklusive des Slint-Installers (alle Versionen) und Werkzeuge für Slackware. |tools_for_translators/toolbox.sh |Diese Werkzeugkiste verwaltet Übersetzungen und Texte in der Datei slackware.pot. |tools_for_translators/toolbox_slint_sh |Diese Werkzeugkiste verwaltet Übersetzungen und Textausgaben des Skripts slint.sh . |tools_for_translators/generate_man_pages |Erstellen lokalisierter Handbuchseiten für spezielle Werkzeuge von Slackware. Erlaubt das Prüfen von PO-Dateien. Die Benutzung dieses Skripts erfordert die Installation des Pakets po4a, zu finden unter https://slint.fr/packages/extra[extra/] .
es: |Nombre del script y ubicación|Propósito |build/slint.sh |Crear una imagen híbrida (CD/DVD o USB) del instalador Slackware o de una distribución Slackware que lo incluya |build/make_slint_packages |Internacionalizar algunos paquetes de Slackware y construye el paquete SlintLocales. |build/slintLocales |Crea un paquete incluyendo todas las traducciones actualizadas de los scripts de Slackware incluidos en los instaladores de Slint (todas las versiones) o en herramientas diseñadas para Slackware |tools_for_translators/toolbox.sh |Esta herramienta maneja traducciones de mensajes contenidos en slackware.pot |tools_for_translators/toolbox_slint_sh |Esta herramienta maneja traducciones de la salida de los mensajes del script slint.sh. |tools_for_translators/generate_man_pages |Genera páginas de manual localizadas para algunas herramientas de Slackware. Esto permite revisar archivos PO. El uso de este script requiere haber instalado el paquete po4a, disponible en el directorio https://slint.fr/packages/extra[extra/].
fr: |Chemin et nom du script|Fonction |build/slint.sh |Produire une image hybride (CD/DVD ou USB) d'un installateur Slint ou d'une distribution Slackware l'incluant |build/make_slint_packages |Internationaliser quelques scripts Slackware et construire le paquet SlintLocales. |build/slintLocales |Construire un paquet contenant toutes les traductions à jour des scripts contenus dans les installateurs Slint (toutes versions) ou dans des outils destinés à Slackware. |tools_for_translators/toolbox.sh |Cette boite à outils gère les traductions des messages rassemblés dans slackware.pot. |tools_for_translators/toolbox_slint_sh |Cette boite à outils gère les traductions des messages émis par le script slint.sh. |tools_for_translators/generate_man_pages |Génère des pages de manuels traduites pour quelques-uns des outils destinés à Slackware. Ceci permet de vérifier les fichiers PO correspondants. L'emploi de ce script nécessite d'avoir installé le paquet po4a, disponible dans le répertoire https://slint.fr/packages/extra[extra/].
pt_pt: |Script nome e localização|Objetivo |build/slint.sh |Cria uma imagem híbrida (CD/DVD ou USB) do instalador Slackware ou de uma distribuição Slackware que o inclua. |build/make_slint_packages |Internacionaliza alguns pacotes do Slackware e constrói o pacote SlintLocales. |build/slintLocales |Cria um pacote incluindo todas as traduções atualizadas dos scripts do Slackware incluídos nos instaladores Slint (todas as versões) ou em ferramentas destinadas para Slackware. |tools_for_translators/toolbox.sh |Esta ferramenta gere traduções de mensagens reunidas em slackware.pot. |tools_for_translators/toolbox_slint_sh |Esta ferramenta gere traduções de mensagens de saída do script slint.sh . |tools_for_translators/generate_man_pages |Gera páginas de manual localizadas para algumas ferramentas destinadas ao Slackware. Isto permite verificar ficheiros PO. O uso deste script requer ter instalado o pacote po4a, disponível no diretório https://slint.fr/packages/extra[extra/].
ru: |Имя сценария и расположение|Назначение |build/slint.sh |Создает гибридный (CD/DVD или USB) образ установщика Slint или дистрибутив Slackware c установщиком Slint. |build/make_slint_packages |Итернационализирует разные пакеты Slackware и создает пакет SlintLocales. |build/slintLocales |Создает пакет, включающий все обновленные переводы сценариев Slackware, входящих в установщики Slint (всех версий) или инструментов для Slackware. |tools_for_translators/toolbox.sh |Этот сценарий управляет переводами сообщений, собранных в slackware.pot. |tools_for_translators/toolbox_slint_sh |Этот сценарий управляет переводами сообщений, выводимых сценарием slint.sh . |tools_for_translators/generate_man_pages |Генерирует переведенные страницы руководств для разных инструментов Slackware. Позволяет проверять PO-файлы. Использование этого сценария требует установленного пакета po4a, доступного в каталоге https://slint.fr/packages/extra[extra/].
tr: |Betik adı ve yeri|Amaç |build/slint.sh |Melez (CD/DVD veya USB) slackware kurucu kalıbı ya da Slackware dağıtımı yapar |build/make_slint_packages |Bazı Slackware paketlerini yerelleştirir ve SlintLocales paketini inşa eder. |build/slintLocales |Slint kurucular (tüm sürümler) içindeki Slackware betiklerinin ya da Slackware için olan araçların içindeki tüm güncel çevirilerini yapar. |tools_for_translators/toolbox.sh |Bu araç kutusu slackware.pot içinden elde edilen mesajların çevirilmesini yönetir. |tools_for_translators/toolbox_slint_sh |Bu araç kutusu script slint.sh çıktısı olan mesajların çevirilmesini yönetir. |tools_for_translators/generate_man_pages |Slackware de bazı araçlar için yerelleştirilmiş kılavuz sayları üretir. Bu PO dosyalarını denetlemenizi sağlar. Bu betiğin kullanımı için https://slint.fr/packages/extra[extra/] dizini içinde bulunan po4a paketi kurulu olmalıdır.

source: How-to check translations of Slackware's installer and administration scripts
de: Anleitung zum Prüfen der Übersetzung des Slackware-Installers und der Skripts für die Administration
es: Cómo revisar traducciones del instalador de Slackware y scripts de administración
fr: Comment vérifier les traductions de l'installateur de Slackware et des scripts d'administration
pt_pt: Como verificar traduções do instalador do Slackware e scripts de administração
ru: Как проверять переводы установщика Slackware и сценариев администратора
tr: Slackware'in kurucusu ve yönetim betikleri nasıl denetlenir

source: Resource https://www.transifex.com/projects/p/slint/resource/slint/[slint], file slackware.pot
de: Quelle: https://www.transifex.com/projects/p/slint/resource/slint/[Slint], Datei: slackware.pot
es: Recurso https://www.transifex.com/projects/p/slint/resource/slint/[slint], archivo slackware.pot
fr: Ressource https://www.transifex.com/projects/p/slint/resource/slint/[slint], fichier slackware.pot
pt_pt: Recurso https://www.transifex.com/projects/p/slint/resource/slint/[Slint], ficheiro slackware.pot
ru: Ресурс https://www.transifex.com/projects/p/slint/resource/slint/[slint], файл slackware.pot
tr: Kaynak https://www.transifex.com/projects/p/slint/resource/slint/[slint], dosya slackware.pot

source: When you are done with the translation, just put the file in directory wip/, (re)named e.g. as pt_BR.slackware.po, then run /path/to/tools_for_translators/toolbox.sh and choose check_PO in the menu. If all goes well:
de: Wenn Sie mit der Übersetzung fertig sind, speichern Sie die Datei im Verzeichnis wip/ ab, (um-)benannt z.B. als pt_BR.slackware.po, starten /pfad/zu/tools_for_translators/toolbox.sh und wählen im Menü "check_PO". Wenn alles funktioniert:
es: Cuando termine la traducción, solo ponga el archivo en el directorio wip/, renómbrelo como pt_BR.slackware.po, ejecute /ruta/a/tools_for_translators/toolbox.sh y seleccione check_PO en el menú. Si todo sale bien:
fr: Quand vous avez terminé la traduction, mettez simplement le fichier dans le répertoire wip/,renommé par exemple fr_FR.slackware.po, puis exécutez /chemin/vers/tools_for_translators/toolbox.sh et choisissez check_PO dans le menu. Si tout va bien :
pt_pt: Quando terminar a tradução, basta colocar o ficheiro no diretório wip/, (re)nomea-lo como pt_PT.slackware.po, depois execute /caminho/para/tools_for_translators/toolbox.sh e selecione check_PO no menu. Se tudo correr bem:
ru: Когда вы закончите перевод, поместите файл в каталог wip/, (пере)именуйте, например, в ru_RU.slackware.po, затем запустите на выполнение /path/to/tools_for_translators/toolbox.sh и выберите в меню проверить_PO. Если все идет хорошо:
tr: Çeviri ile işiniz bittiğinde, dosyayı wip/ dizini içine koyun, örn. pt_BR.slackware.po olarak (yeniden)adlandırın, sonra /path/to/tools_for_translators/toolbox.sh ı çalıştırın ve menüden check_PO yu seçin. Hepsi doğru giderse:

source: copy pt_BR.slackware.po in directory po/ (translation in Brazilian Portuguese in this example)
de: Die Datei pt_BR.slackware.po in das Verzeichnis po/ kopieren (in diesem Beispiel die Übersetzung ins brasilianisch Portugiesische)
es: copie pt_BR.slackware.po en el directorio po/ (traducción en Portugués Brasileño en este ejemplo)
fr: copiez fr_FR.slackware.po dans le répertoire po/ (traduction en Français dans cet exemple)
pt_pt: copie pt_PT.slackware.po no diretório po/ (tradução em Português de Portugal, neste exemplo)
ru: скопируйте ru_RU.slackware.po в каталог po/ (перевод на русский в этом примере)
tr: pt_BR.slackware.po yu po/ dizinine kopyalayın (bu örnekte çeviri Brezilya Portekizcesi)

source: run /path/to/build/SlintLocales.SlackBuild to include your updated translation in package SlintLocales
de: Aufruf von /pfad/zu/build/SlintLocales.SlackBuild, um die aktualisierte Übersetzung ins Paket SlintLocales einzufügen
es: ejecute /ruta/a/build/SlintLocales.SlackBuild para incluir su traducción actualizada en el paquete SlintLocales
fr: exécutez le script /chemin/vers/build/SlintLocales.SlackBuild pour inclure votre traduction à jour dans le paquet SlintLocales
pt_pt: execute /caminho/para/build/SlintLocales.SlackBuild para incluir sua tradução atualizada no pacote SlintLocales
ru: Запустите /path/to/build/SlintLocales.SlackBuild для включения обновленного перевода в пакет SlintLocales
tr: SlintLocales içine güncelleştirilmiş çevirilerinizi dahil etmek için /path/to/build/SlintLocales.SlackBuild i çalıştırın

source: run /path/to/build/slint.sh to make an hybrid CD or USB image of installer
de: Aufruf von /path/to/build/slint.sh zum Erstellen eines hybriden CD-, DVD- oder USB-Abbilds des Installers
es: ejecute /ruta/a/build/slint.sh para crear una imagen híbrida de CD o USB del instalador
fr: exécutez le script /chemin/vers/build/slint.sh pour construire une image ISO hybride CD ou USB de l'installateur
pt_pt: execute /caminho/para/construir/slint.sh para criar uma imagem hibrída USB ou CD do instalador
ru: Запустите /path/to/build/slint.sh для создания гибридного CD или USB образа установщика
tr: kurucunun melez CD ya da USB kalıbını yapmak için /path/to/build/slint.sh ı çalıştırın

source: burn the image on a CD or USB key
de: Brennen des Abbilds auf eine CD/DVD oder Erstellen eines USB-Sticks
es: grabe la imagen en un CD o dispositivo USB
fr: gravez l'image sur un CD ou une clef USB
pt_pt: gravar a imagem num CD ou numa pen USB
ru: Разверните образ на CD или USB-флешку
tr: kalıbı CD ya da USB bellek üzerine yazın

source: try the installer (in Portuguese in this case, of course), either in a virtual or a real machine
de: Testen des Installers (in unserem Beispiel natürlich auf Portugiesisch), entweder in einer virtuellen Maschine oder auf echter Hardware
es: pruebe el instalador (en Portugués en este caso, por supuesto), ya sea en una máquina virtual o una real
fr: essayez l'installateur (en Français dans cet exemple, bien sûr), dans une machine réelle ou virtuelle
pt_pt: experimente o instalador (em Português neste caso, é claro), seja numa máquina virtual ou real
ru: Попытайтесь установить (очевидно, на русском языке в данном случае), на виртуальную или реальную машину
tr: kurucuyu (bu durumda Portekizce, tabii ki) sanal ya da gerçek bir makinada deneyin

source: To run the installer in a virtual machine you can use directly the file ending in .iso as virtual media, no need to burn it on a physical media in that case.
de: Um den Installer in einer virtuellen Maschine zu starten, können Sie die Datei mit der Endung .iso direkt als virtuelles Medium nutzen, brauchen in dem Fall also kein physikalisches Medium zu nutzen.
es: Para ejecutar el instalador en una máquina virtual puede usar directamente el archivo terminado en .iso como medio virtual, no hay necesidad de grabarlo en un medio físico en este caso.
fr: pour exécuter l'installateur dans une machine virtuelle vous pouvez utiliser directement le fichier dont le nom se termine en .iso, il n'est pas nécessaire de le graver sur un support physique dans ce cas.
pt_pt: Para executar o instalador numa máquina virtual pode usar diretamente o ficheiro terminado em .iso como média virtual, não há necessidade de gravá-lo numa média física nesse caso.
ru: Чтобы запустить установщик в виртуальной машине, вы можете использовать файл .iso как виртуальный носитель, в этом случае не нужно записывать его на физический носитель.
tr: Kurucuyu sanal makinede çalıştırmak için doğrudan .iso ile biten dosyayı sanal ortam olarak kullanabilirsiniz, bu durumda bunu fiziksel bir ortama kaydetmek gerekli değildir.

source: How-to check translations of file slint.sh
de: Anleitung zum Überprüfen der Übersetzung der Datei slint.sh
es: Cómo revisar traducciones del archivo slint.sh
fr: Comment vérifier les traductions du fichier slint.sh
pt_pt: Como verificar traduções do ficheiro slint.sh
ru: Как проверять переводы файла slint.sh
tr: slint.sh dosyası çevirileri nasıl denetlenir

source: Resource https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]
de: Quelle: https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT-Datei für slint.sh]
es: Recurso https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]
fr: Ressource https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]
pt_pt: Recurso https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[ficheiro POT para slint.sh]
ru: Ресурс: https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT file for slint.sh]
tr: Kaynak https://www.transifex.com/projects/p/slint/resource/pot-file-for-slintsh/[POT dosyası slint.sh için]

source: When you are done with the translation, just put the file in directory wip/, (re)named for instance as de_DE.slint.po for German, then run /path/to/tools_for_translators/toolbox_slint_sh and choose check_PO in the menu.
de: Wenn Sie mit der Übersetzung fertig sind, speichern Sie die Datei ins Verzeichnis wip/, benennen Sie ggf. um, z.B. in de_DE.slint.po für Deutsch, starten dann /pfad/zu/tools_for_translators/toolbox_slint_sh und wählen im Menü "check_PO".
es: Cuando termine la traducción, solo ponga el archivo en el directorio wip/, renómbrelo como de_DE.slackware.po para Alemán, luego ejecute /ruta/a/tools_for_translators/toolbox_slint_sh y seleccione check_PO en el menú.
fr: Quand vous avez terminé la traduction, mettez simplement le fichier, renommé par exemple fr_FR.slint.po, dans le répertoire /wip, puis exécutez le script /chemin/vers/tools_for_translators/toolbox_slint_sh et choisissez check_PO dans le menu.
pt_pt: Quando terminar a tradução, basta colocar o ficheiro no diretório wip/, (re)nomea-lo por exemplo como de_DE.slint.po para Alemão, depois execute /caminho/para/tools_for_translators/toolbox_slint_sh e selecione check_PO no menu.
ru: Когда вы закончите перевод, поместите файл в каталог wip/, переименуйте, например, в ru_RU.slint.po для руского, затем запустите /path/to/tools_for_translators/toolbox_slint_sh и выберите в меню проверить_PO.
tr: Çeviri ile işiniz bittiğinde, dosyayı wip/ dizinine koyun, Almanca için örneğin de_DE.slint.po olarak (yeniden)adlandırın, sonra run /path/to/tools_for_translators/toolbox_slint_sh ı çalıştırıp menüden check_PO yu seçin.

source: If all goes well, run again /path/to/tools_for_translators/toolbox_slint_sh but choose format_PO in the menu. If all goes well this will generate file slint.mo and put it in its place in the slint-[date] tree (in directory slint_locales/de/LC_MESSAGES in this example).
de: Wenn alles gut geht, starten Sie erneut /pfad/zu/tools_for_translators/toolbox_slint_sh, wählen jetzt aber im Menü "format_PO". Das sollte die Datei slint.mo erstellen und sie auf ihren Platz im Verzeichnisbau von slint-[Datum] speichern (in unserem Beispiel ins Verzeichnis slint_locales/de/LC_MESSAGES)
es: Si todo sale bien, ejecute de nuevo /ruta/a/tools_for_translators/toolbox_slint_sh pero seleccione format_PO en el menú. Esto generará el archivo slint.mo y lo pondrá en su lugar en la estructura de directorios slint-[fecha] (en el directorio slint_locales/de/LC_MESSAGES en este ejemplo).
fr: Si tout va bien, exécutez de nouveau /chemin/vers/tools_for_translators/toolbox_slint_sh mais choisissez format_PO dans le menu. Si tout va bien cela générera un fichier slint.mo et le rangera à sa place dans l'arborescence de slint-[date] (dans le répertoire slint_locales/fr/LC_MESSAGES dans cet exemple).
pt_pt: Se tudo correr bem, execute /caminho/para/tools_for_translators/toolbox_slint_sh mas selecione format_PO no menu. Se tudo correr bem isto irá gerar o ficheiro slint.mo e colocá-lo no seu lugar na árvore de slint-[data] (no diretório slint_locales/de/LC_MESSAGES neste exemplo).
ru: Если все идет хорошо, снова запустите /path/to/tools_for_translators/toolbox_slint_sh, но выберите формат_PO в меню. Если все идет хорошо, будет сгенерирован и помещен в соответствующий каталог в дереве slint-[дата] файл slint.mo (в данном примере slint_locales/ru/LC_MESSAGES).
tr: Hepsi doğru giderse, tekrar /path/to/tools_for_translators/toolbox_slint_sh ı çalıştırın fakat menüden format_PO yu seçin. Hepsi doğru giderse bu slint.mo dosyasını üretir ve slint-[tarih] ağacı içindeki yerine koyar ( bu örnekte slint_locales/de/LC_MESSAGES dizini içine).

source: Then try your translation comparing English and German versions with commands like this:
de: Danach überprüfen Sie Ihre Übersetzung und vergleichen die englische und deutsche Version, z.B. mit diesen Befehlen:
es: Luego pruebe su traducción comparando las versiones en Inglés y en Alemán con comandos como éstos:
fr: Puis essayez votre traduction en comparant les versions anglaise et française avec des commandes comme celles-ci :
pt_pt: Depois experimente a sua tradução comparando as versões em Inglês e Alemão com comandos como este:
ru: Затем попробуйте ваш перевод, сравнивая с английской и немецкой версиями командами наподобие:
tr: Sonra İngilizce ve Almanca sürümlerini karşılaştırmayı şu şekilde deneyin:
