Repository: DidierSpaier/slint-website
Catalog: old/po/tools/tools.*.po
Languages: de, es, fr, pt_pt, ru, tr

source: Also, Transifex editor has a "Suggestions" feature (similar to the "Translation Memory" in Lokalize) where it "remembers" similar past translations of a string. This feature can been really useful whenever a website page gets updated. Transifex will remember your last translation of the string and present a "Use this" link next to the suggestion, so you can just use it, avoid re-typing and re-translating, then modify it slightly, and on to the next one.
de: Außerdem hat der Transifex-Editor die Funktion "Vorschläge" (ähnlich der "Übersetzungsdatenbank" in Lokalize), wo es sich ähnliche Textabschnitte "merkt". Diesen Funktion kann sehr nützlich sein, wenn die Website aktualisiert wird. Transifex merkt sich Ihre letzte Übersetzung und zeigt Ihnen einen "Verwenden"-Link neben dem Vorschlag. Den können Sie dann nutzen, vermeiden ein erneutes Eingeben und Übersetzen, ändern nur was nötig ist, und ab zum nächsten Absatz.
es: Además, el editor de Transifex tiene una función llamada "Sugerencias" (similar a la "Memoria de Traducción" en Lokalize) la cual "recuerda" traducciones anteriores de un texto. Esta característica puede ser muy útil cuando se actualiza una página web. Transifex recordará su última traducción del texto y le presentará un enlace llamado "Utilizar esta" junto a la sugerencia, de esta forma se puede usar y se evita escribir y traducir de nuevo el texto. Solo es necesario modificar el texto ligeramente y continuar con el siguiente.
fr: En outre, l'éditeur de Transifex a une fonction "Suggestions" (similaire au "mémoire de traduction" de Lokalize) qui mémorise les traductions précédentes d'une chaîne de caractères. Cette fonction peut être réellement utile quand une page du site est mise à jour. Transifex se souviendra de votre dernière traduction de cette chaîne et vous présentera un lien "Utiliser ceci" près de la traduction. Vous pouvez ainsi récupérer l'ancienne traduction, la modifier, puis passer à la chaîne de caractères suivante.
pt_pt: Além disso, o editor Transifex tem um recurso de "Sugestões" (similar ao "Memória de Tradução" em Lokalize) onde se "lembra" traduções passadas similares de uma linha. Este recurso pode ser muito útil sempre que uma página do site da internet é atualizada. O Transifex irá registar a última tradução da linha e apresentar uma ligação "Usar esta" ao lado da sugestão, e então pode simplesmente usá-lo, evite a reescrita e retradução, depois modifique-o ligeiramente, e passe para o próximo.
ru: Кроме того, редактор Transifex имеет возможность «Предложения» (аналогичную «Памяти переводов» в Lokalize), которая «запоминает» похожие последние переводы строк. Эта возможность может быть очень полезна, когда бы страница сайта ни была обновлена. Transifex помнит ваш последний перевод и предоставляет ссылку «Используйте это», вы можете просто воспользоваться ею, избежав повторного набора и перевода.
tr: Ayrıca, Transifex düzenleyici dizenin geçmiş benzer çevirilerini "hatırlayan" "Öneriler" özelliğine sahiptir (Lokalize'deki "Translation Memory" e benzer). Bu özellik bir web sayfası güncellendiğinde oldukça kullanışlıdır. Transifex dizenin son çevirisini hatırlayacak ve önerinin yanında "Bunu kullan" bağlantısı sağlayacaktır, böylece bunu kullanabilecek, küçük bir değişiklikle yeniden yazma ve çevirmeden kurtularak sonrakine geçebileceksiniz.

source: Get acquainted with AsciiDoc markup syntax
de: Machen Sie sich mit der Syntax von AsciiDoc vertraut
es: Familiarizarse con la sintaxis de marcado de AsciiDoc
fr: Familiarisez-vous avec la syntaxe des balises d'Asciidoc
pt_pt: Familiarize-se com a sintaxe de marcação AsciiDoc
ru: Ознакомьтесь с синтаксисом разметки AsciiDoc
tr: AsciiDoc işaretleme sözdizimine alışın

source: The reference document is the http://asciidoc.org/userguide.html[AsciiDoc User Guide] but for a starter, you could just read this http://powerman.name/doc/asciidoc[AsciiDoc cheatsheet]. Even faster, assuming that 'AsciiDoc' is installed this command:
de: Das Bezugsdokument ist der http://asciidoc.org/userguide.html[AsciiDoc User Guide], aber für den Anfang können Sie das http://powerman.name/doc/asciidoc[AsciiDoc cheatsheet] lesen. Noch schneller, vorausgesetzt dass AsciiDoc installiert ist, geht es mit diesem Befehl:
es: El documento de referencia es el http://asciidoc.org/userguide.html[Manual de Usuario de AsciiDoc], pero para comenzar, podría solamente leer la http://powerman.name/doc/asciidoc[Hoja de Trucos de AsciiDoc]. Aún más rápido, asumiendo que 'AsciiDoc' está instalado, el siguiente comando:
fr: Le document de référence est le http://asciidoc.org/userguide.html[guide utilisateur AsciiDoc] (en Anglais), mais vous pouvez commencer par lire http://powerman.name/doc/asciidoc[l'antisèche AsciiDoc] (en Anglais également). Encore plus facile, si 'AsciiDoc' est installé cette commande :
pt_pt: O documento de referência é o http://asciidoc.org/userguide.html[Manual do Utilizador de AsciiDoc] mas para um iniciante, pode simplesmente ler esta http://powerman.name/doc/asciidoc[folha de dicas do AsciiDoc]. Ainda mais rápido, assumindo que 'AsciiDoc' está instalado, o seguinte comando:
ru: Основной документ - это http://asciidoc.org/userguide.html[Руководство пользователя AsciiDoc], но для начала, прочтите http://powerman.name/doc/asciidoc[шпаргалки по AsciiDoc]. Еще быстрее, при установленном 'AsciiDoc', следующая команда:
tr: Referans belge http://asciidoc.org/userguide.html[AsciiDoc User Guide] dır fakat yeni başlayan biri için, http://powerman.name/doc/asciidoc[AsciiDoc cheatsheet] belgesini okuyabilirsiniz. Daha da hızlısı, 'AsciiDoc' un kurulu olduğunu farzederek şu komut:

source: writes the AsciiDoc Markup Syntax Summary in file asciidoc.txt, that you can then display with a pager or print.
de: Damit wird eine Zusammenfassung der AsciiDoc-Syntax in die Datei asciidoc.txt geschrieben, die Sie sich dann z.B. im Handy anzeigen lassen oder ausdrucken können.
es: escribe el Resumen de la Sintaxis de Marcado de AsciiDoc en el archivo asciidoc.txt, el cual puede desplegar con un visor de texto o imprimirlo.
fr: écrira un "AsciiDoc Markup Syntax Summary" dans le fichier asciidoc.txt, que vous pourrez ensuite parcourir ou imprimer.
pt_pt: escreve o Resumo da Sintaxe de Marcação do AsciiDoc num ficheiro asciidoc.txt, que pode depois exibir com um visor ou uma impressão de texto.
ru: Она запишет в файл asciidoc.txt общие сведения о синтаксисе разметки AsciiDoc, которые вы можете прочесть или распечатать.
tr: AsciiDoc İşaretleme Sözdizimi Özeti ni asciidoc.txt dosyası içine yazar, ki böylece görüntüleyebilir ya da çıktı alabilrsiniz.

source: Preserve the markup
de: Textauszeichnung bewahren
es: Preservar el marcado
fr: Préserver le balisage
pt_pt: Preserve a marcação
ru: Сохраняйте разметку
tr: işaretleyiciyi koruyun

source: Be careful to preserve the markup as is. For instance, adding or removing spaces or "newline" characters can have unexpected effects. Here are a few examples :
de: Achten Sie darauf, dass die Textauszeichnung so erhalten bleibt, wie sie ist. Zum Beispiel kann das Entfernen von Leerzeichen oder dem Symbol für eine neue Zeile unerwartete Auswirkungen haben. Hier einige Beispiele:
es: Tenga cuidado de preservar el marcado tal como es. Por ejemplo, agregar o remover espacios o caracters de "nueva línea" puede tener efectos inesperados. Estos son algunos ejemplos:
fr: Prenez soin de préserver le balisage tel quel. Par exemple, ajouter ou enlever des espaces ou des caractères "saut de ligne" peut avoir des effets inattendus. Voici quelques exemples :
pt_pt: Tenha o cuidado de preservar a marcação como ela é. Por exemplo, adicionando ou removendo espaços ou caracteres de "nova linha" pode ter efeitos inesperados. Aqui estão alguns exemplos:
ru: Тщательно сохраняйте разметку как есть. Например, добавление или удаление пробелов или символов «новой строки» может привести к неожиданному результату. Ниже несколько примеров:
tr: İşaretleyiciyi olduğu gibi bırakmaya dikkat edin. Örneğin bir boşluğu ya da "satırbaşı" nı silmek beklenmeyen etkiler yaratabilir. Birkaç örnek:

source: Beginning a paragraph with a space will generate a 'literal paragraph' displayed with a specific font
de: Ein Leerzeichen am Anfang eines Absatzes erzeugt einen 'wörtlichen Absatz' mit einer eigenen Schriftart.
es: Comenzar un párrafo con un espacio generará un 'párrafo literal', desplegado con una fuente específica
fr: Commencer un paragraphe par une espace engendrera un 'paragraphe littéral' affiché avec une police de caractères spécifique
pt_pt: Começar um parágrafo com um espaço irá criar um 'parágrafo literal' exibido com uma fonte específica
ru: Начало параграфа с пробела приведет к генерации 'буквального параграфа', отображаемого специальным шрифтом
tr: Bir paragrafa boşlukla başlamak özel bir fontla gösterilen bir 'baskı paragrafı' üretecektir.

source: "= some text" will generate a level 0 header (document title), but only if "=" is the first character of the line, there is a space after it and there is a blank line before.
de: "= ein Text" erzeugt eine Überschrift der Ebene 0 (Dokumenttitel), aber nur dann, wenn "=" das erste Zeichen in der Zeile ist, gefolgt von einem Leerzeichen und eine leere Zeile davor ist.
es: "= algún texto" generará un encabezado de nivel 0 (título del documento), pero solo si "=" es el primer caracter en la línea, seguido de un espacio y si existe una línea en blanco antes.
fr: "= du texte" engendrera un en-tête de niveau 0 (titre du document), mais seulement si "=" est le premier caractère de la ligne et est suivi d'une espace et précédé d'une ligne vide
pt_pt: "= algum texto" irá criar um cabeçalho de nível 0 (título do documento), mas apenas se "=" é o primeiro caractere da linha, seguido de um espaço e se existe uma linha em branco antes.
ru: «= текст» приведет к генерации заголовка уровня 0 (заголовка документа), но только если «=» — первый символ в строке, есть пробел после него и пустая строка перед ним.
tr: "= bir metin" 0 seviyesinde bir başlık (belge başlığı) üretecektir, fakat sadece "=" satırın ilk karakteri ise, sonrasında bir boşluk varsa ve öncesinde boş bir satır varsa.

source: " \+" appended to a line will generate a 'line break' only if there is space before the "+", that should be the last character of the line
de: " \+" am Zeilenende erzeugt nur dann einen Zeilenumbruch, wenn ein Leerzeichen vor dem "+" steht, welches das letzte Zeichen in der Zeile ist.
es: "\+" añadido a una línea generará un 'salto de línea' solo si hay un espacio antes del "+", el cual debe ser el último caracter de la línea
fr: " \+" en fin de ligne générera un saut de ligne mais seulement si le "+" est précédé d'une espace et est le dernier caractère de la ligne
pt_pt: " \+" anexado a uma linha irá criar uma 'quebra de linha' somente se houver espaço antes do "+", que deve ser o último caractere da linha
ru: добавленный в конец строки «\+» приведет к генерации 'разрыва строки' только если перед «+» есть пробел.
tr: sonuna "\+" eklenen bir satır 'satır sonu' üretir, eğer "+" dan önce bir boşluk varsa, bu satırın son karakteri olmalı

source: To avoid messing with formatting instructions, we recommend that you first copy the source string (in English) to the translation (just click on the icon showing two pages on the upper right of the source string area) then edit it.
de: Um Fehler bei der Formatierung zu vermeiden, empfehlen wir, dass Sie den Quelltextabschnitt (auf Englisch) in den Übersetzungsbereich kopieren (klicken Sie dafür auf das Symbol mit den zwei Blättern, auf der rechten Seite oberhalb vom Quelltext) und den dann bearbeiten.
es: Para evitar arruinar las instrucciones de formato, recomendamos que primero copie el texto origen (en Inglés) a la traducción (solo haga click en el ícono que muestra dos páginas en la esquina superior derecha del texto origen) y luego edítelo.
fr: Pour éviter de mettre la pagaille dans le balisage, nous vous recommandons de copier d'abord la chaîne source (en Anglais) dans la traduction : cliquez simplement sur l'icône figurant deux pages côte à côte en haut à droite de la zone de la chaîne source, puis éditez la traduction.
pt_pt: Para evitar mexer com instruções de formatação, recomendamos que copie primeiro a linha de origem (em Inglês) para a tradução (basta clicar no ícone que mostra duas páginas no canto superior direito da área de linhas da fonte), e então edite-o.
ru: Во избежание путаницы с кодами форматирования рекомендуем сперва копировать исходную (английскую) строку в перевод (просто щёлкнув значок с двумя листами справа над исходной строкой), затем отредактировать её.
tr: Biçimlendirme yönergelerinin içinde kaybolmamak için, önce kaynak diziyi (İngilizce) çeviriye kopyalamanızı (kaynak dizi alanının sağ üstündeki simgee tıklayarak) sonra düzenlemenizi tavsiye ediyoruz.

source: Check the rendering of your translation
de: Ausgabe der Übersetzung überprüfen
es: Revisar la presentación de su traducción
fr: Vérifier le rendu de votre traduction
pt_pt: Verifique a prestação da sua tradução
ru: Проверка внешнего вида вашего перевода
tr: Çevirinizin birleşimini denetleyin

source: You can easily check the rendering of the web page generated from your translation of a source text file. Just do this:
de: Die Ausgabe der aus Ihrer übersetzten Quelltextdatei erzeugten Webseite können Sie überprüfen, indem Sie einfach folgendes eingeben:
es: Puede revisar fácilmente la presentación de la página web generada a partir de su traducción de un archivo de texto fuente. Solo haga esto:
fr: Vous pouvez vérifier facilement le rendu de la page Internet générée à partir de votre traduction d'un fichier texte source. Faites simplement ceci :
pt_pt: Pode facilmente verificar a renderização da página da internet criada a partir da sua tradução de um ficheiro de texto de origem. Basta fazer o seguinte:
ru: Вы легко можете проверить, как выглядит страница, сгенерированная из вашего перевода. Просто выполните следующее:
tr: Bir metin dosyası kaynağı çevirinizden üretilen web sayfalarının birleşimi kolayca denetlenebilir. Sadece şunu yapun:

source: lftp -c "mirror https://slint.fr/website/" # Download your translation from Transifex (we'll call it <translation.txt>) to directory website/ just created cd website CONFIG_FILE=slint.conf.en # Optionally, if the top title and the menu translated in your language are already uploaded on the website: wget https://slint.fr/slint.conf.ll; CONFIG_FILE=slint.conf.ll # replace "ll" with your language code (two letters) # then generate the web page asciidoc -b xhtml11 -a icons -f $CONFIG_FILE <translation.txt> # this command generates <translation.html> firefox <translation.html> &
de: lftp -c "mirror https://slint.fr/website/" # Übersetzung bei Tansifex herunterladen (wir nennen sie <translation.txt>) und ins gerade erstellte Verzeichnis website/ kopieren cd website CONFIG_FILE=slint.conf.en # Optional, wenn die Kopfleiste und das übersetzte Menü bereits auf die Webseite hoch geladen wurden: wget https://slint.fr/slint.conf.ll; CONFIG_FILE=slint.conf.ll # ersetzen Sie "ll" mit dem Code für Ihre Sprache (zwei Buchstaben) # erstellen Sie dann die Webseite asciidoc -b xhtml11 -a icons -f $CONFIG_FILE <translation.txt> # dieser Befehl erzeugt <translation.html> firefox <translation.html> &
es: lftp -c "mirror https://slint.fr/website/" # Descarga su traducción de Transifex (la llamaremos <traduccion.txt>) a el directorio website/ recién creado cd website CONFIG_FILE=slint.conf.en # Opcionalmente, si el título superior y el menú traducidos en su lenguaje ya han sido subidos al sitio web: wget https://slint.fr/slint.conf.ll; CONFIG_FILE=slint.conf.ll # reemplaze "ll" con su código de lenguaje (dos letras) # luego genere la página web asciidoc -b xhtml11 -a icons -f $CONFIG_FILE <traduccion.txt> # este comando genera <traduccion.html> firefox <traduccion.html> &
fr: lftp -c "mirror https://slint.fr/website/" # Téléchargez à partir de Transifex votre traduction (nous l'appellerons <traduction.txt>) dans le répertoire website/ qui vient d'être créé cd website CONFIG_FILE=slint.conf.en # Facultativement, si le titre en haut de page et le menu latéral traduits dans votre langue sont déjà téléversés sur le site Internet : wget https://slint.fr/slint.conf.ll; CONFIG_FILE=slint.conf.ll # remplacer "ll" par votre code langue (deux lettres) # ensuite générez la page XHTML asciidoc -b xhtml11 -a icons -f $CONFIG_FILE <traduction.txt> # cette commande génère <traduction.html> firefox <traduction.html> &
pt_pt: lftp -c "mirror https://slint.fr/website/" # Transfira a sua tradução do Transifex (vamos chamá-lo <tradução.txt>) para o site da internet do diretório/ recém-criado cd website CONFIG_FILE=slint.conf.en # Opcionalmente, se o título superior e o menu traduzido no seu idioma já se encontram carregados no site da internet: wget https://slint.fr/slint.conf.ll; CONFIG_FILE=slint.conf.ll # substituir "ll" com o seu código de linguagem (duas letras) # Então cria a página da internet asciidoc -b xhtml11 -a icons -f $CONFIG_FILE <tradução.txt> # Este comando gera <tradução.html> firefox <translation.html> &
ru: lftp -c "mirror https://slint.fr/website/" Загрузите ваш перевод с Transifex (назовем его <translation.txt>) в каталог website, созданный предыдущей командой cd website CONFIG_FILE=slint.conf.en # Необязательно, если заголовок и меню, переведенные на ваш язык, загружены на веб-сайт: wget https://slint.fr/slint.conf.ll; CONFIG_FILE=slint.conf.ll # замение «ll» на код вашего языка (две буквы) # затем сгенерируйте веб-страницу asciidoc -b xhtml11 -a icons -f $CONFIG_FILE <translation.txt> # эта команда сгенерирует <translation.html> firefox <translation.html> &
tr: lftp -c "mirror https://slint.fr/website/" # Çevirinizi Transifex'den (buna <translation.txt> diyeceğiz) oluşturduğunuz website/ dizinine indirin cd website CONFIG_FILE=slint.conf.en # Seçimlik olarak, üst başlık ve dilinize çevirilmiş menü web sayfasına yüklendiyse: wget https://slint.fr/slint.conf.ll; CONFIG_FILE=slint.conf.ll # "ll" yerine dil kodunuzu (iki harf) kullanın # sonra web sayfasını üretin asciidoc -b xhtml11 -a icons -f $CONFIG_FILE <translation.txt> # bu komut <translation.html> dosyasını üretir firefox <translation.html> &

source: Translate or not translate, that is the question
de: Übersetzen oder nicht übersetzen, das ist hier die Frage
es: Traducir o no traducir, esa es la pregunta
fr: Traduire ou ne pas traduire, telle est la question
pt_pt: Traduzir ou não traduzir, eis a questão
ru: Переводить или нет, вот вопрос
tr: Çevir ya da çevirme, mesele bu

source: Following words have a special meaning for AsciiDoc and should not be translated when they begin an admonition paragraph (and are often replaced by icons): TIP, NOTE, IMPORTANT, WARNING and CAUTION.
de: Folgende Wörter haben für AsciiDoc eine besondere Bedeutung und sollten nicht übersetzt werden, wenn sie am Anfang eines warnenden Absatzes stehen (und oft durch Bildchen ersetzt werden): TIP, NOTE, IMPORTANT, WARNING und CAUTION.
es: Las siguientes palabras tienen un significado especial para AsciiDoc y no deberían ser traducidas cuando dan inicio a un párrafo de advertencia (y son frecuentemente reemplazados por íconos): TIP, NOTE, IMPORTANT, WARNING y CAUTION.
fr: Les mots suivants ont une signification particulière pour AsciiDoc et ne doivent pas être traduits quand ils commencent un paragraphe devant attirer l'attention du lecteur : TIP, NOTE, IMPORTANT, WARNING et CAUTION.
pt_pt: As seguintes palavras têm um significado especial para o AsciiDoc e não devem ser traduzidas quando dão início a um parágrafo de advertência (e são frequentemente substituídas por ícones): TIP, NOTE, IMPORTANT, WARNING e CAUTION.
ru: Следующие слова имеют специальное значение в AsciiDoc и не должны переводиться, когда они начинают параграф с предупреждением (они заменяются значками): TIP, NOTE, IMPORTANT, WARNING и CAUTION.
tr: Takip eden kelimeler AsciiDoc için özel bir anlama sahiptir ve uyarı paragrafıyla başladıklarında çevirilmemelidirler (ve çoğunlukla yerine bir simge konur): TIP, NOTE, IMPORTANT, WARNING ve CAUTION.

source: Generally speaking, links and URLs should not be translated, but associated caption may, depending on the context. In following examples (taken from output of 'asciidoc --help syntax') only the value of 'caption' may be translated:
de: Im Allgemeinen sollten Links und URLs nicht übersetzt werden, aber dazugehörige Titel schon, abhängig vom Zusammenhang. Im folgenden Beispiel (aus der Ausgabe von 'asciidoc --help syntax') darf nur 'titel' übersetzt werden:
es: Hablando generalmente, los enlaces y URLs no deben ser traducidos, pero el subtítulo asociado puede serlo, dependiendo del contexto. En los siguientes ejemplos (tomados de la salida de 'asciidoc --help syntax') solo el valor del 'título' puede ser traducido:
fr: D'une manière générale, les liens et les URLs ne doivent pas être traduits mais la légende peut l'être, selon le contexte. Dans les exemples qui suivent (traduits à partir du résultat de la commande 'asciidoc --help syntax') seule la valeur de "légende" peut être traduite :
pt_pt: De um modo geral, as ligações e os URLs não devem ser traduzidos, mas o subtítulo associado pode, dependendo do contexto. Nos seguintes exemplos (tomados a partir da saída de 'asciidoc --help sintaxe') apenas o valor do 'título' pode ser traduzido:
ru: Вообще говоря, ссылки и URL не должны переводиться, но их заголовки - можно, в зависимости от контекста. В следующих примерах (полученных из вывода 'asciidoc --help syntax') только значение 'caption' можно переводить:
tr: Genel olarak söylenecek olursa, bağlantılar ve URLler çevirilmemelidirler, fakat eşleştirilen başlık yazısı, bağlama bağlı olarak değiştirilebilir. Takip eden örnekte ('asciidoc --help syntax' ın çıktısından alınmıştır) sadece 'caption' değeri çevirilebilir:

source: Document links: [[id]] (define link target) <<id,caption>> (link to target id) link:filename#id[caption] (link to external HTML file)
de: Links zu Dokumenten: [[id]] (definiert Ziellink) <<id,titel>> (Link zu einer id) link:dateiname#id[titel] (Link zu einer externen HTML-Datei)
es: Enlaces de documentos: [[id]] (definir destino del enlace) <<id,título>> (enlace al identificador destino) link:archivo#id[título] (enlace a un archivo HTML externo)
fr: Liens dans le document : [[id]] (définit la cible de lien "id") <<id,légende>> (lien vers la cible "id") link:nomdefichier#id[légende] (lien vers un fichier HTML externe)
pt_pt: Links de documentos: [[id]] (definir destino do link) <<id,caption>> (link para destino id) link:nomedeficheiro#id[título] (ligação para um ficheiro HTML externo)
ru: Ссылки на документы: [[id]] (определяет цель ссылки) <<id,заголовок>> (ссылка на назначенный id) link:filename#id[заголовок] (ссылка на внешний HTML-файл)
tr: Belge bağlantıları: [[id]] (bağlantı hedefi tanımı) <<id,başlık>> (hedef id'ye bağlantı) link:dosyaadı#id[başlık] (harici HTML dosyasına bağlantı)

source: URLs: http:address[caption] (link to web page) mailto:address[caption] (link to mail recipient)
de: URLs: http:addresse[titel] (Link zu einer Webseite) mailto:addresse[titel] (Link zu einem E-Mailempfänger)
es: URLs: http:dirección[título] (enlace a una página web) mailto:dirección[título] (enlace a destinatario de correo)
fr: URLs : http:adresse[légende] (lien vers une page Internet) mailto:adresse[légende] (lien vers une adresse courriel)
pt_pt: URLs: http:address[caption] (link para a página de internet) mailto:endereço[título] (ligação para email do destinatário)
ru: Адреса URL: http:address[заголовок] (ссылка на веб-страницу) mailto:address[заголовок] (ссылка на получателя электронной почты)
tr: URLler: http:adres[başlık] (web sayfasına bağlantı) mailto:adres[başlık] (e-posta alıcıya bağlantı)
