Repository: DidierSpaier/slint-website
Catalog: old/po/tools/tools.*.po
Languages: de, es, fr, pt_pt, ru, tr

source: Useful tools for Slint contributors
de: Nützliche Tools für Slint-Mitwirkende
es: Herramientas útiles para colaboradores de Slint
fr: Outils utiles aux contributeurs de Slint
pt_pt: Ferramentas úteis para contribuidores Slint
ru: Инструменты, используемые участниками Slint
tr: Slint'e katkı verenler için kullanışlı araçlar

source: The Transifex platform eases cooperation between translators, being a place where each translation team can centralize its PO files and share information. It provides an on line editor, that can also be used to review translations.
de: Die Plattform Transifex vereinfacht die Kooperation zwischen Übersetzern, als ein Ort an dem jedes Übersetzerteam seine PO-Dateien zentralisieren und Informationen austauschen kann. Sie bietet einen Online-Editor, der auch zum Überprüfen von Übersetzungen benutzt werden kann.
es: La plataforma Transifex facilita la cooperación entre traductores, al ser un lugar donde cada equipo de traducción puede centralizar sus archivos PO y compartir información. Provee un editor en línea, que también puede ser utilizado para revisar traducciones.
fr: la plate-forme Transifex facilite la coopération entre traducteurs. C'est un lieu où chaque équipe de traduction centralise ses fichiers PO et partage l'information. Elle procure un éditeur en ligne, qui peut aussi être utilisé pour réviser les traductions.
pt_pt: A plataforma Transifex facilita a cooperação entre os tradutores, sendo um lugar onde cada equipa de tradução pode centralizar seus ficheiros PO e compartilhar informações. Ele fornece um editor em linha, que também pode ser utilizado para avaliar as traduções.
ru: Платформа Transifex упрощает взаимодействие переводчиков, является местом, где команда переводчиков может централизованно хранить свои PO-файлы и распространять информацию. Доступен онлайн-редактор, который также подходит и для ревизии переводов.
tr: Transifex platformu çevirmenler arası işbirliğini kolaylaştırır, her bir çeviri takımının kendi PO dosyalarını bir merkezde topladığı ve bilgi paylaştığı bir yerdir. Ayrıca çevirilerin gözden geçirilmesini de sağlayan çevrimiçi bir düzenleyici sağlar.

source: To learn how to to use it visit the http://support.transifex.com/[Transifex Help Desk].
de: Um zu lernen wie sie verwendet wird, besuchen Sie den http://support.transifex.com/[Transifex Help Desk].
es: Para aprender cómo usarlo visite la página http://support.transifex.com/[Transifex Help Desk].
fr: Pour apprendre à l'utiliser visitez le http://support.transifex.com/[Transifex Help Desk] (en Anglais).
pt_pt: Para saber como usá-lo visite o http://support.transifex.com/[Transifex Help Desk].
ru: Инструкции по использованию смотрите в http://support.transifex.com/[Центре помощи Transifex].
tr: Nasıl kullanıldığını öğrenmek için http://support.transifex.com/[Transifex Help Desk] sayfasını ziyaret edin.

source: You may use Transifex' on line editor as it comes handy, but:
de: Sie können den Transifex Onlineeditor benutzen wenn er nützlich ist, aber:
es: Puede utilizar el muy útil editor en línea de Transifex, pero:
fr: Vous pouvez aussi utiliser l'éditeur en ligne de Transifex, mais :
pt_pt: Você pode usar o editor em linha Transifex uma vez que se torna útil, mas:
ru: Можете использовать онлайн-редактор Transifex при необходимости, но:
tr: Kullanışlı olduğu için Transifex'in çevrimiçi düzenleyicisini kullanabilisiniz, fakat:

source: don't forget to make frequent local backups, just in case
de: vergessen Sie nicht häufige lokale Sicherungen durchzuführen, nur für den Fall
es: no olvide hacer respaldos locales frecuentes, por si acaso
fr: n'oubliez pas d'effectuer de fréquentes sauvegardes, au cas où
pt_pt: Não se esqueça de fazer cópias de segurança locais frequentes, por precaução
ru: на всякий случай не забывайте почаще делать локальные резервные копии
tr: sık sık yerel yedekler almayı unutmayın, ne olur ne olmaz

source: text formatting of translations is easier to do and check locally, using a specialized PO editor like **Lokalize** or **Poedit**
de: Textformatierung von Übersetzungen ist leichter durchzuführen und lokal zu überprüfen, indem ein spezialisierter PO-Editor wie **Lokalize** oder **Poedit** verwendet wird
es: el formato de las traducciones es más fácil de hacer y revisar localmente si se utiliza un editor PO especializado, tales como **Lokalize** o **Poedit**
fr: la mise en forme des traductions est plus facile à effectuer et vérifier localement, en utilisant un éditeur spécialisé tel que **Lokalize** ou **Poedit**
pt_pt: Formatação de texto das traduções é mais fácil de fazer e verificar localmente, usando um editor especializado PO como o ** Lokalize ** ou ** Poedit **
ru: форматирование текста переводов легче выполнять и проверять локально, при помощи специализированных PO-редакторов, таких как **Lokalize** или **Poedit**
tr: çevirilerin metin biçimlendirilmesini, **Lokalize** veya **Poedit** gibi PO düzenleyicileri kullanarak yerel olarak yapmak ve denetlemek daha kolaydır

source: To translate webpages in asciidoc format, usage of Transifex is mandatory (see below).
de: Für das Übersetzen von Webseiten im AsciDoc-Format ist Transifex Pflicht (siehe unten).
es: Para traducir páginas web en formato asciidoc, el uso de Transifex es obligatorio (vea abajo).
fr: Pour traduire les pages du site Internet au format asciidoc, l'usage de Transifex est obligatoire (voir plus loin).
pt_pt: Para traduzir páginas da internet em formato asciidoc, o uso do Transifex é obrigatório (veja abaixo).
ru: Для перевода web-страниц в формате asciidoc использование Transifex обязательно (смотрите ниже).
tr: asciidoc biçimindeki web sayfalarını çevirmek için Transifex kullanmak zorunlu (aşağıya bakınız).

source: If you prefer to translate locally, be sure to check in Transifex 'Download for translation' (not 'Download for use') and 'Lock this translation to notify others you\'re working on it'. This could avoid duplicating efforts... But two team members can share the same big PO file, as long as they first agree on who translates what.
de: Wenn Sie lieber lokal übersetzen wollen, klicken Sie in Transifex auf 'Zum Übersetzen herunterladen' (und nicht auf 'Herunterladen') und auf 'Diesen Übersetzung sperren, damit Andere sehen, dass Sie daran arbeiten'. Dies sollte Probleme durch Duplizierung vermeiden... Aber zwei Team-Kollegen können dieselbe PO-Datei teilen, solange sich beide bei der Übersetzung einig sind, wer was übersetzt
es: Advertencia: Si prefiere traducir localmente, asegúrese de seleccionar en Transifex 'Descargar para traducir' (no 'Descargar para su uso') y 'Bloquee esta traducción para notificar a otros que está trabajando con ella'. Esto puede evitar la duplicación de esfuerzos... Pero dos miembros de un equipo puede compartir el mismo archivo PO grande, siempre y cuando se pongan de acuerdo sobre quién traduce qué.
fr: Si vous préférez traduire localement, assurez vous de cocher 'Télécharger pour traduire' (pas 'Télécharger pour l'utiliser') et 'Verrouiller cette traduction pour informer les autres que vous travaillez dessus'. Ceci pourrait éviter un travail en double ... Mais deux équipiers peuvent partager le même gros fichier PO, du moment qu'ils s'accordent sur qui traduit quoi.
pt_pt: Se preferir traduzir localmente, não deixe de conferir no Transifex 'Transferir para tradução' (não 'Transferir para utilização) e 'Bloquear esta tradução para avisar os outros que trabalhando nela'. Isto pode evitar a duplicação de esforços... Mas dois membros da mesma equipa podem compartilhar o mesmo ficheiro PO grande, desde que concordem primeiro sobre quem traduz o quê.
ru: Если предпочитаете переводить локально, выбирайте на Transifex 'Скачать для перевода' (а не 'Скачать для использования') и 'Заблокировать этот перевод, чтобы предупредить остальных, что вы работаете над ним'. Это исключит дублирование усилий… Несколько членов команды могут одновременно работать над одним большим PO-файлом, если договорятся, кто какую часть переводит.
tr: Eğer yerel olarak çevirmeyi tercih ederseniz, 'Çevirmek üzere indirin' ile indirdiğinizden ('Kullanmak üzere indirin' ile değil) ve dosya üzerinde çalıştığınızı diğerleri görmesi için kilitlediğinizde emin olun. Bu çakışma hatlarının önüne geçer... Fakat iki takım üyesi büyük bir PO dosyasını, kimin neyi çevireceği konusunda anlaştıkları sürece paylaşabilir.

source: Transifex doesn't wrap lines of translated text. This can lead to *very* long lines, hard to read in a text editor and that can even make it crash eating all the CPU. To avoid that, after having downloaded the PO file, just type:
de: Transifex macht keine Zeilenumbrüche im übersetzten Text. Das kann zu *sehr* langen Zeilen führen, die im Texteditor schlecht lesbar sind und ihn sogar abstürzen lassen. Um das zu vermeiden, geben Sie nach dem Herunterladen der PO-Datei in der Kommandozeile folgendes ein:
es: Transifex no ajusta las líneas en el texto traducido. Esto puede crear líneas *muy* largas, difíciles de leer en un editor de texto e inclusive puede bloquear el programa al consumir los recursos del CPU. Para evitar esto, después de descargar el archivo PO, solo escriba:
fr: Transifex ne revient pas à la ligne dans le texte traduit. Ceci peut conduire à de *très* longues lignes, difficiles à lire dans un éditeur de textes et qui peuvent même le faire "planter" en consommant tous la capacité de traitement. Pour éviter cela, après avoir téléchargé le fichier PO tapez simplement :
pt_pt: O Transifex não quebra linhas de texto traduzido. Isto pode levar a linhas *muito* compridas, difíceis de ler num editor de texto e que pode mesmo fazê-lo falhar consumindo toda a CPU. Para evitar isso, depois de ter transferido o ficheiro PO, basta escrever:
ru: Transifex не переносит строки переведенного текста. Это приводит к появлению *очень* длинных строк, усложнению чтения в текстовом редакторе и даже к высокой загрузке процессора. Чтобы избежать этого, после загрузки PO-файла наберите:
tr: Transifex çevirilen metin satırlarını sarmalamaz. Bu *çok* uzun satırlara, bir metin düzenleyici içinde okumanın zor olmasına hatta bu yüzden tüm CPU'yu tüketerek iflas etmesine yol açabilir. Bundan kaçınmak için, PO dosyalarını indirdikten sonra şunu yazın:

source: msgcat file_downloaded_from_Transifex > file_renamed
de: msgcat von_Transifex_heruntergeladene_Datei > Umbenannte_Datei
es: msgcat archivo_descargado_de_Transifex > archivo_renombrado
fr: msgcat fichier_téléchargé_depuis_Transifex > fichier_renommé
ru: msgcat файл_загруженный_с_Transifex > переименованный_файл

source: then use 'Lokalize' or 'Poedit' to translate *file_renamed*. This file will have wrapped lines but will be otherwise identical to downloaded one, so that won't hurt.
de: und übersetzen die *Umbenannte_Datei* mit 'Lokalize' oder 'Poedit'. Der Text in dieser Datei hat dann Zeilenumbrüche, ist sonst aber identisch mit der heruntergeladenen Datei.
es: luego utilice 'Lokalize' o 'Poedit' para traducir *archivo_renombrado*. Este archivo tendrá el largo de las líneas ajustado, pero será en toda otra forma idéntico al descargado, así que no habrá ningún problema.
fr: ensuite utilisez 'Lokalize' ou 'Poedit' pour traduire *fichier_renommé*. Ce fichier comportera des retours à la ligne mais sera autrement identique à celui téléchargé, donc cela ne fera aucun mal.
pt_pt: depois use o 'Lokalize' ou 'Poedit' para traduzir *ficheiro_renomeado*. Este ficheiro vai ter linhas divididas mas de certo modo vai ser idêntico ao transferido, de maneira a que não afecte.
ru: и используйте 'Lokalize' или 'Poedit' для перевода *переименованного_файла*. Этот файл будет с переносами строк, но в остальном будет идентичен загруженному файлу, так что не повредит.
tr: sonra *file_renamed* i çevirmek için 'Lokalize' ya da 'Poedit' kullanın. Bu dosyanın sarmalanmış satırları olacak fakat diğer durumda indirilenden farksız olacak, yani önemli değil.

source: If you translate locally don't forget to upload edited file on Transifex when you're idle, not to let it locked uselessly.
de: Wenn Sie offline übersetzen, vergessen Sie nicht, die Datei wieder auf Transifex hoch zu laden, wenn Sie Pausen machen, damit Sie sie nicht unnötig zu sperren.
es: Si traduce localmente, no olvide subir el archivo editado a Transifex cuando no esté trabajando en él, para no dejarlo bloqueado innecesariamente.
fr: Si vous traduisez localement n'oubliez pas de téléverser le fichier édité sur Transifex quand vous êtes inactif, pour ne pas le laisser verrouillé inutilement.
pt_pt: Se traduzir localmente não se esqueça de carregar o ficheiro editado no Transifex quando estiver ocioso, não o deixe trancado inutilmente.
ru: Если переводите локально, не забывайте выгружать отредактированный файл на Transifex, приостанавливая работу с ним, не держите блокировку без нужды.
tr: Eğer yerel olarak çeviri yapıyorsanız düzenlenen dosyayı boş olduğunuz zaman yüklemeyi unutmayın, gereksiz olarak kilitli kalmasına izin vermeyin.

source: 'Lokalize' is included in Slackware. You can either read the Lokalize Handbook http://docs.kde.org/development/en/kdesdk/lokalize/index.html[on line] or access it from the Help menu of pressing [F1]. Recommended settings:
de: 'Lokalize' ist in Slackware enthalten. Sie können entweder das http://docs.kde.org/development/en/kdesdk/lokalize/index.html[Online-Handbuch] zu Lokalize lesen oder über das Hilfemenü durch Drücken der Taste [F1] . Empfohlene Einstellungen:
es: 'Lokalize' está incluido en Slackware. Puede leer el manual de Lokalize http://docs.kde.org/development/en/kdesdk/lokalize/index.html[en línea] o accesarlo desde el menú de Ayuda presionando [F1]. Configuración recomendada:
fr: 'Lokalize' est inclus dans Slackware. Vous pouvez soit lire le manuel de Lokalize http://docs.kde.org/stable/fr/kdesdk/lokalize/index.html[en ligne] ou y accéder par le menu Aide ou en pressant la touche [F1]. Réglages recommandés :
pt_pt: 'Lokalize' está incluído no Slackware. Você pode ler o Manual Lokalize http://docs.kde.org/development/en/kdesdk/lokalize/index.html[on-line] ou acessá-lo a partir do menu Ajuda de pressionar [F1]. Definições recomendadas:
ru: 'Lokalize' входит в состав Slackware. Вы можете либо прочесть Lokalize Handbook http://docs.kde.org/development/en/kdesdk/lokalize/index.html[в сети], либо из меню Помощь, нажав [F1]. Рекомендуемые настройки:
tr: 'Lokalize' Slackware içinde bulunur. Lokalize El Kitabını http://docs.kde.org/development/en/kdesdk/lokalize/index.html[on line] okuyabilir ya da F1 e basarak Yardım menüsünden ulaşabilirsiniz. Tavsiye edilen ayarlar:

source: Settings => Configure Lokalize => Identity: Choose your language (set to target language).
de: Einstellungen => Lokalize einrichten ... => Identität: Wählen Sie Ihre Sprache (Zielsprache).
es: Preferencias => Configurar Lokalize => Identidad: Seleccione su lenguaje (establecer como lenguaje destino)
fr: Configuration => Configurer Lokalize => Identité => Langue par défaut (choisir la langue cible).
pt_pt: Definições => Configurar Lokalize => Identidade: Escolha o seu idioma (definido como idioma de destino).
ru: Настройка => Настроить Lokalize => Идентификация: Выбрать язык (установить в целевой язык).
tr: Settings => Configure Lokalize => Identity: Dilinizi seçin (hedef dile ayarlayın).

source: Settings => Configure Lokalize => Appearance: Choose a serif fixed width (mono spaced) font like Courier. This will help you distinguish 0 (the digit) and O (the letter) or | (the pipe) from I (the letter) and check formatting, for instance first word's alignment on consecutive lines.
de: Einstellungen => Lokalize einrichten ... => Erscheinungsbild: Wählen Sie eine Schrift mit fester Breite (Monospace) wie z.B. Courier. Das hilft Ihnen zwischen 0 (der Ziffer) und O (dem Buchstaben) oder | (dem senkrechten Strich) und l (dem Buchstaben) zu unterscheiden und die Formatierung zu prüfen, z.B. die Ausrichtung des ersten Wortes in nebeneinander liegenden Spalten.
es: Preferencias => Configurar Lokalize => Aspecto: Seleccione una fuente serif de ancho fijo (monoespacio) como Courier. Esto le ayudará a distinguir entre 0 (el dígito) y O (la letra) o la | (barra vertical) de I (la letra), y a revisar el formato, por ejemplo la alineación de la primera palabra en líneas consecutivas.
fr: Configuration => Configurer Lokalize => Apparence : Choisir une "police de l'éditeur" à chasse fixe et empattement ("serif") comme Courier. Ceci vous aidera à distinguer 0 (le chiffre) de O (la lettre) ou | (la barre verticale de I (la lettre) et à vérifier la mise en forme, par exemple l'alignement du premier mot de lignes consécutives.
pt_pt: Definições => Configurar Lokalize => Aparência: Escolha uma fonte de largura fixa serif (mono espaçada) como a Courier. Isso irá ajudá-lo a distinguir 0 (o dígito) de O (a letra) ou | (barra vertical) de I (a letra) e verificar a formatação, para alinhamento de primeira instância da palavra em linhas consecutivas.
ru: Настройки => Настроить Lokalize => Внешний вид: Выбрать шрифт фиксированной ширины с засечками (моноширинный), например Courier. Это позволит различать 0 (цифра) и O (буква) или | (пайп) и I (буква) и проверять форматирование, например выравнивание первых слов на последовательных строках.
tr: Settings => Configure Lokalize => Appearance: Courier gibi serif sabit genişlikli (tek boşluklu) bir font seçin. Bu sizin 0 (rakam) ile O (harf) yu ya da | (boru) ile I (harf) yı ayırt etmenizi, biçimlendirmeyi denetlemenizi -örneğin ardışık satırlarda ilk kelime hizalaması gibi- sağlar.

source: Settings => Configure Lokalize => Appearance: Check 'LEDS to indicate Fuzzy and Untranslated status' as well as 'cursor column number', very handy to check line's length when that matters.
de: Einstellungen => Lokalize einrichten ... => Erscheinungsbild: Markieren Sie 'LEDs zur Anzeige des Nachrichtenstatus und der Cursorspalte verwenden' und auch 'Leerzeichen am Ende hervorheben', das ist sehr nützlich um die Zeilenlänge zu prüfen, wenn es eine Rolle spielt.
es: Preferencias => Configurar Lokalize => Aspecto: Marque 'LED para indicar de los estados de dudoso y sin traducir, además del número de columna del cursor', es muy útil para revisar el largo de las líneas cuando es importante hacerlo.
fr: Configuration => Configurer Lokalize => Apparence : cocher "Diode indiquant les états « à mettre à jour », « non traduit », ainsi que le numéro de colonne du curseur", très pratique pour vérifier la longueur de ligne quand cela importe.
pt_pt: Definições => Configurar Lokalize => Aparência: Confira os 'LEDS para indicar o estado impreciso e por traduzir' bem como o 'número da coluna do cursor', muito útil para verificar o comprimento da linha, quando isso importa.
ru: Настройка => Настроить Lokalize => Внешний вид: Выбрать 'Индикаторы состояния для выделения непереведенных и неточных строк', также как 'позиция курсора в столбце', очень удобно для проверки длины строк, когда это имеет значение.
tr: Settings => Configure Lokalize => Appearance: 'LEDS to indicate Fuzzy and Untranslated status' ile 'cursor column number' kontrol edin, satır uzunluğunu önemli olduğunda çok pratiktir.

source: 'Poedit' is not shipped in Slackware but is available @ http://slackbuilds.org[SlackBuilds.org].
de: 'Poedit' wird nicht mit Slackware mitgeliefert, ist aber auf http://slackbuilds.org[SlackBuilds.org] verfügbar.
es: 'Poedit' no se incluye con Slackware pero está disponible en http://slackbuilds.org[SlackBuilds.org].
fr: 'Poedit' n'est pas inclus dans Slackware mais est disponible sur le site http://slackbuilds.org[SlackBuilds.org].
pt_pt: 'Poedit' não é fornecido no Slackware, mas está disponível @ http://slackbuilds.org[SlackBuilds.org].
ru: 'Poedit' не поставляется со Slackware, но доступен на http://slackbuilds.org[SlackBuilds.org].
tr: 'Poedit' Slackware içinde gelmez fakat @ http://slackbuilds.org[SlackBuilds.org] dan ulaşılabilir.

source: It lacks a handy way to check line's length, but this put aside its features are similar to those of Lokalize, so choosing one or the other is a matter of personal preference.
de: Es ist mühselig die Zeilenlänge zu überprüfen, aber abgesehen davon sind die Funktionen ähnlich wie bei Lokalize. Man kann also je nach persönlicher Vorliebe Lokalize oder Poedit nehmen.
es: Le hace falta una manera útil para revisar el largo de las líneas, pero a pesar de esto sus características son similares a las de Lokalize, de manera que escoger uno u otro es preferencia personal.
fr: Il lui manque un moyen pratique de vérifier la longueur de ligne, mais ceci mis à part ses possibilités sont similaires à celles de Lokalize : choisir l'un ou l'autre est affaire de préférence personnelle.
pt_pt: Carece de uma maneira útil para verificar o comprimento de linha, mas posto isto de lado as suas características são semelhantes às do Lokalize, por isso escolher um ou outro é uma questão de preferência pessoal.
ru: У него не хватает удобных функций для проверки длины строки, но в остальном его функционал аналогичен Lokalize, так что можно выбирать один или другой редактор по своему вкусу.
tr: Satır uzunluğunu pratik şekilde denetleme eksikliği vardır fakat bunun dışındaki özellikleri Lokalizeninkilerle benzerdir, kısacası birini ya da diğerini seçmek kişisel bir tercihtir.

source: In Edit => Preferences => Editor, check 'Automatic spell checking' and, as with Lokalize, choose a serif fixed width font.
de: Unter Bearbeiten => Einstellungen => Editor: Wählen Sie 'Automatische Rechtschreibprüfung' und, so wie bei Lokalize, eine Schriftart mit fester Breite.
es: En Editar => Preferencias => Editor, seleccione 'Revisión ortográfica automática' y, como con Lokalize, seleccione una fuente serif de ancho fijo.
fr: Dans Edition => Préférences => Éditeur, cocher "Vérification orthographique automatique" et, comme pour Lokalize, choisir une police à chasse fixe et à empattement.
pt_pt: Em Editar => Preferências => Editor, verifique 'verificação ortográfica automática' e como com o Lokalize, escolha uma fonte de largura fixa serif.
ru: В Правка => Настройки => Редактор отметьте 'Автоматически проверять орфографию' и, как и в Lokalize, выберите шрифт фиксированной ширины с засечками.
tr: Edit => Preferences => Editor içinde, 'Automatic spell checking' i işaretleyin ve, Lokalize ile olduğu gibi, serif sabit genişlikli font seçiniz.

source: Usage of scripts included in Slint's tarball
de: Benutzung der Skripts aus dem Slint-Paket
es: Uso de los scripts incluidos en el archivo tar de Slint
fr: Emploi de scripts inclus dans l'archive Slint
pt_pt: Uso de scripts incluídos no tarball do Slint
ru: Использование сценариев, содержащихся в тарболе Slint
tr: Slint tarball içindeki kullanışlı betikler
