Repository: DidierSpaier/slint-website
Catalog: old/po/tools/tools.*.po
Languages: de, es, fr, pt_pt, ru, tr

source: /path/to/build/slint.sh LANG=de_DE.utf8 /path/to/build/slint.sh
de: /pfad/zu/build/slint.sh LANG=de_DE.utf8 /pfad/zu/build/slint.sh
es: /ruta/a/build/slint.sh LANG=de_DE.utf8 /ruta/a/build/slint.sh
fr: /chemin/vers/build/slint.sh LANG=fr_FR.utf8 /chemin/vers/build/slint.sh
pt_pt: /caminho/para/criar/slint.sh LANG=de_DE.utf8 /caminho/para/criar/slint.sh

source: How-to check translations of man pages included in packages pkgtools and slackpkg
de: Anleitung zum Überprüfen von Handbuchseiten der Pakete pkgtools und slackpkg
es: Cómo revisar traducciones de páginas de manual incluidas en los paquetes pkgtools y slackpkg
fr: Comment vérifier les traductions des pages de manuel inclues dans les paquets pkgtools et slackpkg
pt_pt: Como verificar traduções de páginas de manual incluídas nos pacotes pkgtools e slackpkg
ru: Как проверять переводы страниц руководств, входящих в пакеты pkgtools и slackpkg
tr: pkgtools ve slackpkg paketleri içine dahil edilen kılavuz sayfalarının çevirisi nasıl denetlenir

source: Resources: https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools] and https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]
de: Quellen: https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools] und https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]
es: Recursos: https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools] y https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]
fr: Ressources: https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools] et https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]
pt_pt: Recursos: https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools] e https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]
ru: Ресурсы: https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools] and https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]
tr: Kaynak: https://www.transifex.com/projects/p/slint/resource/pkgtools/[pkgtools] ve https://www.transifex.com/projects/p/slint/resource/slackpkg/[slackpkg]

source: Again, put PO file in directory wip/, (re)named for instance as es.pkgtools.po (man pages included in package pkgtools in Spanish). Then run this command:
de: Kopieren Sie die PO-Datei wieder ins Verzeichnis wip/ und benennen Sie sie ggf. um, z.B. in es.pkgtools.po (spanische Handbuchseiten für pkgtools). Dann rufen Sie diesen Befehl auf:
es: De nuevo, ponga el archivo PO en el directorio wip/, renómbrelo por ejemplo es.pkgtools.po (las páginas de manual en Español incluidas en el paquete pkgtools). Entonces ejecute este comando:
fr: De nouveau, mettez le fichier PO dans le répertoire wip/, renommé par exemple fr.pkgtools.po (pages de manuel inclues dans le paquet pkgtools en Français). puis, exécutez cette commande :
pt_pt: De novo, coloque o ficheiro PO no diretório wip/, (re)renomeá-lo por exemplo como es.pkgtools.po (páginas de manual incluídas no pacote pkgtools em Espanhol). Depois execute o seguinte comando:
ru: Опять же, поместите PO-файлв каталог wip/, (пере)именуйте, например, в ru.pkgtools.po (страницы руководств, входящих в пакет pkgtools на русском). Затем выполните команду:
tr: Yine, PO dosyasını wip/ dizini içine koyun, örneğin es.pkgtools.po olarak (yeniden)adlandırın (İspanyolya pkgtools içindeki kılavuz sayfaları). Sonra bu komutu çalıştırın:

source: /path/to/tools_for_translators/generate_man_pages es.pkgtools
de: /pfad/zu/tools_for_translators/generate_man_pages es.pkgtools
es: /ruta/a/tools_for_translators/generate_man_pages es.pkgtools
fr: /chemin/vers/tools_for_translators/generate_man_pages fr.pkgtools
pt_pt: /caminho/para/tools_for_translators/generate_man_pages es.pkgtools
ru: /path/to/tools_for_translators/generate_man_pages ru.pkgtools

source: If all goes this will output all included man pages (in this case: es.explodepkg, es.installpkg, es.makepkg, es.pkgtool, es.removepkg, es.upgradepkg). Else read the error messages, make needed fixes then do it again. You can avoid most errors following this link:contribute.html#warning_man_pages[Warning].
de: Wenn keine Fehlermeldung kommt, werden alle eingebundenen Handbuchseiten erstellt (in unserem Beispiel: es.explodepkg, es.installpkg, es.makepkg, es.pkgtool, es.removepkg und es.upgradepkg). Andernfalls lesen Sie die Fehlermeldungen, machen Sie die nötigen Korrekturen und versuchen Sie es nochmal. Sie können die meisten Fehler vermeiden, wenn Sie diese link:contribute.html#warning_man_pages[Warnung] befolgen.
es: Si todo sale bien esto generará todas las páginas de manual incluidas (en este caso: es.explodepkg, es.installpkg, es.makepkg, es.pkgtool, es.removepkg y es.upgradepkg). En caso contrario, lea los mensajes de error, haga las correcciones necesarias e inténtelo de nuevo. Puede evitar la mayoría de errores siguiendo esta link:contribute.html#warning_man_pages[Advertencia].
fr: Si tout se passe bien ceci générera toutes les pages de manuel (dans le cas présent : fr.explodepkg, fr.installpkg, fr.makepkg, fr.pkgtool, fr.removepkg et fr.upgradepkg). Sinon lisez les messages d'erreur, faites les corrections nécessaires et recommencez. Vous pouvez éviter la plupart des erreurs en suivant cet link:contribute.html#warning_man_pages[Avertissement].
pt_pt: Se tudo correr bem, isto irá gerar todas as páginas do manual incluídas (neste caso: es.explodepkg, es.installpkg, es.makepkg, es.pkgtool, es.removepkg, es.upgradepkg). Caso contrário leia as mensagens de erro, faça correções necessárias e depois tente novamente. Pode evitar a maioria dos erros seguindo este link:contribute.html#warning_man_pages[Aviso].
ru: Если все идет хорошо, сценарий создаст все страницы руководств (в данном случае: ru.explodepkg, ru.installpkg, ru.makepkg, ru.pkgtool, ru.removepkg, ru.upgradepkg). В противном случе читайте сообщения об ошибках, вносите необходимые правки и попробуйте еще раз. Вы можете избежать многих ошибок, прочитав link:contribute.html#warning_man_pages[Предупреждения].
tr: Hepsi doğru giderse içerilen tüm kılavuz sayfalarını çıktı olarak verir (bu durumda: es.explodepkg, es.installpkg, es.makepkg, es.pkgtool, es.removepkg, es.upgradepkg). Değilse hata mesajını okuyun, gerekli düzeltmeleri yapın ve tekrarlayın. Pek çok hatayı link:contribute.html#warning_man_pages[Warning] i takip ederek giderebilirsiniz.

source: To compare localized vs genuine man pages, do this for instance (example for translation in Ukrainian) :
de: Um die lokalisierten mit den ursprünglichen Handbuchseiten zu vergleichen , machen Sie z.B. Folgendes (Beispiel für eine Übersetzung ins Ukrainische):
es: Para comparar las páginas de manual localizadas con las genuinas, haga esto por ejemplo (ejemplo de traducción en Ucraniano) :
fr: Pour comparer la page traduite avec celle d'origine, faites par exemple ceci (exemple pour une traduction en Français) :
pt_pt: Para comparar as páginas de manual localizadas com as genuínas, faça isto por exemplo (exemplo para tradução em Ucraniano):
ru: Чтобы сравнить переведенные страницы руководств с оригинальными, выполните, например, это (пример для перевода на русский):
tr: Yerelleştirilmiş kılavuz sayfaları ile asıl olanları karşılaştırmak için, şunu yapın örneğin (Ukraynaca çeviri için örnek):

source: cd /path/to/wip/ LANG=uk_UA.utf8 GROFF_ENCODING=utf8 man ./installpkg # localized man page GROFF_ENCODING=utf8 man installpkg # genuine man page
de: cd /pfad/zu/wip/ LANG=uk_UA.utf8 GROFF_ENCODING=utf8 man ./installpkg # lokalisierte Handbuchseite GROFF_ENCODING=utf8 man installpkg # ursprüngliche Handbuchseite
es: cd /ruta/a/wip/ LANG=uk_UA.utf8 GROFF_ENCODING=utf8 man ./installpkg # página de manual localizada GROFF_ENCODING=utf8 man installpkg # página de manual genuina
fr: cd /chemin/vers/wip LANG=fr_FR.utf8 GROFF_ENCODING=utf8 man ./installpkg # page de manuel traduite GROFF_ENCODING=utf8 man installpkg # page de manuel originelle
pt_pt: cd /caminho/para/wip/ LANG=uk_UA.utf8 GROFF_ENCODING=utf8 man ./installpkg # página de manual localizada GROFF_ENCODING=utf8 man installpkg # página de manual genuína
ru: cd /path/to/wip/ LANG=ru_UA.utf8 GROFF_ENCODING=utf8 man ./installpkg # переведенное руководство GROFF_ENCODING=utf8 man installpkg # оригинальное руководство
tr: cd /path/to/wip/ LANG=uk_UA.utf8 GROFF_ENCODING=utf8 man ./installpkg # yerelleştirilmiş kılavuz sayfası GROFF_ENCODING=utf8 man installpkg # asıl kılavuz sayfası

source: To save typing "GROFF_ENCODING=utf8" every time, put this line in ~/.bashrc:
de: Um nicht jedes Mal "GROFF_ENCODING=utf8" eingeben zu müssen, tragen Sie in der ~/.bashrc folgende Zeile ein:
es: Para evitar escribir "GROFF_ENCODING=utf8" cada vez, ponga esta línea en ~/.bashrc:
fr: Pour éviter de taper "GROFF_ENCODING=utf8" à chaque fois, mettez cette ligne dans votre ~/.bashrc :
pt_pt: Para evitar estar sempre a escrever "GROFF_ENCODING=utf8", coloque esta linha no ~/.bashrc:
ru: Чтобы не набирать "GROFF_ENCODING=utf8" каждый раз, добавьте эту строку в ~/.bashrc:
tr: Her seferinde "GROFF_ENCODING=utf8" yazmaktan kurtulmak için ~/.bashrc içine bu satırı koyun:

source: Translation of text files to be processed by 'AsciiDoc' to generate web pages
de: Übersetzen von Textdateien, aus denen 'AsciiDoc' Webseiten erstellt
es: Traducción de archivos de texto para ser procesados por 'AsciiDoc' para generar páginas web
fr: Traduction des fichiers texte à traiter par 'AsciiDoc' pour générer des pages Internet
pt_pt: Tradução de ficheiros de texto a serem processados pelo 'AsciiDoc' para criar páginas da internet
ru: Перевод текстовых файлов, обрабатываемых 'AsciiDoc' при генерации web-страниц
tr: 'AsciiDoc' tarafından web sayfaları üretmek için işlenecek metin dosyalarının çevirilmesi

source: As indicated in link:contribute.html#new_web_pages[Translation of web pages], following pages are generated by 'asciidoc' from source text files: link:slint.html[slint.html], link:installer.html[installer.html], link:package.html[package.html], link:contribute.html[Contribute], link:translators.html[Translators], link:tools.html[Tools] and link:changelog.html[ChangeLog] as well as https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po].
de: Wie unter link:contribute.html#new_web_pages[Übersetzen von Webseiten] beschrieben, erstellt 'AsciDoc' aus Textdateien folgende Seiten: link:slint.html[slint.html], link:installer.html[installer.html], link:package.html[package.html], link:contribute.html[contribute.html], link:translators.html[translators.html], link:tools.html[tools.html] und link:changelog.html[changelog.html], sowie https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po].
es: Como se indica en link:contribute.html#new_web_pages[Traducción de páginas web], las siguientes páginas son generadas por 'asciidoc' a partir de archivos de texto: link:slint.html[slint.html], link:installer.html[installer.html], link:package.html[package.html], link:contribute.html[Contribute], link:translators.html[Translators], link:tools.html[Tools] y link:changelog.html[ChangeLog], así como https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po].
fr: Comme indiqué dans link:contribute.html#new_web_pages[Traduction de pages du site Internet], les pages suivantes sont générées par 'asciidoc' à partir de fichiers textes sources : link:slint.html[slint], link:installer.html[installer.html], link:package.html[package.html], link:contribute.html[contribute.html], link:translators.html[transators.html], link:tools.html[tools.html] et link:changelog.html[changelog.html] ainsi que https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po].
pt_pt: Como indicado na link:contribute.html#new_web_pages[Tradução de páginas da internet], as seguintes páginas são criadas pelo 'asciidoc' a partir de ficheiros de texto: link:slint.html[slint.html], link:installer.html[instalador.html], link:package.html[pacote.html], link:contribute.html[Contribua], link:translators.html[Tradutores], link:tools.html[Ferramentas] e link:changelog.html[ChangeLog], bem como https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po].
ru: Как показано в link:contribute.html#new_web_pages[Перевод web страниц], следующие страницы сгенерированы 'asciidoc' из исходных текстовых файлов: link:slint.html[slint.html], link:installer.html[installer.html], link:package.html[package.html], link:contribute.html[Contribute], link:translators.html[Translators], link:tools.html[Tools] и link:changelog.html[ChangeLog], так же как https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po].
tr: link:contribute.html#new_web_pages[Web sayfalarının çevirisi]nde belirtildiği gibi, takip eden sayfalar 'asciidoc' tarafından kaynak metin dosyalarından üretilir: link:slint.html[slint.html], link:installer.html[installer.html], link:package.html[package.html], link:contribute.html[Katkı verin], link:translators.html[Çevirmenler], link:tools.html[Araçlar] and link:changelog.html[Değişiklik Listesi] ile birlikte https://www.transifex.com/projects/p/slint/resource/templatepo/[template.po].

source: These source text files should be translated using Transifex on line editor: uploading a translated text file on Transifex fails with an error message for a reason unknown of the writer, so translating files locally then uploading them on Transifex is not an option.
de: Diese Quelltextdateien sollten mit dem Online-Editor von Transifex übersetzt werden: Das Hochladen einer übersetzten Textdatei bei Transifex endet mit einer Fehlermeldung, also ist eine Offline-Übersetzung und diese dann bei Transifex hoch zu laden keine Option.
es: Estos archivos de texto iniciales deben ser traducidos utilizando el editor en línea de Transifex: cuando se sube un archivo de texto traducido a Transifex, el proceso falla con un mensaje de error cuya causa es desconocida, de modo que traducir archivos localmente y luego subirlos a Transifex no es una opción.
fr: Ces fichiers textes sources doivent être traduits avec l'éditeur en ligne de Transifex : téléverser un fichier texte sur Transifex échoue avec un message d'erreur pour une raison inconnue du rédacteur, aussi traduire le fichier localement puis le téléverser vers Transifex n'est pas envisageable.
pt_pt: Estes ficheiros de texto-fonte devem ser traduzidos utilizando o editor em linha Transifex: quando se carrega um ficheiro de texto traduzido no Transifex o processo falha com uma mensagem de erro cuja causa é desconhecida, assim, traduzir ficheiros localmente e de seguida enviá-los para o Transifex não é uma opção.
ru: Эти файлы нужно переводить при помощи онлайн-редактора Transifex: попытка выгрузить переведенный текстовый файл на Transifex оканчивается неудачей с сообщением о неизвестной ошибке редактора, поэтому перевод этих файлов локально и выгрузка их на Transifex - не вариант.
tr: Bu kaybak metin dosyaları Transifex çevrimiçi düzenleyici ile çevirilmelidir: Transifex'e çevirilmiş bir metin dosyası yüklemek bilinmeyen yazar sebebiyle bir hata mesajıyla başarısız olur, dosyaları yerelde düzenleyip Transifex'e yüklemek bir seçenek değildir.

source: But Transifex on line editor has the advantage of allowing to add in translation files sentences or paragraphs that will stay linked to a string of the original English file.
de: Der Online-Editor von Transifex hat aber den Vorteil, dass die übersetzten Textpassagen mit den Textpassagen aus der Originaldatei auf Englisch verknüpft bleiben.
es: El editor en línea de Transifex tiene la ventaja de que permite agregar oraciones o párrafos a los archivos de traducción, los cuales se mantendrán enlazados a un texto en el archivo original en Inglés.
fr: Mais l'éditeur en ligne de Transifex présente l'avantage de permettre d'ajouter aux fichiers de traduction des phrases ou paragraphes qui resteront attachés à une chaîne de caractère du fichier originel en Anglais.
pt_pt: Mas o editor em linha Transifex tem a vantagem de permitir adicionar em ficheiros de tradução frases ou parágrafos que vão ficar ligados a uma cadeia de caracteres do ficheiro original em Inglês.
ru: Но онлайн-редактор Transifex имеет преимущество в том, что позволяет добавлять в файлы переводов строки и целые параграфы, сохраняя при этом привязку к строкам оригинального английского файла.
tr: Fakat Transifex çevrimiçi düzenleyici çeviri dosyaları içinde orjinal İngilizce dosyasının bir dizisine bağlı kalacak sağlar cümleler veya paragraflar eklemenize izin verir.

source: This allows translators to customize their translations in adding information specific to their locale, as for instance how user can get help in their specific language or country, pointers to localized documentation, etc.
de: Das erlaubt Übersetzern ihre Übersetzungen anzupassen und Informationen zu hinterlassen, die z.B. Hinweise darüber geben, wie Benutzer Hilfe in Ihrem Land bekommen, auf die übersetzte Dokumentation verweisen u.s.w.
es: Esto le permite a los traductores personalizar sus traducciones al añadir información específica a su localización, por ejemplo cómo un usuario puede obtener ayuda en su lenguaje o país específico, indicaciones a información traducida, etc.
fr: Ceci permet aux traducteurs de particulariser leurs traductions en y ajoutant des informations spécifiques à leur locale, par exemple comment obtenir de l'aide dans leur langue ou pays, des liens vers une documentation localisée, etc.
pt_pt: Isto permite aos tradutores personalizar suas traduções em adicionar informações específicas para a sua localidade, por exemplo como o utilizador pode obter ajuda no seu idioma ou país específico, indicações para documentação localizada, etc.
ru: Это позволяет переводчикам изменять их переводы, добавляя информацию, специфичную их локали, например, о том, как пользователь может получить поддержку на этом языке или в данной стране, или о ссылках на локализованную документацию и прочем.
tr: Bu, çevirmenlerein kendi yerellerine özgü bilgileri çevirilerine ekleyerek özelleştirmesine izin verir, örneğin kullanıcı kendine özgü dilinde ya da ülkesinde nasıl yardım alabilir, yerelleştirilmiş belgeler için işaretçiler, vb.

source: Following an update of an original English text file, text strings in translation files that matched strings modified in the English file will disappear from Transifex editor.
de: Bei einem Update der englischen Originaldatei, verschwinden im Transifex-Editor die Textpassagen aus der Übersetzung, die mit veränderten Textpassagen der Originaldatei verknüpft waren.
es: Después de una actualización de un archivo de texto original en Inglés, los textos en los archivos de traducción que coinciden con los textos modificados en el archivo en Inglés, desaparecerán en el editor de Transifex.
fr: Suite à une mise à jour d'un fichier texte originel en Anglais, les chaînes de caractères des fichiers de traduction correspondant aux chaînes modifiées dans le fichier en Anglais disparaîtront de l'éditeur de Transifex.
pt_pt: Após uma atualização de um ficheiro de texto original em Inglês, as linhas de texto em ficheiros de tradução que combinavam com as linhas modificadas no ficheiro Inglês desaparecerão do editor Transifex.
ru: При обновлении оригинального англоязычного файла те строки текста в переводе, которые совпадают с изменившимися строками из англоязычного файла, будут отброшены.
tr: Orjinal İngilizce bir metin dosyasındaki güncellemenin ardından, çeviri dosyası içinde İngilizce dosyasında değiştirilen dizlerle eşleşenler Transifex düzenleyicide ortadan kalkar.

source: You can save some typing if you kept a local copy of the translation (dowloading it from Transifex): copy the old translation from that local copy and paste it into Transifex editor, then edit it as need be.
de: Sie können manche Ihrer Texte wiederherstellen, wenn Sie vorher eine Kopie der Übersetzung machen (herunterladen über Transifex): Kopieren Sie die alte Übersetzung aus der lokal gespeicherten Kopie, fügen Sie sie im Online-Editor bei Transifex wieder ein und nehmen dann entsprechenden Korrekturen vor.
es: Puede evitarse escribirlos de nuevo si mantiene una copia local de la traducción (descargándola de Transifex): copie la traducción vieja de su copia local y péguela en el editor de Transifex, luego edítela como sea necesario.
fr: Vous pouvez économiser de la frappe en conservant une copie locale de la traduction, téléchargée depuis Transifex : copiez l'ancienne traduction et collez-là dans l'éditeur de Transifex, puis modifiez-la.
pt_pt: Você pode guardar alguma escrita se manter uma cópia local da tradução (transferindo-a do Transifex): copie a tradução antiga dessa cópia local e cole-a no editor Transifex, depois edite-o conforme necessário.
ru: На этот случай вы можете сохранить то, что набирали, если сделаете локальную копию перевода (загрузив его с Transifex), затем вы можете скопировать старый перевод из этой локальной копии и вставить его в редакторе Transifex, при необходимости отредактировав.
tr: Çevirinin yerel bir kopyasını tutarsanız yazımdan tasarruf edebilirsiniz (Transifex'den indirerek): Eski çeviriyi yerel dosyadan kopyalayın ve Transifex düzenleyicie yapıştırın, sonra gerekli şekilde düzenleyin.

source: Even easier, if your translation was already uploaded on the website: clicking on "Page Source" at the bottom of that page's menu will display the corresponding source text file.
de: Noch einfacher ist es, wenn Ihre Übersetzung bereits auf die Website hoch geladen wurde: Durch Klicken auf "Seitenquelltext" am unteren Rand des Menüs für die Seite wird die zugehörige Quelltextdatei angezeigt.
es: Aún más fácil, si su traducción ya había sido subida al sitio web: al hacer click en "Texto Fuente" al final del menú de la página, desplegará el texto fuente correspondiente.
fr: Encore plus facile, si votre traduction était déjà téléversée sur le site Internet : cliquer sur "Texte source" en bas du menu latéral de cette page affichera le texte source correspondant.
pt_pt: Ainda mais fácil, se a sua tradução já foi carregada no site da internet: clicando em "Código fonte da página" na parte inferior do menu dessa página irá exibir o ficheiro de texto fonte correspondente.
ru: Даже проще, если щелкнуть "Код страницы" внизу меню новой веб страницы, будет показан соответствующий исходный текстовый файл.
tr: Daha da kolayı, eğer çeviriniz web sayfasına yüklenmiş durumda ise: o sayfanın menüsünün alt taraftaki "Sayfa Kaynağı"na tıklama ilgili kaynak metin dosyasını gösterecektir.
