Repository: DidierSpaier/slint-website
Catalog: old/po/package/package.*.po
Languages: es, fr, ia, it, ru, tr, uk

source: |Polyglot tool|Purpose|Translated man page |adduser|Add an user to the system| |explodepkg|Extract the content of a Slackware package in the current directory|man explodepkg |installpkg|Install Slackware packages|man installpkg |makebootdisk|Make a bootable Linux floppy disk (only in Slackware 13.37 and 14.0)| |makepkg|Make Slackware packages|man makepkg |pkgtool|Maintain software packages and perform configuration tasks: => set services to run at startup => make an USB boot stick => set the mouse type|man pkgtool |removepkg|Remove Slackware packages|man removepkg |upgradepkg|Upgrade Slackware packages|man upgradepkg |eliloconfig|Configure 'elilo' boot loader (only in Slackware 14.1)| |liloconfig|Configure 'lilo' boot loader| |netconfig|Configure the network| |timeconfig|Sets the timezone| |setconsolefont|Sets a screen font| |setup.mouse|Sets the mouse type| |xorgsetup|Configure the X server| |xwmconfig|Sets the default windows manager or desktop| |slackpkg|Automated tools for managing Slackware packages (only manual pages are translated)|man slackpkg man slackpkg.conf
es: |Herramienta políglota|Propósito|Página de manual traducida |adduser|Agregar un usuario al sistema| |explodepkg|Extraer el contenido de un paquete Slackware en el directorio actual|man explodepkg |installpkg|Instalar paquetes Slackware|man installpkg |makebootdisk|Crear un disquete de arranque Linux (solo en Slackware 13.37 y 14.0)| |makepkg|Crear paquetes Slackware|man makepkg |pkgtool|Administrar paquetes de software y realizar tareas de configuración: => establecer cuáles servicios se ejecutan al inicio => crear un dispositivo USB de arranque => establecer el tipo de ratón|man pkgtool |removepkg|Eliminar paquetes Slackware|man removepkg |upgradepkg|Actualizar paquetes Slackware|man upgradepkg |eliloconfig|Configurar el gestor de arranque 'elilo' (solo en Slackware 14.1)| |liloconfig|Configurar el gestor de arranque 'lilo'| |netconfig|Configurar la red| |timeconfig|Establecer la zona horaria| |setconsolefont|Establecer una fuente para la pantalla| |setup.mouse|Establecer el tipo de ratón| |xorgsetup|Configurar el servidor X| |xwmconfig|Establecer el manejador de ventanas o escritorio predeterminado| |slackpkg|Herramientas automatizadas para manejar paquetes Slackware (solo páginas de manual están traducidas)|man slackpkg man slackpkg.conf
fr: |Outil polyglotte|Fonction|Page de manuel traduite |adduser|Ajouter un utilisateur au système| |explodepkg|Extraire le contenu d'un paquet Slackware dans le répertoire en cours|man explodepkg |installpkg|Installer des paquets Slackware|man installpkg |makebootdisk|Faire une disquette de démarrage Linux (seulement dans Slackware 13.37 et 14.0)| |makepkg|Construire des paquets Slackware|man makepkg |pkgtool|Maintenir des paquets logiciels et effectuer des tâches de configuration : => définir les services à lancer au démarrage => faire une clef USB de démarrage => définir le type de souris|man pkgtool |removepkg|Enlever des paquets Slackware|man removepkg |upgradepkg|Mettre à niveau des paquets Slackware|man upgradepkg |eliloconfig|Configurer le démarreur 'elilo' (seulement dans Slackware 14.1)| |liloconfig|Configurer le démarreur 'lilo'| |netconfig|Configurer le réseau| |timeconfig|Définir le fuseau horaire| |setconsolefont|Choisir un police d'écran| |setup.mouse|Définir le type de souris| |xorgsetup|Configurer le serveur X| |xwmconfig|Définir le gestionnaire de fenêtre ou bureau par défaut| |slackpkg|Outils de gestion automatisée des paquets Slackware (seulement les pages de manuels sont traduites)|man slackpkg man slackpkg.conf
ia: |Instrumento polyglotte|Intention|Pagina de man traducite |adduser|Adde un usator al systema| |explodepkg|Extrahe le contento de un pacchetto de Slackware in le directorio currente|man explodepkg |installpkg|Installa pacchettos de Slackware|man installpkg |makebootdisk|Crea un floppy disk que face le boot de Linux (solmente in Slackware 13.37 e 14.0)| |makepkg|Crea pacchettos de Slackware|man makepkg |pkgtool|Mantene pacchettos software e exeque cargas de configuration: => fixa servicios pro executar servicios al initio => crea un clave USB de boot => fixa le typo de mus|man pkgtool |removepkg|Remove pacchettos de Slackware|man removepkg |upgradepkg|Actualisa pacchettos de Slackware|man upgradepkg |eliloconfig|Configura le cargator de boot 'elilo' (solmente in Slackware 14.1)| |liloconfig|Configura le cargator de boot 'lilo'| |netconfig|Configura le rete| |timeconfig|Fixa le fuso horari| |setconsolefont|Fixa un font de schermo| |setup.mouse|Fixa le typo de mus| |xorgsetup|Configura le servitor X | |xwmconfig|Fixa le gerente de fenestra o scriptorio predefinite| |slackpkg|Instrumentos automatic pro gerer pacchettos de Slackware (solmente paginas manual es traducite)|man slackpkg man slackpkg.conf
it: |Strumento multilingua|Obiettivo|Pagina del manuale tradotta |adduser|Aggiunge un utente al sistema| |explodepkg|Estrae il contenuto di un pacchetto Slackware nella cartella corrente|man explodepkg |installpkg|Installa i pacchetti Slackware|man installpkg |makebootdisk|Crea un dischetto di Linux avviabile (solo per Slackware 13.37 and 14.0)| |makepkg|Crea i pacchetti Slackware|man makepkg |pkgtool|Mantiene i pacchetti ed esegue i task di configurazione: => imposta i servizi da lanciare all'avvio => crea una chiavetta USB avviabile => imposta il tipo di mouse|man pkgtool |removepkg|Rimuove i pacchetti Slackware|man removepkg |upgradepkg|Aggiorna i pacchetti Slackware|man upgradepkg |eliloconfig|Configura il gestore di avvio 'elilo' (solo per Slackware 14.1)| |liloconfig|Configura il gestore di avvio 'lilo'| |netconfig|Configura la rete| |timeconfig|Imposta il fuso orario | |setconsolefont|Imposta un carattere per lo schermo| |setup.mouse|Imposta il tipo di mouse| |xorgsetup|Configura l' X server| |xwmconfig|Imposta il gestore delle finestre predefinito o il desktop| |slackpkg|Strumenti automatizzati per gestire i pacchetti Slackware (solo le pagine del manuale sono tradotte)|man slackpkg man slackpkg.conf
ru: |Многоязычный инструмент|Назначение|Переведенная страница руководства |adduser|Добавляет пользователя в систему| |explodepkg|Извлекает содержимое пакета Slackware в текущий каталог|man explodepkg |installpkg|Устанавливает пакеты Slackware|man installpkg |makebootdisk|Создает загрузочную дискету Linux (только в Slackware 13.37 и 14.0)| |makepkg|Создает пакеты Slackware|man makepkg |pkgtool|Обслуживает пакеты программного обеспечения и выполняет задачи настройки: => выбрать сервисы для запуска при загрузке => создать загрузочный USB-носитель => выбрать тип мыши|man pkgtool |removepkg|Удаляет пакеты Slackware|man removepkg |upgradepkg|Обновляет пакеты Slackware|man upgradepkg |eliloconfig|Настраивает загрузчик 'elilo' (только в Slackware 14.1)| |liloconfig|Настраивает загрузчик 'lilo'| |netconfig|Настраивает сеть| |timeconfig|Выбирает временную зону| |setconsolefont|Устанавливает шрифт консоли| |setup.mouse|Выбирает тип мыши| |xorgsetup|Настраивает сервер X| |xwmconfig|Выбирает оконный менеджер или рабочий стол по умолчанию| |slackpkg|Автоматизированные инструменты для управления пакетами Slackware (переведены только страницы руководств)|man slackpkg man slackpkg.conf
tr: |Çok dilli araç|Amaç|Çevirilmiş kılavuz sayfası |adduser|Sisteme bir kullanıcı ekler| |explodepkg|Aktif dizin içine bir Slackware paketini açar|man explodepkg |installpkg|Slackware paketleri kurar|man installpkg |makebootdisk|Önyüklenebilir Linux floppy diski oluşturur (yalnızca Slackware 13.37 ve 14.0'da) |makepkg|Slackware paketleri yapar|man makepkg |pkgtool|Yazılım paketleri bakımı ve yapılandırma görevleri gerçekleştirilmesi: => servisleri açılışta başlaması için ayarlar => bir USB başlangıç disketi hazırlayın => fare tipini belirleyin|man pkgtool |removepkg|Slackware paketlerini kaldırır|man removepkg |upgradepkg|Slackware paketlerini günceller|man upgradepkg |eliloconfig|'elilo' önyükleyicisini yapılandırın (yalnızca Slackware 14.1'de) |liloconfig| 'lilo' önyükleyicisini yapılandırın |netconfig| Ağ'ı yapılandırın |timeconfig|Zaman dilimini belirler| |setconsolefont|Ekran fontu ayarlar| |setup.mouse|Fare tipini belirler| |xorgsetup|X sunucusunu yapılandır| |xwmconfig|Varsayılan pencere yöneticisini veya masaüstünü belirler| |slackpkg|Slackware otomatik paket yönetim araçları (sadece kılavuz sayfaları çevirilmiştir)|man slackpkg man slackpkg.conf
uk: |Багатомовний інструмент|Призначення|Перекладена сторінка керівництва |adduser|Додає користувача до системи| |explodepkg|Витягує вміст пакунку Slackware до поточного каталоґу|man explodepkg |installpkg|Встановлює пакунки Slackware|man installpkg |makebootdisk|Створює завантажувальну дискету Linux (лише у Slackware 13.37 та 14.0)| |makepkg|Створює пакунки Slackware|man makepkg |pkgtool|Обслуговує пакунки проґрамного забезпечення та виконує завдання налаштування: => обрати сервіси для запуску при завантаженні => створити завантажувальний USB-носій => обрати тип мишки|man pkgtool |removepkg|Вилучає пакунки Slackware|man removepkg |upgradepkg|Оновлює пакунки Slackware|man upgradepkg |eliloconfig|Налаштовує завантажувач 'elilo' (лише у Slackware 14.1)| |liloconfig|Налаштовує завантажувач 'lilo'| |netconfig|Налаштовує мережу| |timeconfig|Обирає часову зону| |setconsolefont|Встановлює шрифт консолі| |setup.mouse|Обирає тип мишки| |xorgsetup|Налаштовує X сервер| xwmconfig|Обирає типовий віконний менеджер або стільницю| |slackpkg|Автоматизовані інструменти для керування пакунками Slackware (перекладено лише сторінки керівництв)|man slackpkg man slackpkg.conf

source: To see polyglot tools' messages and manual pages in your language, you should, as indicated in Slint home page, link:slint.html#anchor-1[set up your prefered locale]
es: Para ver los mensajes de las herramientas políglotas y las páginas de manual en su lenguaje, es necesario link:slint.html.es#anchor-1[establecer su localización preferida], como se indica en la página principal de Slint.
fr: Pour voir les messages des outils polyglottes et les pages de manuels dans votre langue, il faut, comme indiqué dans la page d'accueil de Slint, link:slint.html#anchor-1[définir votre locale préférée]
ia: Pro vider messages de instrumentos polyglotte e paginas manual in tu linguage , tu deberea, como indicate in le pagina principal de Slint, link:slint.html#anchor-1[fixa tu localisation preferite]
it: Per vedere i messaggi degli strumenti multilingua e la pagine del manuale nella tua lingua, dovresti, come indicato nella pagina principale di Slint, link:slint.html#anchor-1[impostare la tua localizzazione preferita]
ru: Чтобы видеть сообщения многязычных инструментов и страницы руководств на вашем языке, вы должны, как показано на домашней странице Slint, link:slint.html#anchor-1[установить предпочтительную локаль]
tr: Çok dilli araçların mesajlarını ve kılavuz sayfalarını kendi dilinizde görmek için, Slint ev sayfasında belitildiği gibi, link:slint.html#anchor-1[set up your prefered locale] yapmalısınız
uk: Аби бачити повідомлення багатомовних інструментів та сторінки керівництв Вашою мовою, Ви повинні, як показано на домашній сторінці Slint, link:slint.html#anchor-1[встановити бажану локаль]

source: In addition, the Slint package also installs documents in the folder /usr/docs/slint-<version>-<date>, including a Slint-HOWTO.txt and a script reinstall-slackware-packages.sh.
es: Además, el paquete Slint también instala documentos en el directorio /usr/docs/slint-<versión>-<fecha>, incluyendo Slint-HOWTO.txt y un script llamado reinstall-slackware-packages.sh.
fr: En outre, le paquet Slint installe aussi des documents dans /usr/doc/slint-<version>-<date>, y compris un Slint-HOWTO.txt et un script reinstall-slackware-packages.sh.
ia: In addition, le pacchetto Slint anque installa documentos in le dossier /usr/docs/slint-<version>-<date>, includente un Slint-HOWTO.txt e un script reinstall-slackware-packages.sh.
it: In aggiunta, il pacchetto Slint installa pure i documenti nella cartella /usr/docs/slint-<version>-<date>, includendo uno Slint-HOWTO.txt e uno script reinstall-slackware-packages.sh.
ru: Кроме того, пакет Sint устанавливает документацию в каталог /usr/doc/slint-<версия>-<дата>, включая Slint-HOWTO.txt и сценарий reinstall-slackware-packages.sh.
tr: Ek olarak, Slint paketi bir Slint-HOWTO.txt dosyasını ve reinstall-slackware-packages.sh betiğini de içeren dökümanları /usr/docs/slint-<sürüm>-<tarih> dizinine yükler,
uk: Крім того, пакунок Slint встановлює документацію у директорію /usr/docs/slint-<version>-<date>, включаючи Slint-HOWTO.txt та файл сценарію reinstall-slackware-packages.sh.

source: to list what a Slint package has installed, just type in a terminal:
es: para listar lo que un paquete Slint ha instalado, solo escriba en una terminal:
fr: pour lister ce qu'un paquet Slint a installé, taper simplement dand un terminal :
ia: pro listar qual pacchetto de Slint ha installate, solmente typa in un terminal:
it: per elencare quello che ha installato il pacchetto SLINT, scrivi in un terminale:
ru: для получения списка установленных пакетов Slint наберите в терминале:
tr: Slint paketinin yüklediklerini görmek için terminal ekranına şunu yazın:
uk: за для переліку того, що встановив пакунок Slint, наберіть у терміналі:

source: Use the up and down arrows to navigate in the list, press the letter 'q' to quit.
es: Use las flechas arriba y abajo para navegar en la lista, presione la letra 'q' para salir.
fr: Utilisez les flèches vers le haut et vers le bas pour naviguer dans la liste, pressez la lettre 'q' pour quitter.
ia: Usa le flechas su e basso pro navigar in le lista, pressa le littera 'q' pro quitar.
it: Usa le frecce di Su e Giù per scorrere l'elenco, premi la lettera 'q' per abbandonare.
ru: Для перемещения по списку используйте стрелки вверх и вниз, для выхода нажмите "q".
tr: Liste içinde gezinmek için aşağı ve yukarı ok tuşlarını kullanın, çıkmak için 'q' tuşuna basın.
uk: Для навігації по списку використовуйте стрілки вгору та вниз, щоб вийти натисніть букву 'q' .
