Repository: DidierSpaier/slint-website
Catalog: old/po/package/package.*.po
Languages: es, fr, ia, it, ru, tr, uk

source: Slint package
es: Paquete Slint
fr: Le paquet Slint
ia: Pacchetto de Slint
it: Pacchetto Slint
ru: Пакет Slint
tr: Slint paketi
uk: Пакунок Slint

source: Slint package contains polyglot administration tools and manual pages as well as translation files, provided by the Slint project.
es: El paquete Slint contiene herramientas de administración políglotas, páginas de manual y archivos de traducción, preparados por el proyecto Slint.
fr: Le paquet Slint contient des outils d'administration polyglottes et des pages de manuels ainsi que des fichiers de traduction, fournis par le projet Slint.
ia: Pacchetto de Slint contine instrumentos de administration e paginas de manual polyglotte assi como files de traduction, fornite per le projecto Slint.
it: Il pacchetto Slint contiene gli strumenti di amministrazione multilingua e le pagine del manuale in aggiunta ai file tradotti, forniti dal progetto Slint.
ru: Пакет Slint содержит многоязычные инструменты администратора и страницы руководств, а также файлы переводов, предоставленные проектом Slint.
tr: Slint paketi çok dilli yönetim araçları ve kılavuz sayfaları içerdiği gibi Slint projesi tarafından sağlanan çeviri dosyaları da içerir.
uk: Пакунок Slint містить багатомовні інструменти адміністратора та сторінки керівництв, а також файли перекладів, надані проєктом Slint.

source: This page explains how to get and install it, then describes its content so you know what is translated in which languages.
es: Esta página explica cómo obtenerlo e instalarlo, y describe su contenido para que ud. sepa qué está traducido y en cuales lenguajes.
fr: Cette page explique comment l'obtenir et l'installer puis décrit son contenu, pour que vous sachiez ce qui est traduit et dans quelles langues.
ia: Iste pagina explica como obtener lo e installar lo, postea describe su contentos assi que tu sape lo que es traducite in qual linguages.
it: Questa pagina spiega come ottenerlo e installarlo, inoltre descrive il suo contenuto cosi' puoi sapere cosa è stato tradotto e in quali linguaggi.
ru: Эта страница объясняет как получить и установить пакет, а также описывает его содержимое, в том числе что и на какие языки переведено.
tr: Bu dosya bunun nasıl elde edileceğini ve kurulacağını açıklar, böylecekendi içeriğini tanımlar ve neyin hangi dile çevirileceğini bilirsiniz.
uk: Ця сторінка пояснює, як отримати та встановити пакунок, а також дає опис його вмісту, у тому числі, що та якими мовами перекладено.

source: Slint package's scope will expand gradually, so just ugrading it will allow you to get updated and newly translated tools and translations in more languages as soon as they become available.
es: El alcance del paquete Slint se expandirá gradualmente, de forma que solamente actualizarlo le permitirá obtener herramientas recientemente actualizadas y traducidas, así como traducciones en más lenguajes tan pronto estén disponibles.
fr: Le périmètre du paquet Slint s'élargira progressivement, aussi sa mise à niveau vous permettra-t-elle d'obtenir, aussitôt disponibles, des outils nouvellement traduits ou mis à jour, ainsi que des traductions dans de nouvelles langues.
ia: Le campo d application del pacchetto de Slint expandera gradualmente, assi que solmente actualisar lo te permittera mantener instrumentos actualisate e traducite recentemente in plure linguages quando illos es disponibile.
it: Gli obiettivi del pacchetto slint aumenteranno con il passare del tempo, cosi' aggiornandolo avrai nuovi strumenti tradotti e aggiornati e le traduzioni in piu' linguaggi appena sono disponibili.
ru: В пакет Slint постепенно будет включаться новое содержимое, простым обновлением пакета вы сможете получать новые переводы инструментов и текстов, как и дополнительные языки, по мере их выпуска.
tr: Slint paketlerinin kapsamı yavaş yavaş artacak, bu yüzden güncelleme sizin güncellenmiş ve yeni çevirilmiş araçları ve mümkün olur olmaz daha fazla dilde çevirileri elde etmenizi sağlayacak.
uk: До пакунку Slint поступово додаватиметься новий вміст, простим оновленням пакунку ви зможете отримувати нові переклади інструментів і текстів, як і додаткові мови, у міру їх випуску.

source: Download and install or upgrade a Slint package
es: Descargar e instalar o actualizar un paquete Slint
fr: Télécharger et installer ou mettre à niveau un paquet Slint
ia: Discarga e installa o actualisa un pacchetto de Slint
it: Scarica e installa o aggiorna il pacchetto Slint
ru: Загрузка и установка или обновление пакета Slint
tr: Bir Slint paketini indirip kurun ya da yükseltin
uk: Завантажити, встановити чи оновити пакунок Slint

source: If you just used Slint installer, there is no need to install the Slint package in addition: that's already done by the installer.
es: Si acaba de utilizar el instalador Slint, no hay necesidad de instalar el paquete Slint adicionalmente: eso ya fue hecho por el instalador.
fr: Si vous venez d'utiliser l'installateur Slint, pas besoin d'installer en plus le paquet Slint, c'est déjà fait par l'installateur
ia: Si tu usava solmente le installator de Slint, il non ha necessitate installar le pacchettos de Slint in addition: ja isto ha essite facite per le installator.
it: NOTA: se hai già usato l'installer di Slint, non c'è la necessità di installare il pacchetto Slint in aggiunta: questo è già stato fatto dall'installer.
ru: Если вы использовали установщик Slint, дополнительно устанавливать пакет Slint не нужно, это уже сделано установщиком.
tr: NOT: Slint kurucu kullandıysanız Slint paketi kurmanıza gerek yoktur: bu kurucu tarafından zaten yapılmıştır.
uk: НОТАТКА: Якщо ви використовували встановник Slint, додатково встановлювати пакунок Slint не потрібно, це вже зроблено інсталятором.

source: A Slint package is provided for each supported Slackware edition (Slackware 13.37, Slackware 14.0 and Slackware 14.1) in directory https://slint.fr/packages[packages/]. The same package can be installed on 32 bit and 64 versions. To get, check and install (or upgrade) 'Slint package' (for Slackware 14.1 in this example), do this:
es: Se provee un paquete Slint para cada edición soportada (Slackware 13.37, Slackware 14.0 y Slackware 14.1) en el directorio https://slint.fr/packages[packages/]. El mismo paquete puede ser instalado en las versiones de 32 y 64 bits. Para obtener, revisar e instalar (o actualizar) el 'paquete Slint' (para Slackware 14.1 en este ejemplo), haga lo siguiente:
fr: Un paquet Slint est fourni pour chaque édition Slackware supportée (Slackware 13.37, Slackware 14.0 et Slackware 14.1) dans le répertoire https://slint.fr/packages[packages/]. Le même paquet peut être installé sur les versions 32 et 64 bit. Pour obtenir, vérifier et installer (ou mettre à niveau) le 'Paquet Slint' (pour Slackware 14.1 dans cet exemple), faites ceci:
ia: Un pacchetto de Slint es fornite per cata edition supportate de Slackware (Slackware 13.37, Slackware 14.0 e Slackware 14.1) in directorio https://slint.fr/packages[packages/]. Le mesme pacchetto pote esser installate sur versiones de 32 e 64 bit. Pro obtener, verificar e installar (o actualisar) 'Pacchetto de Slint' (pro Slackware 14.1 in iste exemplo), face isto:
it: Un pacchetto Slint è disponibile per ogni versione di Slackware supportata (Slackware 13.37, Slackware 14.0 and Slackware 14.1) alla cartella https://slint.fr/packages[packages/]. Lo stesso pacchetto puo' essere installato sia su sistemi a 32 bit che su quelli a 64. Per ottenere, verificare e installare (o aggiornare) il 'pacchetto Slint' (per Slackware 14.1 in questo esempio), procedi in questo modo:
ru: Пакет Slint представлен для каждого поддерживаемого выпуска Slackware (Slackware 13.37, Slackware 14.0 и Slackware 14.1) в каталоге https://slint.fr/packages[packages/]. Пакет подходит как для 32-разрядной, так и для 64-разрядной редакции. Чтобы получить, проверить и установить (или обновить) пакет Slint (например, для Slackware 14.1), выполните следующее:
tr: Bir Slin paketi desteklenmiş her Slackware yayımı için (Slackware 13.37, Slackware 14.0 and Slackware 14.1) https://slint.fr/packages[packages/] dizininde bulunur. aynı paket 32 bit ve 64 bit sürümünde kurulabilir. 'Slint paketi' (bu örnekte Slackware 14.1 için) edinmek, denetlemek ve kurmak (ya da güncellemek) için şunu yapın:
uk: Пакунок Slint надано для кожного підтримуваного випуску Slackware (Slackware 13.37, Slackware 14.0 та Slackware 14.1) у каталозі https://slint.fr/packages[packages/]. Пакунок підходить як для 32-розрядної, так і для 64-розрядної редакції. Щоб отримати, перевірити та встановити (або оновити) пакунок Slint (наприклад, для Slackware 14.1), виконайте таке:

source: wget -r -l1 -np -nd -A slint-14.1* https://slint.fr/packages/ # you will get the most recent Slint package and its associated md5 file md5sum -c slint-14.1*md5 # answer should be "OK", else downloaded package is corrupt su # get root's privileges upgradepkg --install-new --reinstall slint-14.1*txz # this command installs or upgrade the package
es: wget -r -l1 -np -nd -A slint-14.1* https://slint.fr/packages/ # obtendrá el paquete Slint más reciente y su archivo md5 asociado md5sum -c slint-14.1*md5 # la respuesta debe ser "OK", de otra forma el paquete descargado está dañado su # obtener privilegios de root upgradepkg --install-new --reinstall slint-14.1*txz # este comando instala o actualiza el paquete
fr: wget -r -l1 -np -nd -A slint-14.1* # vous obtiendrez le paquet Slint le plus récent et son fichier md5 associé. md5sum -c slint-14.1*md5 # La réponse devrait être "OK", sinon le paquet téléchargé est corrompu. su # obtenez les privilèges de l'utilisateur 'root' upgradepkg --install-new --reinstall slint-14.1*txz # cette commande installera ou mettra à niveau le paquet
ia: wget -r -l1 -np -nd -A slint-14.1* https://slint.fr/packages/ # tu obtenera le plus recente pacchetto de Slint e su associate file md5 md5sum -c slint-14.1*md5 # responsa deberea esser "OK", alteremente le pacchetto discargate es corrumpite su # obtene privilegios de radice o root upgradepkg --install-new --reinstall slint-14.1*txz # iste commando installa o actualisa le pacchetto
it: wget -r -l1 -np -nd -A slint-14.1* https://slint.fr/packages/ # avrai il piu' recente pacchetto Slint e il suo file md5 associato md5sum -c slint-14.1*md5 # la risposta dovrebbe essere "OK", in caso contrario il pacchetto scaricato è corrotto su # per avere i privilegi di root upgradepkg --install-new --reinstall slint-14.1*txz # questo comando installa o aggiorna il pacchetto
ru: wget -r -l1 -np -nd -A slint-14.1* https://slint.fr/packages/ # получите свежайший пакет Slint и файл md5 md5sum -c slint-14.1*md5 # ответ должен быть положительным, иначе загруженный пакет поврежден su # получите права root-а upgradepkg --install-new --reinstall slint-14.1*txz # эта команда установит или обновит пакет
tr: wget -r -l1 -np -nd -A slint-14.1* https://slint.fr/packages/ # en son Slint paketi ve ilişkili md5 dosasını elde edeceksiniz md5sum -c slint-14.1*md5 # yanıt "OK" olmalı, değilse indirilen paket bozulmuştur su # root izinleri alır upgradepkg --install-new --reinstall slint-14.1*txz # bu komut paketi kurar ya da günceller
uk: wget -r -l1 -np -nd -A slint-14.1* https://slint.fr/packages/ # отримайте найновіший пакунок Slint та файл md5 md5sum -c slint-14.1*md5 # відповідь повинна бути позитивною, інакше завантажений пакунок пошкоджено su # отримайте права root-а upgradepkg --install-new --reinstall slint-14.1*txz # ця команда встановить або оновить пакунок

source: To prevent 'slackpkg' from removing 'Slint package', add a line to /etc/slackpkg/blacklist with only this word: + slint
es: Para prevenir que 'slackpkg' elimine el 'paquete Slint', agregue una línea a /etc/slackpkg/blacklist con solo esta palabra: + slint
fr: Pour empêcher 'slackpkg' d'enlever le 'paquet Slint', joutez une ligne à /etc/slackpkg/blacklist avec ce seul mot : + slint
ia: Pro evitar que 'slackpkg' remove 'pacchettos de Slint', adde un rango a /etc/slackpkg/blacklist con solmente iste parola: + slint
it: Per prevenire 'slackpkg' dal rimuovere il 'pacchetto Slint', aggiungi una linea a /etc/slackpkg/blacklist con solo questa parola: + slint
ru: Чтобы 'slackpkg' не удалял 'пакет Slint', добавьте в /etc/slackpkg/blacklist строку, содержащую: + slint
tr: 'slackpkg' nin 'Slint paketi' kaldırmasının önüne geçmek için, /etc/slackpkg/blacklist e sadece bu kelimeyle bir satır ekleyin: + slint
uk: Аби 'slackpkg' не вилучав 'пакунок Slint', додайте до /etc/slackpkg/blacklist рядок, що містить: + slint

source: What is translated, in what languages?
es: ¿Qué está traducido y en cuáles lenguajes?
fr: Qu'est-ce qui est traduit, en quels langues ?
ia: Que es traducite, in qual linguage?
it: Cosa è stato tradotto, in quali linguaggi?
ru: Что переведено, на какие языки?
tr: Ne, hangi dile çevirildi?
uk: Що перекладено, якими мовами?

source: A Slint package contains polyglot tools and translation files.
es: Un paquete Slint contiene herramientas políglotas y archivos de traducción.
fr: Un paquet Slint contenant des outils polyglottes et des fichiers de traduction
ia: Un pacchetto de Slint contine instrumentos polyglotte e files de traduction.
it: Un pacchetto Slint contiene gli strumenti multilingua e i file tradotti.
ru: Пакет Slint содержит многоязычные инструменты и файлы перевода.
tr: Bir slint paketi çok dilli araçlar ve çeviri dosyaları içerir.
uk: Пакунок Slint містить багатомовні інструменти та файли перекладу.

source: At the time of writing, the following languages are included: French, German, Polish, Portuguese (Brazil), Russian, Spanish (Latin America) and Ukrainian.
es: Al momento de escribir esto, los siguientes lenguajes están incluidos: Francés, Alemán, Polaco, Portugués (Brasil), Ruso, Español (América Latina) y Ucraniano.
fr: Au moment de la rédaction, les langues suivantes sont inclues : Allemand, Espagnol (Amérique latine), Français, Polonais, Portugais (Brésil), Russe et Ukrainien
ia: Al momento que on scribe, le sequente linguages es includite: Francese, Germano, Polonese, Portugese (Brasil), Russo, Espaniol (America Latin) e Ukrainiano.
it: Al momento sono disponibili i seguenti linguaggi: Francese, Tedesco, Polacco, Portoghese (Brasile), Russo, Spagnolo (America Latina) e Ucraino.
ru: На дату составления этого документа включены следующие языки: русский, украинский, французский, немецкий, польский, португальский (бразильский) и испанский (латиноамериканский).
tr: Yazım sırasında şu diller dahil edildi: Fransızca, Almanca, Polonyaca, Portekizce (Brezilya), Rusça (Latin America) ve Ukraynaca.
uk: На дату складання цього документу включено такі мови: українська, російська, французька, німецька, польська, портуґальська (Бразилія) та іспанська (Латинська Америка).

source: Some manual pages are also translated to other languages, as indicated in https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT].
es: Algunas páginas de manual son también traducidas a otros lenguajes, como se indica en https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT].
fr: Quelques pages de manuel sont traduites dans d'autres langues, comme indiqué dans https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT].
ia: Alcun paginas de manual es anque traducite in altere linguages, como indicate in https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT].
it: Alcune pagine del manuale sono anche tradotte in altri linguaggi, come indicato su https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT].
ru: Некоторые страницы руководств также переведены на другие языки, их список приведён в https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT].
tr: Bazı kılavuz sayfaları ayrıca diğer dillere çevirilmiştir, https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT] de belirtildiği gibi.
uk: Деякі сторінки керівництв також перекладено іншими мовами, їхній перелік наведено у https://slint.fr/packages/MAN_PAGES.TXT[MAN_PAGES.TXT].

source: Table below list polyglot administration tools and their purposes.
es: La tabla abajo lista las herramientas de administración políglotas y sus propósitos.
fr: Le tableau ci-dessous liste les outils d'administration polyglottes et leurs fonctions.
ia: Tabella a basso lista instrumentos de administration polyglotte e lor intentiones.
it: La tabella sotto elenca gli strumenti di amministrazione multilingua e i loro obiettivi.
ru: В таблице ниже приведены моногоязычные инструменты администратора и их назначение.
tr: Aşağıdaki tablo çok dilli yönetim araçlarını ve bunların amaçlarını listeler.
uk: У таблиці нижче наведено багатомовні інструменти адміністратора та їх призначення.
